In [1]:
import pandas as pd
import numpy as np

# 2.2 Объект Series в Pandas и его создание

In [2]:
# создание объекта Series из списка
my_list = [1, 2, 3, 4, 5]
s = pd.Series(my_list)
print(s)

# создание объекта Series из массива NumPy
my_array = np.array([1, 2, 3, 4, 5])
s = pd.Series(my_array, list('zxcvb'))
print(s)

# создание объекта Series из словаря Python
my_dict = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
s = pd.Series(my_dict)
print(s)

# создание объекта Series из списка кортежей
s = pd.Series([(1, 'a'), (2, 'b'), (3, 'c')])
print(s)

# создание объекта Series из скалярного значения
s = pd.Series(5, index=['a', 'b', 'c'])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64
z    1
x    2
c    3
v    4
b    5
dtype: int32
a    1
b    2
c    3
d    4
e    5
dtype: int64
0    (1, a)
1    (2, b)
2    (3, c)
dtype: object
a    5
b    5
c    5
dtype: int64

In [3]:
# создание объекта Series
s1 = pd.Series([1, 2, 3])

# создание нового объекта Series на основе существующего
s2 = pd.Series(s1)
print(s2)

0    1
1    2
2    3
dtype: int64

In [4]:
s = pd.Series([1, 2, 3], {1, 2, 3})
s = pd.Series([1, 2, 3], (1, 2, 3))
s = pd.Series([1, 2, 3], [1, 2, 3])
s

1    1
2    2
3    3
dtype: int64

In [5]:
print(__import__('pandas').Series(dict(zip('abc', [1, 4, 6, 2]))))

a    1
b    4
c    6
dtype: int64

In [6]:
arr = [1, 2, 3, 4, 5]

print(pd.Series(np.array(arr), [*'abcdf']))

a    1
b    2
c    3
d    4
f    5
dtype: int32

In [7]:
# a = tuple((i, j) for i, j in zip(list(map(str, input().split())), list(map(int, input().split()))))
a = tuple((i, j) for i, j in zip([1, 2, 3], list('abc')))
pd.Series(a)

0    (1, a)
1    (2, b)
2    (3, c)
dtype: object

In [8]:
# a = (zip(input().split(), input().split()))
a = (zip([1,2,3], [*'abc']))
pd.Series(a)

0    (1, a)
1    (2, b)
2    (3, c)
dtype: object

In [9]:
s = 'Prived Medved Kag Dela'
pd.Series(s.split(' '))

0    Prived
1    Medved
2       Kag
3      Dela
dtype: object

In [10]:
from string import ascii_lowercase

# data = [bool(i) for i in list(map(int, input().split()))]
data = [0, 1, 0, 0, 1]
data = [bool(i) for i in data]
pd.Series(data, list(ascii_lowercase[:len(data)]))

a    False
b     True
c    False
d    False
e     True
dtype: bool

In [11]:
# data = np.array(input().split()).astype(int)
data = np.array([0, 1, 0, 0, 1])
pd.Series(data == 1, index=list(ascii_lowercase)[:len(data)])

a    False
b     True
c    False
d    False
e     True
dtype: bool

In [12]:
pd.Series(['2022-01-01', '2022-01-02', '2022-01-03'])

0    2022-01-01
1    2022-01-02
2    2022-01-03
dtype: object

In [13]:
# n, m = (int(i) for i in input().split())
n, m = -5, 35
data = list(range(n, m + 1, 10))
ind = list(range(1, 2 * len(data), 2))
pd.Series(data, ind)

1    -5
3     5
5    15
7    25
9    35
dtype: int64

# 2.3 Атрибуты index и values объекта Series

In [14]:
# Создание объекта Series с пользовательскими метками
s = pd.Series(data=[10, 20, 30, 40], index=['a', 'b', 'c', 'd'])

# Просмотр меток
print(s.index)

# Просмотр данных
print(s.values)

Index(['a', 'b', 'c', 'd'], dtype='object')
[10 20 30 40]

In [15]:
# Создание объекта Series с пользовательскими метками
s = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])

# Выбор элементов по меткам
print(s['a'])
print(s[['a', 'c']])

10
a    10
c    30
dtype: int64

In [16]:
# Изменение элемента по метке
s['a'] = 50

# Просмотр измененных данных
print(s.values)

[50 20 30 40]

In [17]:
# Выполнение операции над элементами
s = s * 2

# Просмотр измененных данных
print(s.values)

[100  40  60  80]

In [18]:
# Создайте объект Series, содержащий первые 10 нечетных чисел, с метками - буквами латинского алфавита в верхнем регистре.
from string import ascii_uppercase
pd.Series(range(10), list(ascii_uppercase[:10])).head()

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [19]:
# Создайте объект Series, содержащий буквы латинского алфавита в нижнем регистре. Выведите на печать атрибуты index и values полученного объекта, каждый с новой строки.
data = pd.Series(list(ascii_lowercase))
print(data.index)
print(data.values)

RangeIndex(start=0, stop=26, step=1)
['a' 'b' 'c' 'd' 'e' 'f' 'g' 'h' 'i' 'j' 'k' 'l' 'm' 'n' 'o' 'p' 'q' 'r'
 's' 't' 'u' 'v' 'w' 'x' 'y' 'z']

In [20]:
states = ['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California', 'Colorado', 'Connecticut', 
          'Delaware', 'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana', 'Iowa']
populations = [4903185, 731545, 7278717, 3017825, 39538223, 578713, 3605944, 986809, 21538187,
 10711908, 1455271, 1826156, 12671821, 6745354, 3179849]
data = pd.Series(populations, states)
# print(data[input()])
s = 'Florida'
print(data[s])

21538187

In [21]:
# print(data[input().split()])
s = ['Arizona', 'California',  'Florida',  'Hawaii']
print(data[s])

Arizona        7278717
California    39538223
Florida       21538187
Hawaii         1455271
dtype: int64

In [22]:
ind = ['2022-05-01', '2022-05-02', '2022-05-03']
data = [64, 73, 71]
variables = ['2022-05-01', '2022-05-03']

ser = pd.Series(data, ind)
print(ser[variables])

2022-05-01    64
2022-05-03    71
dtype: int64

In [23]:
ind = ['2022-05-01', '2022-05-02', '2022-05-03']
data = [64, 73, 71]
variables = ['2022-05-01', '2022-05-03']

ser = pd.Series(data, ind)
print(*ser[variables])

64 71

In [24]:
from datetime import date, timedelta
np.random.seed(33)
dates = list(map(str,[date(2019, 1, 4) + timedelta(days=i) for i in range(360)]))
temperatures = np.random.randint(-10, 35, len(dates))
dates = pd.to_datetime(dates)
ser = pd.Series(temperatures, dates) # приведение к типу datetime
n = 3 # номер месяца
print(ser[dates.month == n].head())

2019-03-01    23
2019-03-02     5
2019-03-03     4
2019-03-04     4
2019-03-05    18
dtype: int32

In [25]:
names = ['Иван', 'Олег', 'Татьяна', 'Марина', 'Алексей', 'Андрей']
scores = [65, 61, 83, 68, 69, 99]
request = ['Олег', 'Татьяна']
ser = pd.Series(scores, names)
print(*ser[request].values)

61 83

In [26]:
countries = ['Россия', 'США', 'Китай', 'Индия', 'Япония', 'Германия', 'Великобритания', 'Франция', 'Италия', 'Канада', 'Южная_Корея', 'Австралия']
populations = [144.5, 328.2, 1393.0, 1366.0, 126.5, 83.1, 66.7, 66.99, 60.4, 37.59, 51.78, 25.4]
n, m = 'Япония', 110
ser = pd.Series(populations, countries)
print(ser.head())
ser[n] = m
print(ser.head())

Россия     144.5
США        328.2
Китай     1393.0
Индия     1366.0
Япония     126.5
dtype: float64
Россия     144.5
США        328.2
Китай     1393.0
Индия     1366.0
Япония     110.0
dtype: float64

In [27]:
dates = ['2022-06-04', '2022-06-05', '2022-06-06', '2022-06-07', '2022-06-08', '2022-06-09', '2022-06-10']
temperatures = [68, 72, 75, 70, 68, 73, 79]
ser = pd.Series(temperatures, dates)

ind = ser.index

val = (ser.values - 32) * 5/9
ser = pd.Series(val, ind)
print(ser)

2022-06-04    20.000000
2022-06-05    22.222222
2022-06-06    23.888889
2022-06-07    21.111111
2022-06-08    20.000000
2022-06-09    22.777778
2022-06-10    26.111111
dtype: float64

In [28]:
ser = ser.apply(lambda x: int(x / (5/9) + 32))
print(ser)

2022-06-04    68
2022-06-05    72
2022-06-06    75
2022-06-07    70
2022-06-08    68
2022-06-09    73
2022-06-10    79
dtype: int64

In [29]:
ser = (ser - 32) * 5 / 9
print(ser)

2022-06-04    20.000000
2022-06-05    22.222222
2022-06-06    23.888889
2022-06-07    21.111111
2022-06-08    20.000000
2022-06-09    22.777778
2022-06-10    26.111111
dtype: float64

# 2.4 Атрибут dtype объекта Pandas

In [30]:
# создание серии со значениями с плавающей точкой
s = pd.Series([1, 2, 3, 4, 5], dtype='float')
print(s)

# создание серии с целочисленными значениями
s = pd.Series([1, 2, 3, 4, 5], dtype=int)
print(s)

# создание серии с датами
s = pd.Series(['2022-04-01', '2022-04-02', '2022-04-03'], dtype='datetime64[ns]')
print(s)

# создание серии с категориальными значениями
s = pd.Series(["dog", "cat", "dog", "fish", "cat"], dtype="category")
print(s)

# создание серии из списка, содержащего строковые значения
s = pd.Series(['apple', 'banana', 'cherry'])
print(s)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64
0    1
1    2
2    3
3    4
4    5
dtype: int32
0   2022-04-01
1   2022-04-02
2   2022-04-03
dtype: datetime64[ns]
0     dog
1     cat
2     dog
3    fish
4     cat
dtype: category
Categories (3, object): ['cat', 'dog', 'fish']
0     apple
1    banana
2    cherry
dtype: object

In [31]:
ser = pd.Series([True, False, True], index=list('xyz'), dtype='bool')
print(ser)
ser[:] = False
print(ser)

x     True
y    False
z     True
dtype: bool
x    False
y    False
z    False
dtype: bool

In [32]:
ser = pd.Series([10, 20, 30, 40], index=list('abcd'), dtype='float64')
print(ser)
ser *= 2
print(ser)
print(ser.mean())

a    10.0
b    20.0
c    30.0
d    40.0
dtype: float64
a    20.0
b    40.0
c    60.0
d    80.0
dtype: float64
50.0

# 2.5 Применение математических функций и операторов к объекту Series

In [33]:
# Функции из модуля math:
# math.sin(x) - возвращает синус x (x в радианах)
# math.cos(x) - возвращает косинус x (x в радианах)
# math.tan(x) - возвращает тангенс x (x в радианах)
# math.exp(x) - возвращает экспоненту x
# math.log(x) - возвращает натуральный логарифм x
# math.sqrt(x) - возвращает квадратный корень из x

# Функции из модуля numpy:
# numpy.abs(x) - возвращает абсолютное значение x
# numpy.round(x, n) - округляет x до n знаков после запятой
# numpy.floor(x) - округляет x вниз до ближайшего целого числа
# numpy.ceil(x) - округляет x вверх до ближайшего целого числа
# numpy.power(x, n) - возвращает x в степени n
# numpy.exp(x) - возвращает экспоненту x
# numpy.log(x) - возвращает натуральный логарифм x
# numpy.sqrt(x) - возвращает квадратный корень из x

In [34]:
s1 = pd.Series([1, 2, 3]) 
s2 = pd.Series([4, 5, 6]) 
s3 = s1 + s2 
print(s3)

0    5
1    7
2    9
dtype: int64

In [35]:
s1 = pd.Series([1, 2, 3]) 
s2 = pd.Series([4, 5, 6]) 
mask = s1 < s2 
print(mask)

0    True
1    True
2    True
dtype: bool

In [36]:
s1 = pd.Series([1, 2, 3]) 
s2 = pd.Series([4, 5, 6]) 
mask = (s1 < s2) & (s1 > 2)
print(mask)

0    False
1    False
2     True
dtype: bool

In [37]:
s1 = pd.Series([7, 2, 3]) 
s2 = pd.Series([4, 5, 6]) 
mask = s1 < s2 
print(mask) 

s3 = pd.Series([10, 20, 30]) 
s4 = s3[mask] 
print(s4)

0    False
1     True
2     True
dtype: bool
1    20
2    30
dtype: int64

In [38]:
# создание pd.Series
s = pd.Series([0, 1, 2, 3])

# вычисление экспоненты и логарифма
exp_s = np.exp(s)
log_s = np.log(s)

# вывод результатов
print(exp_s)
print(log_s)

0     1.000000
1     2.718282
2     7.389056
3    20.085537
dtype: float64
0        -inf
1    0.000000
2    0.693147
3    1.098612
dtype: float64

c:\Users\kuche\anaconda3\Lib\site-packages\pandas\core\arraylike.py:399: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

In [39]:
s1 = pd.Series([1, 2, 3]) 
s2 = pd.Series([4, 5, 6]) 
mask = s1 > 2 
s3 = s1[mask] + s2[mask] 
print(s3)

2    9
dtype: int64

In [40]:
ser1 = pd.Series([1, 2, 3], dtype='int16')
ser2 = pd.Series([2, 4, 6], dtype='int16')
print(ser1+ser2)
print(ser1*ser2)

0    3
1    6
2    9
dtype: int16
0     2
1     8
2    18
dtype: int16

In [41]:
ser = pd.Series([1, 2, 3, 4, 5], index=list('abcde'))
print(ser[ser<3])

a    1
b    2
dtype: int64

In [42]:
ser = pd.Series([10, 20, 30])
ser = ser > 15
ser

0    False
1     True
2     True
dtype: bool

In [43]:
ser1 = pd.Series([1.0, 2.0, 3.0])
ser2 = np.sqrt(np.exp(ser1) - np.log(ser1)).round(2)
print(ser2)

0    1.65
1    2.59
2    4.36
dtype: float64

In [44]:
ser1 = pd.Series([1, 4, 5, 3, 7, 9, 8, 2], dtype='uint32')
print(ser1)
ser2 = ser1[(ser1 % 2) == 1]
print(ser2)

0    1
1    4
2    5
3    3
4    7
5    9
6    8
7    2
dtype: uint32
0    1
2    5
3    3
4    7
5    9
dtype: uint32

In [45]:
s = pd.Series(['cat', 'fish', 'can', 'able', 'call'], dtype='string')
char = 'c'
s[s.str.startswith(char)]

0     cat
2     can
4    call
dtype: string

In [46]:
ser = pd.Series(['2021-01-01', '2021-02-21', '2021-03-18', '2021-05-02', '2021-08-11', '2021-12-12'], dtype='datetime64[ns]')
print(ser)
print(ser[ser.between('2021-03-18', '2021-09-22', inclusive='neither')])

0   2021-01-01
1   2021-02-21
2   2021-03-18
3   2021-05-02
4   2021-08-11
5   2021-12-12
dtype: datetime64[ns]
3   2021-05-02
4   2021-08-11
dtype: datetime64[ns]

In [47]:
s = pd.Series(['абрек', 'аул', 'барнаул', 'кит', 'арнлк'], dtype='string')
print(s)
s2 = s[(s.str.startswith('a')) & (s.str.endswith('к'))]
print(s2)

0      абрек
1        аул
2    барнаул
3        кит
4      арнлк
dtype: string
Series([], dtype: string)

# 2.7 Атрибут name объекта Series

In [48]:
data = [1, 2, 3]
s = pd.Series(data, name="my_series")
print(s)

0    1
1    2
2    3
Name: my_series, dtype: int64

In [49]:
s = pd.Series(data)
print(s)
s.name = 'my_series'
print(s)

0    1
1    2
2    3
dtype: int64
0    1
1    2
2    3
Name: my_series, dtype: int64

In [50]:
data = [1, 2, 3, 4, 5]
index = pd.Index(data, name="my_index")
print(index)

Index([1, 2, 3, 4, 5], dtype='int64', name='my_index')

In [51]:

index = pd.Index(data)
print(index)
index.name = 'my_index'
print(index)

Index([1, 2, 3, 4, 5], dtype='int64')
Index([1, 2, 3, 4, 5], dtype='int64', name='my_index')

In [52]:
data = [1, 2, 3]
s = pd.Series(data, name="my_series")
s.index.name = 'инд'
print(s)

инд
0    1
1    2
2    3
Name: my_series, dtype: int64

In [53]:
books = ['Оно', 'Она', 'Они', 'Он']
prices = [120, 240, 34, 333]
ser = pd.Series(prices, books, dtype='uint16', name='Цены на книги')
ser.index.name = 'Название'
print(ser)

Название
Оно    120
Она    240
Они     34
Он     333
Name: Цены на книги, dtype: uint16

In [54]:
data = ['ананас', 'апельсин', 'баклажан', 'банан', 'клубника', 'бурак', 'картофель']
s = pd.Series(data, list(ascii_lowercase[:len(data)]), dtype='string', name='ягоды')
print(s)
s2 = pd.Series(s[(s.str.startswith('б'))], name='ягоды на букву б')
print(s2)

a       ананас
b     апельсин
c     баклажан
d        банан
e     клубника
f        бурак
g    картофель
Name: ягоды, dtype: string
c    баклажан
d       банан
f       бурак
Name: ягоды на букву б, dtype: string

In [55]:
a = ['булавки-25', 'нитки-12', 'иголки-34', 'пяльца-23']
b = {i.split('-')[0]: i.split('-')[1] for i in a}

ser = pd.Series(b, dtype='int64', name='продажи')
ser.index.name = 'товар'
print(ser)
ser2 = pd.Series(ser[ser%2==1], name='нечетные продажи')
print(ser2)

товар
булавки    25
нитки      12
иголки     34
пяльца     23
Name: продажи, dtype: int64
товар
булавки    25
пяльца     23
Name: нечетные продажи, dtype: int64

In [56]:
a = '2023-01-05:234 2023-02-23:345 2023-03-12:239'.split()
ser = pd.Series({k: int(v) for k, v in (b.split(':') for b in a)}, dtype='uint32', name='посещаемость')
ser.index.name = 'дата'
ser.index = ser.index.astype('datetime64[ns]')
print(ser)

дата
2023-01-05    234
2023-02-23    345
2023-03-12    239
Name: посещаемость, dtype: uint32

In [57]:
products = ['iPhone 13', 'Samsung Galaxy S21', 'Google Pixel 6', 'OnePlus 9 Pro', 'Xiaomi Mi 11', 'Oppo Find X3 Pro', 'Sony Xperia 1 III', 'LG Wing']
sales = [50000, 35000, 15000, 12000, 9000, 7500, 5000, 2000]

ser = pd.Series(sales, products, name='продажи за месяц')
ser.index.name = 'товар'
print(ser)
print(ser.idxmin())
print(*ser[ser == ser.min()].index.values)

товар
iPhone 13             50000
Samsung Galaxy S21    35000
Google Pixel 6        15000
OnePlus 9 Pro         12000
Xiaomi Mi 11           9000
Oppo Find X3 Pro       7500
Sony Xperia 1 III      5000
LG Wing                2000
Name: продажи за месяц, dtype: int64
LG Wing
LG Wing

# 3.1 Объект DataFrame и его создание

In [58]:
# Создание DataFrame из списка списков
data = [['John', 28, 'New York'],
        ['Kate', 23, 'Chicago'],
        ['Mike', 32, 'San Francisco']]
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])

# Создание DataFrame из словаря
data = {'Name': ['John', 'Kate', 'Mike'],
        'Age': [28, 23, 32],
        'City': ['New York', 'Chicago', 'San Francisco']}
df = pd.DataFrame(data)

# Создание DataFrame из списка словарей
data = [{'Name': 'John', 'Age': 28, 'City': 'New York'},
        {'Name': 'Kate', 'Age': 23, 'City': 'Chicago'},
        {'Name': 'Mike', 'Age': 32, 'City': 'San Francisco'}]
df = pd.DataFrame(data)

# Создание DataFrame из массива numpy
data = np.array([['John', 28, 'New York'],
                 ['Kate', 23, 'Chicago'],
                 ['Mike', 32, 'San Francisco']])
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df)

   Name Age           City
0  John  28       New York
1  Kate  23        Chicago
2  Mike  32  San Francisco

In [59]:
df.columns = ['Full Name', 'Age', 'Location']
print(df)

  Full Name Age       Location
0      John  28       New York
1      Kate  23        Chicago
2      Mike  32  San Francisco

In [60]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 32, 19, 47],
    'gender': ['female', 'male', 'male', 'male'],
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
import pandas as pd

df = pd.DataFrame(data)
print(df)

      name  age  gender         city
0    Alice   25  female     New York
1      Bob   32    male  Los Angeles
2  Charlie   19    male      Chicago
3    David   47    male      Houston

In [61]:
movies_data = [
    {'title': 'The Shawshank Redemption', 'year': 1994, 'imdb_rating': 9.3, 'genre': 'Drama'},
    {'title': 'The Godfather', 'year': 1972, 'imdb_rating': 9.2, 'genre': 'Crime, Drama'},
    {'title': 'The Godfather: Part II', 'year': 1974, 'imdb_rating': 9.0, 'genre': 'Crime, Drama'},
    {'title': 'The Dark Knight', 'year': 2008, 'imdb_rating': 9.0, 'genre': 'Action, Crime, Drama'},
    {'title': '12 Angry Men', 'year': 1957, 'imdb_rating': 8.9, 'genre': 'Drama'},    
    {'title': 'Pulp Fiction', 'year': 1994, 'imdb_rating': 8.9, 'genre': 'Crime, Drama'},
    {'title': 'The Good, the Bad and the Ugly', 'year': 1966, 'imdb_rating': 8.8, 'genre': 'Western'},
]
import pandas as pd

df = pd.DataFrame(movies_data)
print(df)
df = df.rename(columns={'title': 'Название', 'year': 'Год',  'imdb_rating': 'Рейтинг IMDB',  'genre': 'Жанр'})
print(df)

                            title  year  imdb_rating                 genre
0        The Shawshank Redemption  1994          9.3                 Drama
1                   The Godfather  1972          9.2          Crime, Drama
2          The Godfather: Part II  1974          9.0          Crime, Drama
3                 The Dark Knight  2008          9.0  Action, Crime, Drama
4                    12 Angry Men  1957          8.9                 Drama
5                    Pulp Fiction  1994          8.9          Crime, Drama
6  The Good, the Bad and the Ugly  1966          8.8               Western
                         Название   Год  Рейтинг IMDB                  Жанр
0        The Shawshank Redemption  1994           9.3                 Drama
1                   The Godfather  1972           9.2          Crime, Drama
2          The Godfather: Part II  1974           9.0          Crime, Drama
3                 The Dark Knight  2008           9.0  Action, Crime, Drama
4                    12 Angry Men  1957           8.9                 Drama
5                    Pulp Fiction  1994           8.9          Crime, Drama
6  The Good, the Bad and the Ugly  1966           8.8               Western

In [62]:
# n = int(input())
# data = [
#     ([i for i in input().split(', ')]) for j in range(n)
#]
# df = pd.DataFrame(data, columns=['Товар', 'Цена', 'Дата'])
# print(df)

# data = [([i for i in input().split(', ')]) for _ in range(int(input()))]
# df = pd.DataFrame(data, columns=['Дата', 'Валюта1/Валюта2', 'Курс'])
# print(df)

# 3.2 Основы работы со столбцами DataFrame

In [63]:
# data = [input().split() for _ in range(3)]
data = [['Alice', '25', 'female', '1000', '1200', 'North'],
 ['Bob', '30', 'male', '2000', '1800', 'South'],
 ['Charlie', '35', 'male', '1500', '1700', 'East']]
df = pd.DataFrame(data, columns=['name', 'age', 'sex', 'sales_2019', 'sales_2020', 'region'])
print(df)
print(df.dtypes)
df[['age', 'sales_2019', 'sales_2020']] = df[['age', 'sales_2019', 'sales_2020']].astype(int)
df['total_sales'] = df.sales_2019 + df.sales_2020
print(df)
print(df.dtypes)

      name age     sex sales_2019 sales_2020 region
0    Alice  25  female       1000       1200  North
1      Bob  30    male       2000       1800  South
2  Charlie  35    male       1500       1700   East
name          object
age           object
sex           object
sales_2019    object
sales_2020    object
region        object
dtype: object
      name  age     sex  sales_2019  sales_2020 region  total_sales
0    Alice   25  female        1000        1200  North         2200
1      Bob   30    male        2000        1800  South         3800
2  Charlie   35    male        1500        1700   East         3200
name           object
age             int32
sex            object
sales_2019      int32
sales_2020      int32
region         object
total_sales     int32
dtype: object

In [64]:
# Перемещение столбца
orders = pd.DataFrame({'order_id': [1, 2, 3, 4, 5],
        'order_date': ['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04', '2021-01-05'],
        'customer_name': ['John Doe', 'Jane Doe', 'Alex Smith', 'Sarah Jones', 'Bob Hope'],
        'product': ['Apple iPhone 12 Pro Max', 'Samsung Galaxy S21+', 'Sony Playstation 5 Console', 'Microsoft Xbox One', 'Apple Watch'],
        'price': [1100, 800, 500, 350, 400]})

column_to_move = orders.pop('customer_name')
orders.insert(0, 'customer_name', column_to_move)
orders

  customer_name  order_id  order_date                     product  price
0      John Doe         1  2021-01-01     Apple iPhone 12 Pro Max   1100
1      Jane Doe         2  2021-01-02         Samsung Galaxy S21+    800
2    Alex Smith         3  2021-01-03  Sony Playstation 5 Console    500
3   Sarah Jones         4  2021-01-04          Microsoft Xbox One    350
4      Bob Hope         5  2021-01-05                 Apple Watch    400

In [65]:
data = {'Name': ['John', 'Maggie', 'Mark', 'Jessica', 'Will'],
        'Age': [23, 34, 45, 28, 31],
        'Gender': ['M', 'F', 'M', 'F', 'M'],
        'Country': ['USA', 'Canada', 'UK', 'Germany', 'France'],
        'Salary_2021': [45000, 52000, 60000, 41000, 48000],
        'Salary_2022': [47000, 55000, 61000, 42000, 50000]}
df = pd.DataFrame(data)
df.head(3)

     Name  Age Gender Country  Salary_2021  Salary_2022
0    John   23      M     USA        45000        47000
1  Maggie   34      F  Canada        52000        55000
2    Mark   45      M      UK        60000        61000

In [66]:
del df['Country']
df['total_salary'] = df['Salary_2021'] + df['Salary_2022']
df.rename(columns={'Gender': 'Sex'}, inplace=True)
df

      Name  Age Sex  Salary_2021  Salary_2022  total_salary
0     John   23   M        45000        47000         92000
1   Maggie   34   F        52000        55000        107000
2     Mark   45   M        60000        61000        121000
3  Jessica   28   F        41000        42000         83000
4     Will   31   M        48000        50000         98000

In [67]:
df = pd.DataFrame(data)
print(df.head(3))
df = df.drop('Country', axis=1).rename(columns={'Gender': 'Sex'})
df['total_salary'] = df[['Salary_2021', 'Salary_2022']].sum(axis=1)
print(df)

     Name  Age Gender Country  Salary_2021  Salary_2022
0    John   23      M     USA        45000        47000
1  Maggie   34      F  Canada        52000        55000
2    Mark   45      M      UK        60000        61000
      Name  Age Sex  Salary_2021  Salary_2022  total_salary
0     John   23   M        45000        47000         92000
1   Maggie   34   F        52000        55000        107000
2     Mark   45   M        60000        61000        121000
3  Jessica   28   F        41000        42000         83000
4     Will   31   M        48000        50000         98000

# 3.3 Атрибуты index, values, name DataFrame, извлечение строк

In [68]:
data = { 'name': ['John', 'Jane', 'Bill'], 'age': [25, 30, 35],
 'country': ['USA', 'Canada', 'UK'] } 
df = pd.DataFrame(data, index=['a', 'b', 'c']) 
print(df)

   name  age country
a  John   25     USA
b  Jane   30  Canada
c  Bill   35      UK

In [69]:
print(df.loc['a'])

name       John
age          25
country     USA
Name: a, dtype: object

In [70]:
print(df.loc[['a', 'c']])

   name  age country
a  John   25     USA
c  Bill   35      UK

In [71]:
print(df.iloc[0])

name       John
age          25
country     USA
Name: a, dtype: object

In [72]:
print(df.iloc[[0, 2]])

   name  age country
a  John   25     USA
c  Bill   35      UK

In [73]:
df = df.set_index('name')

print(df)

      age country
name
John   25     USA
Jane   30  Canada
Bill   35      UK

In [74]:
print(df.values)

[[25 'USA']
 [30 'Canada']
 [35 'UK']]

In [75]:
del df['country']

print(df)

      age
name
John   25
Jane   30
Bill   35

In [76]:
data = {'Имя': ['Анна', 'Боб', 'Кейт'],
        'Возраст': [25, 30, 35],
        'Зарплата': [50000, 75000, 100000]}

df = pd.DataFrame(data)
print(df.iloc[df[df['Имя'] == 'Кейт'].index.values[0]])
print(df.iloc[[df[df['Имя'] == 'Анна'].index.values[0], df[df['Имя'] == 'Боб'].index.values[0]]])

Имя           Кейт
Возраст         35
Зарплата    100000
Name: 2, dtype: object
    Имя  Возраст  Зарплата
0  Анна       25     50000
1   Боб       30     75000

In [77]:
print(df[df['Имя'] == "Кейт"].iloc[0])
print(df[df['Имя'].isin(['Анна', 'Боб'])])

Имя           Кейт
Возраст         35
Зарплата    100000
Name: 2, dtype: object
    Имя  Возраст  Зарплата
0  Анна       25     50000
1   Боб       30     75000

In [78]:
sales_data = {
    'Product': ['Стул', 'Стол', 'Диван'],
    'Q1': [100, 75, 50],
    'Q2': [90, 65, 70,],
    'Q3': [110, 85, 60],
    'Q4': [95, 80, 75]
}
# Создаем DataFrame и назначаем индексы
df = pd.DataFrame(sales_data)
print(df.to_numpy())
print(df.values)

[['Стул' 100 90 110 95]
 ['Стол' 75 65 85 80]
 ['Диван' 50 70 60 75]]
[['Стул' 100 90 110 95]
 ['Стол' 75 65 85 80]
 ['Диван' 50 70 60 75]]

In [79]:
passengers_data = [['John Smith', 32, 'male', 'USA'],
    ['Sarah Johnson', 28, 'female', 'USA'],
    ['Anna Schmidt', 42, 'female', 'Germany'],
    ['Paul Kowalski', 50, 'male', 'Poland'],
    ['Luigi Rossi', 24, 'male', 'Italy'],
    ['Marie Dupont', 31, 'female', 'France'],
    ['Javier Fernandez', 27, 'male', 'Spain'],
    ['Elena Petrova', 35, 'female', 'Russia'],
    ['Lars Johansson', 47, 'male', 'Sweden']]

df = pd.DataFrame(passengers_data, columns=['Name', 'Age', 'Gender', 'Country'])
df.set_index('Name', inplace=True)
df

                  Age  Gender  Country
Name
John Smith         32    male      USA
Sarah Johnson      28  female      USA
Anna Schmidt       42  female  Germany
Paul Kowalski      50    male   Poland
Luigi Rossi        24    male    Italy
Marie Dupont       31  female   France
Javier Fernandez   27    male    Spain
Elena Petrova      35  female   Russia
Lars Johansson     47    male   Sweden

In [80]:
passengers_data = [['John Smith', 32, 'male', 'USA'],
    ['Sarah Johnson', 28, 'female', 'USA'],
    ['Anna Schmidt', 42, 'female', 'Germany'],
    ['Paul Kowalski', 50, 'male', 'Poland'],
    ['Luigi Rossi', 24, 'male', 'Italy'],
    ['Marie Dupont', 31, 'female', 'France'],
    ['Javier Fernandez', 27, 'male', 'Spain'],
    ['Elena Petrova', 35, 'female', 'Russia'],
    ['Lars Johansson', 47, 'male', 'Sweden']]

df = pd.DataFrame(passengers_data, columns=(None, 'Age', 'Gender', 'Country')).set_index(None)
df.index.name = 'Name'
df

                  Age  Gender  Country
Name
John Smith         32    male      USA
Sarah Johnson      28  female      USA
Anna Schmidt       42  female  Germany
Paul Kowalski      50    male   Poland
Luigi Rossi        24    male    Italy
Marie Dupont       31  female   France
Javier Fernandez   27    male    Spain
Elena Petrova      35  female   Russia
Lars Johansson     47    male   Sweden

In [81]:
# Объект Series
fr = pd.Series(['apple', 'banana', 'orange'], name='fruits')
# Список словарей для создания DataFrame
data = [{'name': 'Alice', 'age': 25},
    {'name': 'Bob', 'age': 30},
    {'name': 'Charlie', 'age': 35,},
    {'name': 'David', 'age': 40,}]

df = pd.DataFrame(data)
df = pd.concat([df, fr.to_frame()], axis=1)
print(df)

      name  age  fruits
0    Alice   25   apple
1      Bob   30  banana
2  Charlie   35  orange
3    David   40     NaN

In [82]:
sales_data = [('2023-04-25', 'Product A', 10, 500),    ('2023-04-26', 'Product B', 5, 200),    ('2023-04-27', 'Product C', 15, 1000)]

df = pd.DataFrame(sales_data, columns=[None, 'product_name', 'amount', 'sales_amount']).set_index(None)
df

           product_name  amount  sales_amount
2023-04-25    Product A      10           500
2023-04-26    Product B       5           200
2023-04-27    Product C      15          1000

In [83]:
passengers_data = [{'Name': 'John', 'Surname': 'Smith', 'Age': 35, 'Gender': 'Male', 'Nationality': 'American', 'Residence': 'USA', 'Passport Number': 'A1234567', 'Travel Purpose': 'Tourism'},    {'Name': 'Sarah', 'Surname': 'Johnson', 'Age': 27, 'Gender': 'Female', 'Nationality': 'British', 'Residence': 'UK', 'Passport Number': 'B2345678', 'Travel Purpose': 'Business'},    {'Name': 'Luigi', 'Surname': 'Rossi', 'Age': 42, 'Gender': 'Male', 'Nationality': 'Italian', 'Residence': 'Italy', 'Passport Number': 'C3456789', 'Travel Purpose': 'Tourism'},    {'Name': 'Anna', 'Surname': 'Petrova', 'Age': 30, 'Gender': 'Female', 'Nationality': 'Russian', 'Residence': 'Russia', 'Passport Number': 'D4567890', 'Travel Purpose': 'Work'},    {'Name': 'Lars', 'Surname': 'Johansson', 'Age': 55, 'Gender': 'Male', 'Nationality': 'Swedish', 'Residence': 'Sweden', 'Passport Number': 'E5678901', 'Travel Purpose': 'Tourism'}]
detained_passengers = ['Sarah Johnson', 'Luigi Rossi']
df = pd.DataFrame(passengers_data)
df.index = df['Name'] + ' ' + df['Surname']
df.drop(['Name', 'Surname', 'Travel Purpose'], axis=1, inplace=True)
df

                Age  Gender Nationality Residence Passport Number
John Smith       35    Male    American       USA        A1234567
Sarah Johnson    27  Female     British        UK        B2345678
Luigi Rossi      42    Male     Italian     Italy        C3456789
Anna Petrova     30  Female     Russian    Russia        D4567890
Lars Johansson   55    Male     Swedish    Sweden        E5678901

In [84]:
df.loc[detained_passengers]

               Age  Gender Nationality Residence Passport Number
Sarah Johnson   27  Female     British        UK        B2345678
Luigi Rossi     42    Male     Italian     Italy        C3456789

# 3.4.1 Индексные объекты Pandas

In [85]:
# создаем DataFrame с RangeIndex
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, index=range(3))

print(df.index)

RangeIndex(start=0, stop=3, step=1)

In [86]:
# Создание индекса
idx = pd.Index(['a', 'b', 'c', 'd'])

# Использование атрибутов shape, size и values
print("shape:", idx.shape)
print("size:", idx.size)
print("values:", idx.values)

shape: (4,)
size: 4
values: ['a' 'b' 'c' 'd']

In [87]:
# Создание индекса
idx1 = pd.Index(['a', 'b', 'c', 'd', 'a'])
idx2 = pd.Index(['a', 'b', 'c', 'd'])

# Проверка флагов
print("is_unique:", idx1.is_unique)
print("is_monotonic_increasing:", idx2.is_monotonic_increasing)
print("is_monotonic_decreasing:", idx2.is_monotonic_decreasing)

is_unique: False
is_monotonic_increasing: True
is_monotonic_decreasing: False

In [88]:
idx = pd.Index([1, 2, 3, 4, 5])
print(idx.isin([2, 4, 6]))

[False  True False  True False]

In [89]:
data = {'order_date': ['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04', '2021-05-05'],
        'total_amount': [120.00, 90.50, 45.00, 150.25, 70.00],
        'num_items': [3, 2, 1, 4, 2]}
df = pd.DataFrame(data)
df.index = pd.Series([100, 101, 102, 103, 104], name='ID')
df

     order_date  total_amount  num_items
ID
100  2021-05-01        120.00          3
101  2021-05-02         90.50          2
102  2021-05-03         45.00          1
103  2021-05-04        150.25          4
104  2021-05-05         70.00          2

In [90]:
df = pd.read_csv('data/indexes.csv', index_col=0)
df

       temperature  humidity
№ п/п
0               22        50
1               23        55
2               24        60
3               21        65
4               20        70
5               20        72
6               19        75

In [91]:
print(f'Имя индекса: {df.index.name}')
print(f'Тип данных индекса: {df.index.dtype}')
print(f'Количество элементов: {df.index.size}')
print(f'Форма объекта Index: {df.index.shape}')
print(f'Значения индексов: {df.index.values}')

Имя индекса: № п/п
Тип данных индекса: int64
Количество элементов: 7
Форма объекта Index: (7,)
Значения индексов: [0 1 2 3 4 5 6]

In [92]:
def return_filtered_df(df, lst):
    return(df[df.index.isin(lst)])

data = {'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'], 'age': [25, 32, 18, 47, 22]}
df = pd.DataFrame(data)
lst = [2, 5, 8]
print(return_filtered_df(df, lst))

      name  age
2  Charlie   18

In [93]:
df[pd.Series(df.index.values).isin(lst)]

      name  age
2  Charlie   18

# 3.4.2 Метод reindex()

In [94]:
# Создаем DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}, index=['a', 'b', 'c'])
print(df)

# Переиндексация строк
new_index = ['b', 'a', 'd']
df_reindexed = df.reindex(new_index)
print(df_reindexed)
# Переиндексация столбцов
new_columns = ['B', 'A', 'C']
df_reindexed_columns = df.reindex(columns=new_columns)
print(df_reindexed_columns)

   A  B
a  1  4
b  2  5
c  3  6
     A    B
b  2.0  5.0
a  1.0  4.0
d  NaN  NaN
   B  A   C
a  4  1 NaN
b  5  2 NaN
c  6  3 NaN

In [95]:
print(df)
# Переиндексация строк
new_labels = ['a', 'b', 'd']
df_reindexed = df.reindex(labels=new_labels)
print(df_reindexed)
# Переиндексация столбцов
new_labels = ['A', 'B', 'C']
df_reindexed_columns = df.reindex(labels=new_labels, axis=1)
print(df_reindexed_columns)

   A  B
a  1  4
b  2  5
c  3  6
     A    B
a  1.0  4.0
b  2.0  5.0
d  NaN  NaN
   A  B   C
a  1  4 NaN
b  2  5 NaN
c  3  6 NaN

In [96]:
data = {'A': [1, 2, None, 4], 'B': ['a', None, 'c', 'd']}
df = pd.DataFrame(data)
print(df)

# Переиндексация с заполнением отсутствующих значений методом 'pad' или 'ffill'
new_index = [0, 1, 2, 4, 5]
new_df = df.reindex(new_index, method='ffill')
print(new_df)

     A     B
0  1.0     a
1  2.0  None
2  NaN     c
3  4.0     d
     A     B
0  1.0     a
1  2.0  None
2  NaN     c
4  4.0     d
5  4.0     d

In [97]:
# Переиндексация с заполнением отсутствующих значений методом 'bfill'
new_index = [0, 1, 2, 8]
new_df = df.reindex(new_index, method='bfill')
print(new_df)

     A     B
0  1.0     a
1  2.0  None
2  NaN     c
8  NaN   NaN

In [98]:
# Переиндексация с заполнением отсутствующих значений методом 'nearest'
new_index = [0, 1, 3, 4]
new_df = df.reindex(new_index, method='nearest')
print(new_df)

     A     B
0  1.0     a
1  2.0  None
3  4.0     d
4  4.0     d

In [99]:
new_index = [0, 1, 9, 4]
# Переиндексация строк с заполнением отсутствующих значений конкретным значением
df_reindexed_fill_value = df.reindex(new_index, fill_value=0)
print(df_reindexed_fill_value)

     A     B
0  1.0     a
1  2.0  None
9  0.0     0
4  0.0     0

In [100]:
df = pd.DataFrame({'A': [1, 2, 3, np.nan, np.nan, 6, np.nan, 8], 
                   'B': [4, np.nan, 6, np.nan, 10, np.nan, 12, np.nan]})
df

     A     B
0  1.0   4.0
1  2.0   NaN
2  3.0   6.0
3  NaN   NaN
4  NaN  10.0
5  6.0   NaN
6  NaN  12.0
7  8.0   NaN

In [101]:
# Заполнение только двух последовательных пропущенных значения
df_reindexed = df.reindex(range(11), method='ffill', limit=2)
df_reindexed

      A     B
0   1.0   4.0
1   2.0   NaN
2   3.0   6.0
3   NaN   NaN
4   NaN  10.0
5   6.0   NaN
6   NaN  12.0
7   8.0   NaN
8   8.0   NaN
9   8.0   NaN
10  NaN   NaN

In [102]:
# Создание исходного объекта данных
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data, index=[1.0, 2.4, 3.1])
df

     A  B
1.0  1  4
2.4  2  5
3.1  3  6

In [103]:
# Переиндексация с различными значениями tolerance (работает для индексов типа float, задает отклонения значения индекса, который определяет совпадения присваемого индкса с текущим индексом)
new_index = [1.0, 2.0, 3.0]
df_reindexed = df.reindex(new_index, tolerance=0.3, method='nearest')
print(df_reindexed)

       A    B
1.0  1.0  4.0
2.0  NaN  NaN
3.0  3.0  6.0

In [104]:
orders.index = (range(1, len(orders)+1))
orders

  customer_name  order_id  order_date                     product  price
1      John Doe         1  2021-01-01     Apple iPhone 12 Pro Max   1100
2      Jane Doe         2  2021-01-02         Samsung Galaxy S21+    800
3    Alex Smith         3  2021-01-03  Sony Playstation 5 Console    500
4   Sarah Jones         4  2021-01-04          Microsoft Xbox One    350
5      Bob Hope         5  2021-01-05                 Apple Watch    400

In [105]:
# Создаем диапазон дат с частотой ежедневных дат в течение 5 дней
date_range = pd.date_range(start='2024-01-01', periods=10, freq='2D')
# Выводим результат
date_range

DatetimeIndex(['2024-01-01', '2024-01-03', '2024-01-05', '2024-01-07',
               '2024-01-09', '2024-01-11', '2024-01-13', '2024-01-15',
               '2024-01-17', '2024-01-19'],
              dtype='datetime64[ns]', freq='2D')

In [106]:
sales = pd.DataFrame({'product': ['product1', 'product2', 'product3', 'product4'],
                      'price': [100, 200, 150, 300]},
                     index=pd.to_datetime(['2022-01-01', '2022-01-03', '2022-01-06', '2022-01-08']))
sales

             product  price
2022-01-01  product1    100
2022-01-03  product2    200
2022-01-06  product3    150
2022-01-08  product4    300

In [107]:
date_range = pd.date_range(start=sales.index[0], end=sales.index[-1])
sales_new = sales.reindex(date_range)
sales_new

             product  price
2022-01-01  product1  100.0
2022-01-02       NaN    NaN
2022-01-03  product2  200.0
2022-01-04       NaN    NaN
2022-01-05       NaN    NaN
2022-01-06  product3  150.0
2022-01-07       NaN    NaN
2022-01-08  product4  300.0

In [108]:
df = pd.DataFrame({
        'sales': [10, 20, 24, 30, 10, 40],
        'date': ['2022-01-01', '2022-01-03', '2022-01-06', '2022-01-08', '2022-01-10', '2022-01-12']
    })
# Преобразуем столбец дат в формат datetime и устанавливаем его в качестве индекса
df['date'] = pd.to_datetime(df['date'])
df = df.set_index('date')

In [109]:
date_range = pd.date_range(start=df.index.min(), end=df.index.max())
df_new = df.reindex(date_range, method='ffill')
df_new

            sales
2022-01-01     10
2022-01-02     10
2022-01-03     20
2022-01-04     20
2022-01-05     20
2022-01-06     24
2022-01-07     24
2022-01-08     30
2022-01-09     30
2022-01-10     10
2022-01-11     10
2022-01-12     40

In [110]:
np.random.seed(4)
df = pd.DataFrame({'sales': np.random.randint(10, 100, 5)}, 
                  index=[1.2, 2.5, 3.1, 4.7, 5.3])
df

     sales
1.2     56
2.5     65
3.1     79
4.7     11
5.3     97

In [111]:
# Переиндексация от 1 до 5 с шагом 0.5
df = df.reindex(np.arange(1, 5.5, 0.5), method='nearest', tolerance=0.3)
df

     sales
1.0   56.0
1.5    NaN
2.0    NaN
2.5   65.0
3.0   79.0
3.5    NaN
4.0    NaN
4.5   11.0
5.0   97.0

In [112]:
# Создаем первый датафрейм с информацией о продажах товаров в разные месяцы
df1 = pd.DataFrame({'sales': [100, 200, 150, 300, 250],
                    'month': ['January', 'February', 'March', 'April', 'May']})
df1 = df1.set_index('month')  # Устанавливаем индекс как месяцы

# Создаем второй датафрейм с информацией о продажах товаров в разные месяцы
df2 = pd.DataFrame({'sales': [150, 250, 100, 200, 300],
                    'month': ['February', 'March', 'April', 'May', 'June']})
df2 = df2.set_index('month')  # Устанавливаем индекс как месяцы
df1

          sales
month
January     100
February    200
March       150
April       300
May         250

In [113]:
df1.index

Index(['January', 'February', 'March', 'April', 'May'], dtype='object', name='month')

In [114]:
df2

          sales
month
February    150
March       250
April       100
May         200
June        300

In [115]:
# new_index = pd.unique(np.concatenate((df1.index, df2.index)))
new_index = df1.index.union(df2.index, sort=False)

In [116]:
df1.reindex(new_index, fill_value=0)

          sales
month
January     100
February    200
March       150
April       300
May         250
June          0

In [117]:
df2.reindex(new_index, fill_value=0)

          sales
month
January       0
February    150
March       250
April       100
May         200
June        300

In [118]:
df = pd.DataFrame({
    'product': ['A', 'B', 'C'],
    'Monday': [10, 20, 30],
    'Wednesday': [40, 50, 60],
    'Friday': [70, 80, 90],
    'Tuesday': [100, 110, 120],
    'Thursday': [130, 140, 150],
    'Saturday': [160, 170, 180],
    'Sunday': [190, 200, 210]
})
df

  product  Monday  Wednesday  Friday  Tuesday  Thursday  Saturday  Sunday
0       A      10         40      70      100       130       160     190
1       B      20         50      80      110       140       170     200
2       C      30         60      90      120       150       180     210

In [119]:
from calendar import day_name
new_col = list(day_name)
df.reindex(new_col, axis=1)

   Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
0      10      100         40       130      70       160     190
1      20      110         50       140      80       170     200
2      30      120         60       150      90       180     210

# 3.5 Использование срезов с объектами Series и DataFrame в Pandas

In [120]:
my_list = [10, 20, 30, 40, 50]
my_series = pd.Series(my_list, index=['a', 'b', 'c', 'd', 'e'])
my_slice = my_series.loc['b':'d']
print(my_slice)

b    20
c    30
d    40
dtype: int64

In [121]:
my_dict = {'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
           'age': [25, 30, 35, 40, 45],
           'city': ['New York', 'Paris', 'London', 'Tokyo', 'Sydney']}
my_dataframe = pd.DataFrame(my_dict)
my_dataframe

      name  age      city
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London
3    David   40     Tokyo
4    Emily   45    Sydney

In [122]:
my_slice1 = my_dataframe.loc[1:3, 'name':'age']
my_slice2 = my_dataframe.iloc[1:3, 1:3]

print(my_slice1)
print()
print(my_slice2)

      name  age
1      Bob   30
2  Charlie   35
3    David   40

   age    city
1   30   Paris
2   35  London

In [123]:
filtered_df = my_dataframe[my_dataframe['age'] > 30]
filtered_df

      name  age    city
2  Charlie   35  London
3    David   40   Tokyo
4    Emily   45  Sydney

In [124]:
employees = pd.DataFrame({
    'name': ['John', 'Emily', 'Michael', 'Jessica', 'Andrew'],
    'age': [35, 28, 42, 30, 25],
    'salary': [60000, 50000, 70000, 55000, 45000]
})

employees

      name  age  salary
0     John   35   60000
1    Emily   28   50000
2  Michael   42   70000
3  Jessica   30   55000
4   Andrew   25   45000

In [125]:
selected_employees = employees[(employees['name'].str.startswith('J')) & (employees['age'] < 40)]
selected_employees

      name  age  salary
0     John   35   60000
3  Jessica   30   55000

In [126]:
selected_employees = employees[(employees['name'].str.startswith('Je')) & (employees['age'] < 40)]
selected_employees

      name  age  salary
3  Jessica   30   55000

In [127]:
selected_employees = employees[(employees['name'].str.startswith('A')) | (employees['name'].str.startswith('M'))]
selected_employees

      name  age  salary
2  Michael   42   70000
4   Andrew   25   45000

In [128]:
selected_employees = employees[~(employees['age'] < 30)]
selected_employees

      name  age  salary
0     John   35   60000
2  Michael   42   70000
3  Jessica   30   55000

In [129]:
print(employees.loc[3, 'name'])
employees.loc[3, 'name'] = 'Alice'
print(employees.loc[3, 'name'])

Jessica
Alice

In [130]:
employees['country'] = ['USA', 'France', 'UK', 'Japan', 'Australia']
employees

      name  age  salary    country
0     John   35   60000        USA
1    Emily   28   50000     France
2  Michael   42   70000         UK
3    Alice   30   55000      Japan
4   Andrew   25   45000  Australia

In [131]:
sales = pd.DataFrame({
    'region': ['North', 'South', 'East', 'West', 'Central'],
    'product': ['A', 'B', 'A', 'C', 'B'],
    'sales_amount': [10000, 20000, 15000, 12000, 18000]
})
sales

    region product  sales_amount
0    North       A         10000
1    South       B         20000
2     East       A         15000
3     West       C         12000
4  Central       B         18000

In [132]:
selected_data = sales.loc[sales['product'] == 'A', ['region', 'sales_amount']]
selected_data
selected_data

  region  sales_amount
0  North         10000
2   East         15000

In [133]:
# Изменение значения
sales.loc[(sales['region'] == 'North') & (sales['product'] == 'A'), 'sales_amount'] = 12000
sales

    region product  sales_amount
0    North       A         12000
1    South       B         20000
2     East       A         15000
3     West       C         12000
4  Central       B         18000

In [134]:
import random

random.seed(54)
# Создаем DataFrame с данными о людях
data = {'age': [random.randint(20, 60) for _ in range(100)],
        'gender': [random.choice(['male', 'female']) for _ in range(100)],
        'income': [random.randint(10000, 100000) for _ in range(100)]}
df = pd.DataFrame(data)
n, m = 2, 10
df.loc[n:m+1:2]

    age  gender  income
2    55  female   86793
4    50    male   23756
6    44  female   14311
8    48  female   65505
10   56  female   29070

In [135]:
df.loc[n:m, ['income', 'gender']]

    income  gender
2    86793  female
3    45296  female
4    23756    male
5    61482    male
6    14311  female
7    72942  female
8    65505  female
9    50649    male
10   29070  female

In [136]:
import string
random.seed(7)
# Генерируем случайные данные для DataFrame
data = {'column1': [random.randint(0, 100) for _ in range(26)],
        'column2': [random.uniform(0, 1) for _ in range(26)]}
# Создаем DataFrame и присваиваем метки, упорядоченные по алфавиту
df = pd.DataFrame(data, index=list(string.ascii_lowercase))
# df.loc[slice(*input().split())]

In [137]:
random.seed(54)
# Создаем DataFrame с данными о людях
data = {'age': [random.randint(20, 60) for _ in range(10)],
        'gender': [random.choice(['male', 'female']) for _ in range(10)],
        'income': [random.randint(10000, 100000) for _ in range(10)]}
df = pd.DataFrame(data)
df

   age  gender  income
0   28  female   45802
1   48    male   81297
2   55    male   28666
3   39    male   22682
4   50  female   94613
5   51  female   44229
6   44    male   46443
7   34  female   67378
8   48  female   86894
9   41  female   14858

In [138]:
# Присваивание при условии
df.loc[df.age < 38, 'income'] = 0
df

   age  gender  income
0   28  female       0
1   48    male   81297
2   55    male   28666
3   39    male   22682
4   50  female   94613
5   51  female   44229
6   44    male   46443
7   34  female       0
8   48  female   86894
9   41  female   14858

In [139]:
import pandas as pd
import numpy as np
import datetime as dt

np.random.seed(32)
start_date = dt.date(2022, 1, 1)
end_date = dt.date(2022, 12, 31)
date_range = pd.date_range(start_date, end_date)
data = {'date': np.random.choice(date_range, 50),
        'quantity': np.random.randint(1, 10, 50),
        'sales': np.random.randint(100, 1000, 50)}
df = pd.DataFrame(data)
df.head()

        date  quantity  sales
0 2022-08-04         3    938
1 2022-02-13         2    169
2 2022-11-07         5    419
3 2022-03-30         1    834
4 2022-09-10         5    709

In [140]:
# dates = pd.date_range(*input().split())
a, b = '2022-03-01', '2022-03-23'
dates = pd.date_range(a, b)
df[df['date'].isin(dates) == True]

         date  quantity  sales
5  2022-03-13         3    106
13 2022-03-07         7    577
24 2022-03-19         3    107
26 2022-03-04         2    653
33 2022-03-06         1    709
37 2022-03-04         1    497
42 2022-03-16         9    275
43 2022-03-03         3    344

In [141]:
df.loc[df['date'].between(a, b)]

         date  quantity  sales
5  2022-03-13         3    106
13 2022-03-07         7    577
24 2022-03-19         3    107
26 2022-03-04         2    653
33 2022-03-06         1    709
37 2022-03-04         1    497
42 2022-03-16         9    275
43 2022-03-03         3    344

In [142]:
import pandas as pd
import numpy as np
import datetime as dt

np.random.seed(32)
start_date = dt.date(2022, 1, 1)
end_date = dt.date(2022, 12, 31)
date_range = pd.date_range(start_date, end_date)
data = {'date': np.random.choice(date_range, 50),
        'quantity': np.random.randint(1, 10, 50),
        'sales': np.random.randint(100, 1000, 50)}
df = pd.DataFrame(data)

In [143]:
sales_mean = df['sales'].mean()
# df.loc[df.sales < sales_mean, 'sales'] = 0
# df.loc[df.sales > sales_mean, 'sales'] = sales_mean
df.sales = np.where(df.sales < sales_mean, 0, sales_mean)
df.sales = df.sales.apply(lambda x: 0 if x < sales_mean else sales_mean)
df.head(5)

        date  quantity   sales
0 2022-08-04         3  527.24
1 2022-02-13         2    0.00
2 2022-11-07         5    0.00
3 2022-03-30         1  527.24
4 2022-09-10         5  527.24

# 4.1.1 Особенности арифметических операций в Pandas

In [144]:
# add() - сложение
# sub() - вычитание
# mul() - умножение
# div() - деление
# floordiv() - целочисленное деление
# pow() - возведение в степень

In [145]:
# Сложение Series
s1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
s2 = pd.Series([4, 5, 6], index=['a', 'c', 'd'])
s3 = s1 + s2
print(s3)

a    5.0
b    NaN
c    8.0
d    NaN
dtype: float64

In [146]:
# Сложение DataFrame
df1 = pd.DataFrame(np.random.randn(3, 2), columns=['a', 'b'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'c', 'd'])
df3 = df1 + df2
df3

    a         b   c   d
0 NaN -1.442394 NaN NaN
1 NaN -2.569641 NaN NaN
2 NaN       NaN NaN NaN

In [147]:
s = pd.Series([1, 2, 3])
df = pd.DataFrame(np.random.randint(4, size=(3, 2)), columns=['a', 'b'])
s1 = s + 1
df1 = df * 2

print(s1)
print(df1)

0    2
1    3
2    4
dtype: int64
   a  b
0  2  2
1  0  4
2  2  4

In [148]:
# Создаем два объекта типа Series с несовпадающими индексами
s1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
s2 = pd.Series([4, 5, 6], index=['b', 'c', 'd'])

# Выполняем операцию сложения с помощью метода add()
# Отсутствующие значения (NaN) в одном из объектов Series заменены на 0
s3 = s1.add(s2, fill_value=0)
s3

a    1.0
b    6.0
c    8.0
d    6.0
dtype: float64

In [149]:
# Выполняем операцию вычитания с помощью метода sub()
# Отсутствующие значения (NaN) в одном из объектов Series заменены на 0
s3 = s1.sub(s2, fill_value=0)
s3

a    1.0
b   -2.0
c   -2.0
d   -6.0
dtype: float64

In [150]:
import pandas as pd

# создаем первый DataFrame с выручкой от продаж в первом магазине
sales1 = pd.DataFrame({'Дата': ['2022-01-01', '2022-01-02', '2022-01-03'],
                       'Выручка': [1000, 2000, 1500]})
sales1.set_index('Дата', inplace=True)

# создаем второй DataFrame с выручкой от продаж во втором магазине
sales2 = pd.DataFrame({'Дата': ['2022-01-01', '2022-01-02', '2022-01-03'],
                       'Выручка': [1500, 2500, 1800]})
sales2.set_index('Дата', inplace=True)

In [151]:
# создаем первый DataFrame с доходами
income = pd.DataFrame({'Дата': ['2022-01-01', '2022-02-01', '2022-03-01'],
                       'Доходы': [np.nan, 12000, 20000]})
income.set_index('Дата', inplace=True)

# создаем второй DataFrame с расходами
expenses = pd.DataFrame({'Дата': ['2022-01-01', '2022-02-01', '2022-03-01'],
                       'Расходы': [5000, np.nan, 8000]})
expenses.set_index('Дата', inplace=True)
# баланс на конец дня
df = pd.DataFrame(income['Доходы'].sub(expenses['Расходы'], fill_value=0), columns=['Итоговый баланс'])
df

            Итоговый баланс
Дата
2022-01-01          -5000.0
2022-02-01          12000.0
2022-03-01          12000.0

# 4.1.2 Арифметические операции между Series и DataFrame

In [152]:
# add() - сложение
# sub() - вычитание
# mul() - умножение
# div() - деление
# floordiv() - целочисленное деление
# pow() - возведение в степень

In [153]:
df = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [10, 20, 30, 40], 'C': [100, 200, 300, 400]})
print(df)
s = pd.Series([0.1, 0.2, 0.3], index=['A', 'B', 'C'])
print(s)

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
A    0.1
B    0.2
C    0.3
dtype: float64

In [154]:
# Сложение значений в столбцах DataFrame со значениями в строках Series
# Индексы совпадают
df + s

     A     B      C
0  1.1  10.2  100.3
1  2.1  20.2  200.3
2  3.1  30.2  300.3
3  4.1  40.2  400.3

In [155]:
df2 = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [10, 20, 30, 40], 'C': [100, 200, 300, 400]}, index=['a', 'b', 'c', 'd'])
print(df2)
s3 = pd.Series([0.1, 0.2, 0.3, 0.4], index=['B', 'C', 'D', 'E'])
print(s3)

   A   B    C
a  1  10  100
b  2  20  200
c  3  30  300
d  4  40  400
B    0.1
C    0.2
D    0.3
E    0.4
dtype: float64

In [156]:
# Индексы не совпадают
df2 + s3

    A     B      C   D   E
a NaN  10.1  100.2 NaN NaN
b NaN  20.1  200.2 NaN NaN
c NaN  30.1  300.2 NaN NaN
d NaN  40.1  400.2 NaN NaN

In [157]:
df2.add(s3).fillna(0)

     A     B      C    D    E
a  0.0  10.1  100.2  0.0  0.0
b  0.0  20.1  200.2  0.0  0.0
c  0.0  30.1  300.2  0.0  0.0
d  0.0  40.1  400.2  0.0  0.0

In [158]:
df = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [10, 20, 30, 40], 'C': [100, 200, 300, 400]})
print(df)
s = pd.Series([0.1, 0.2, 0.3])
print(s)

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
0    0.1
1    0.2
2    0.3
dtype: float64

In [159]:
# Сложение по строкам
df.add(s, axis=0)

     A     B      C
0  1.1  10.1  100.1
1  2.2  20.2  200.2
2  3.3  30.3  300.3
3  NaN   NaN    NaN

In [160]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [10, 20, 30], 'C': [100, 200, 300]})
df['D'] = df['A'] + df['B']
df

   A   B    C   D
0  1  10  100  11
1  2  20  200  22
2  3  30  300  33

In [161]:
# Создаем DataFrame с информацией о продажах
sales = pd.DataFrame({
    'product': ['product_1', 'product_2', 'product_3', 'product_4'],
    'month_1': [100, 200, 300, 400],
    'month_2': [200, 250, 150, 300],
    'month_3': [150, 300, 100, 200],
})

sales

     product  month_1  month_2  month_3
0  product_1      100      200      150
1  product_2      200      250      300
2  product_3      300      150      100
3  product_4      400      300      200

In [162]:
sales['total_conversions'] = sales['month_1'] + sales['month_2'] + sales['month_3']
sales['total_conversions']

0    450
1    750
2    550
3    900
Name: total_conversions, dtype: int64

In [163]:
# Создаем Series с информацией о конверсионном коэффициенте
conversion_rate = pd.Series([0.1, 0.2, 0.3, 0.1], index=['product_1', 'product_2', 'product_3', 'product_4'])
conversion_rate.index = range(len(sales))
conversion_rate

0    0.1
1    0.2
2    0.3
3    0.1
dtype: float64

In [164]:
sales['total_conversions'] = sales['total_conversions'].mul(conversion_rate, axis=0)
sales

     product  month_1  month_2  month_3  total_conversions
0  product_1      100      200      150               45.0
1  product_2      200      250      300              150.0
2  product_3      300      150      100              165.0
3  product_4      400      300      200               90.0

In [165]:
# создаем DataFrame с информацией о количестве товаров на складе
inventory = pd.DataFrame({
    'product_id': ['P1', 'P2', 'P3'],
    'quantity': [10, 20, 30]
})

# создаем Series с информацией о спросе на каждый из товаров
demand = pd.Series([5, 25, 20], index=['P1', 'P2', 'P3'])
inventory.set_index('product_id', inplace=True)

inventory.sub(demand, axis=0).reset_index()

  product_id  quantity
0         P1         5
1         P2        -5
2         P3        10

In [166]:
# Создаем исходный DataFrame с информацией о расходах на различные категории
expenses = pd.DataFrame({
    'category': ['food', 'clothes', 'transportation', 'entertainment'],
    'amount': [500, 200, 100, 50]
})
# Создаем Series с информацией о доступном бюджете
budget = pd.Series(1000, name='budget')
expenses

         category  amount
0            food     500
1         clothes     200
2  transportation     100
3   entertainment      50

In [167]:
df = expenses.copy()
df['percentage'] = df['amount'].apply(lambda x: x / budget * 100)
df.drop('amount', axis=1)

         category  percentage
0            food        50.0
1         clothes        20.0
2  transportation        10.0
3   entertainment         5.0

In [168]:
df = pd.DataFrame({'category': expenses['category'], 'percentage': expenses['amount'] / budget.values * 100 })
df

         category  percentage
0            food        50.0
1         clothes        20.0
2  transportation        10.0
3   entertainment         5.0

In [169]:
import pandas as pd
import numpy as np
# Создаем датафреймы с ценами на товары в двух магазинах
df1 = pd.DataFrame({
    'Товар': ['Шоколад', 'Молоко', 'Хлеб', 'Масло'],
    'Цена': [100, 50, 30, 150]
})
df2 = pd.DataFrame({
    'Товар': ['Шоколад', 'Молоко', 'Хлеб', 'Масло'],
    'Цена': [120, 60, 35, 140]
})

df = df1.set_index('Товар').sub(df2.set_index('Товар'), axis=0).reset_index().rename(columns={'Цена': 'Разница'})
df

     Товар  Разница
0  Шоколад      -20
1   Молоко      -10
2     Хлеб       -5
3    Масло       10

In [170]:
df = pd.DataFrame({'Товар': df1['Товар'], 'Разница': df1['Цена'] -  df2['Цена']})
df

     Товар  Разница
0  Шоколад      -20
1   Молоко      -10
2     Хлеб       -5
3    Масло       10

# 4.2 Применение функций к объектам Pandas, метод apply

Применение функции к столбцу DataFrame:

In [171]:
df = pd.DataFrame({'магазин': ['Магазин 1', 'Магазин 2', 'Магазин 3'],
                   'продукт': ['Молоко', 'Хлеб', 'Масло'],
                   'цена': [100, 50, 80],
                  'количество': [10, 20, 15]})
df

     магазин продукт  цена  количество
0  Магазин 1  Молоко   100          10
1  Магазин 2    Хлеб    50          20
2  Магазин 3   Масло    80          15

In [172]:
def add_tax(price):
    return price * 1.1

df['цена с налогом 1'] = df['цена'].apply(add_tax)
df

     магазин продукт  цена  количество  цена с налогом 1
0  Магазин 1  Молоко   100          10             110.0
1  Магазин 2    Хлеб    50          20              55.0
2  Магазин 3   Масло    80          15              88.0

In [173]:
df['цена с налогом 2'] = df['цена'].apply(lambda x: x * 1.2)
df

     магазин продукт  цена  количество  цена с налогом 1  цена с налогом 2
0  Магазин 1  Молоко   100          10             110.0             120.0
1  Магазин 2    Хлеб    50          20              55.0              60.0
2  Магазин 3   Масло    80          15              88.0              96.0

In [174]:
df['цена с налогом 3'] = add_tax(df['цена'])
df

,магазин,продукт,цена,количество,цена с налогом 1,цена с налогом 2,цена с налогом 3
0,Магазин 1,Молоко,100,10,110.0,120.0,110.0
1,Магазин 2,Хлеб,50,20,55.0,60.0,55.0
2,Магазин 3,Масло,80,15,88.0,96.0,88.0

Применение функции к строке DataFrame:

In [175]:
df = pd.DataFrame({'магазин': ['Магазин 1', 'Магазин 2', 'Магазин 3'],
                   'продукт': ['Молоко', 'Хлеб', 'Масло'],
                   'цена': [100, 50, 80],
                  'количество': [10, 20, 15]})
df

     магазин продукт  цена  количество
0  Магазин 1  Молоко   100          10
1  Магазин 2    Хлеб    50          20
2  Магазин 3   Масло    80          15

In [176]:
def total_sales(row):
    return row['цена'] * row['количество']

df['общая выручка'] = df.apply(total_sales, axis=1)
df

     магазин продукт  цена  количество  общая выручка
0  Магазин 1  Молоко   100          10           1000
1  Магазин 2    Хлеб    50          20           1000
2  Магазин 3   Масло    80          15           1200

In [177]:
df['общая выручка'] = total_sales(df)

Применение функций NumPy к элементам DataFrame:

In [178]:
data = {'a': [1, 2, 3, 4, 5], 'b': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
df

   a   b
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [179]:
df['a^2'] = df['a'].apply(np.square)
df

   a   b  a^2
0  1  10    1
1  2  20    4
2  3  30    9
3  4  40   16
4  5  50   25

In [180]:
df['a^2'] = np.square(df['a'])
df

   a   b  a^2
0  1  10    1
1  2  20    4
2  3  30    9
3  4  40   16
4  5  50   25

In [181]:
df['sum'] = df.iloc[:,2:].apply(np.sum, axis=1)
df

   a   b  a^2  sum
0  1  10    1    1
1  2  20    4    4
2  3  30    9    9
3  4  40   16   16
4  5  50   25   25

In [182]:
data = {'a': [1, 2, 3, 4, 5], 'b': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
df

   a   b
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [183]:
df['sum'] = np.sum(df, axis=1)
df

   a   b  sum
0  1  10   11
1  2  20   22
2  3  30   33
3  4  40   44
4  5  50   55

In [184]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df = df.apply(lambda x: str(x) + '_string')
df

A    0    1\n1    2\n2    3\nName: A, dtype: int64_...
B    0    4\n1    5\n2    6\nName: B, dtype: int64_...
dtype: object

In [185]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df)
df = df.loc[:, ['B', 'A']]
print(df)

   A  B
0  1  4
1  2  5
2  3  6
   B  A
0  4  1
1  5  2
2  6  3

In [186]:
arr = np.array(range(1, 15)).reshape(7, 2)
df = pd.DataFrame(arr, 
                  columns=['a', 'b'],
                  index=list(ascii_uppercase[:len(arr)]))

df

    a   b
A   1   2
B   3   4
C   5   6
D   7   8
E   9  10
F  11  12
G  13  14

In [187]:
df.apply(lambda x: x**2)

     a    b
A    1    4
B    9   16
C   25   36
D   49   64
E   81  100
F  121  144
G  169  196

In [188]:
df = pd.DataFrame(np.arange(0, 5.5, 0.5), columns=['x'])
np.seterr(divide = 'ignore')
df['ln(x)'] = df['x'].apply(lambda x: np.log(x))
df

      x     ln(x)
0   0.0      -inf
1   0.5 -0.693147
2   1.0  0.000000
3   1.5  0.405465
4   2.0  0.693147
5   2.5  0.916291
6   3.0  1.098612
7   3.5  1.252763
8   4.0  1.386294
9   4.5  1.504077
10  5.0  1.609438

In [189]:
df['ln(x)'] = df['x'].apply(np.log)
df

      x     ln(x)
0   0.0      -inf
1   0.5 -0.693147
2   1.0  0.000000
3   1.5  0.405465
4   2.0  0.693147
5   2.5  0.916291
6   3.0  1.098612
7   3.5  1.252763
8   4.0  1.386294
9   4.5  1.504077
10  5.0  1.609438

In [190]:
arr = np.array(range(1, 17)).reshape(8, 2)
df = pd.DataFrame(arr, columns=['A', 'B'])
print(df)
df['C'] = df['A'] + df['B']
print(df)

    A   B
0   1   2
1   3   4
2   5   6
3   7   8
4   9  10
5  11  12
6  13  14
7  15  16
    A   B   C
0   1   2   3
1   3   4   7
2   5   6  11
3   7   8  15
4   9  10  19
5  11  12  23
6  13  14  27
7  15  16  31

In [191]:
df = pd.DataFrame(list('абвгдеёжзи'), columns=['Буквы'])
df['Описание'] = df['Буквы'].apply(lambda x: 'это буква ' + x)
df

  Буквы     Описание
0     а  это буква а
1     б  это буква б
2     в  это буква в
3     г  это буква г
4     д  это буква д
5     е  это буква е
6     ё  это буква ё
7     ж  это буква ж
8     з  это буква з
9     и  это буква и

In [192]:
df = pd.DataFrame({
    'Магазин': ['Магазин 1', 'Магазин 1', 'Магазин 2', 'Магазин 2', 'Магазин 3', 'Магазин 3'],
    'Продукт': ['Товар 1', 'Товар 2', 'Товар 1', 'Товар 2', 'Товар 1', 'Товар 2'],
    'Продажи': [100, 200, 150, 250, 50, 100]
})
df

     Магазин  Продукт  Продажи
0  Магазин 1  Товар 1      100
1  Магазин 1  Товар 2      200
2  Магазин 2  Товар 1      150
3  Магазин 2  Товар 2      250
4  Магазин 3  Товар 1       50
5  Магазин 3  Товар 2      100

In [193]:
store = 'Магазин 3'
total_year_sum = df[df['Магазин'] == store]['Продажи'].sum()
print(f'{store}: {total_year_sum}')

Магазин 3: 150

In [194]:
df = pd.DataFrame({
    "Район": ["Район1", "Район2", "Район1", "Район3", "Район2"],
    "Стоимость": [1000000, 2000000, 1500000, 1200000, 1800000]
})
df

    Район  Стоимость
0  Район1    1000000
1  Район2    2000000
2  Район1    1500000
3  Район3    1200000
4  Район2    1800000

In [195]:
sub = 'Район1'
price_mean = df[df['Район'] == sub]['Стоимость'].mean()
print(f'{sub}: {price_mean}')

Район1: 1250000.0

In [196]:
price_mean_df = df.groupby('Район')['Стоимость'].mean().astype('float64')
print(f'{sub}: {price_mean_df[sub]}')

Район1: 1250000.0

In [197]:
sales_data = {'Продукт': ['Мюсли', 'Гранола', 'Овсянка', 'Фрукты', 'Йогурт'], 'Количество проданных единиц':
        [150, 80, 120, 200, 100], 'Цена за единицу': [3.99, 5.99, 2.99, 1.99, 2.49]}
df = pd.DataFrame(sales_data)
df

   Продукт  Количество проданных единиц  Цена за единицу
0    Мюсли                          150             3.99
1  Гранола                           80             5.99
2  Овсянка                          120             2.99
3   Фрукты                          200             1.99
4   Йогурт                          100             2.49

In [198]:
df['Выручка'] = df['Цена за единицу'].mul(df['Количество проданных единиц'])
total_revenue = df['Выручка'].sum()
print(f'Общая выручка составляет: {total_revenue}')
df

Общая выручка составляет: 2083.5

   Продукт  Количество проданных единиц  Цена за единицу  Выручка
0    Мюсли                          150             3.99    598.5
1  Гранола                           80             5.99    479.2
2  Овсянка                          120             2.99    358.8
3   Фрукты                          200             1.99    398.0
4   Йогурт                          100             2.49    249.0

In [199]:
df['Выручка'] = np.prod(df[['Количество проданных единиц', 'Цена за единицу']], axis=1)
df

   Продукт  Количество проданных единиц  Цена за единицу  Выручка
0    Мюсли                          150             3.99    598.5
1  Гранола                           80             5.99    479.2
2  Овсянка                          120             2.99    358.8
3   Фрукты                          200             1.99    398.0
4   Йогурт                          100             2.49    249.0

In [200]:
df = pd.DataFrame({
    'Дата': ['2023-05-01', '2023-05-02', '2023-05-03'],
    'Время отправления': ['08:30:00', '12:15:00', '17:30:00'],
    'Место отправления': ['Аэропорт', 'Офис', 'Ж/Д Вокзал'],
    'Место назначения': ['Отель', 'Ресторан', 'Музей'],
    'Расстояние (км)': [25, 10, 8],
    'Время поездки (мин)': [40, 20, 15]
})
df

,Дата,Время отправления,Место отправления,Место назначения,Расстояние (км),Время поездки (мин)
0,2023-05-01,08:30:00,Аэропорт,Отель,25,40
1,2023-05-02,12:15:00,Офис,Ресторан,10,20
2,2023-05-03,17:30:00,Ж/Д Вокзал,Музей,8,15

In [201]:
new_df = pd.DataFrame({
    'Место отправления': df['Место отправления'],
    'Место назначения': df['Место назначения'],
    'Стоимость поездки, руб.': df['Расстояние (км)'] * 30 + df['Время поездки (мин)'] * 2
    })
new_df

  Место отправления Место назначения  Стоимость поездки, руб.
0          Аэропорт            Отель                      830
1              Офис         Ресторан                      340
2        Ж/Д Вокзал            Музей                      270

In [202]:
def cost(dist, dur):
    return 30 * dist + 2 * dur
new_df = df.loc[:, ['Место отправления', 'Место назначения']]
new_df['Стоимость поездки, руб.'] = cost(df['Расстояние (км)'], df['Время поездки (мин)'])
new_df

  Место отправления Место назначения  Стоимость поездки, руб.
0          Аэропорт            Отель                      830
1              Офис         Ресторан                      340
2        Ж/Д Вокзал            Музей                      270

In [203]:
new_df = df[['Место отправления', 'Место назначения']]
new_df['Стоимость поездки, руб.'] = df['Расстояние (км)'].apply(lambda x: x * 30) + df['Время поездки (мин)'].apply(lambda x: x * 2)
new_df

C:\Users\kuche\AppData\Local\Temp\ipykernel_8436\3624186263.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['Стоимость поездки, руб.'] = df['Расстояние (км)'].apply(lambda x: x * 30) + df['Время поездки (мин)'].apply(lambda x: x * 2)

  Место отправления Место назначения  Стоимость поездки, руб.
0          Аэропорт            Отель                      830
1              Офис         Ресторан                      340
2        Ж/Д Вокзал            Музей                      270

In [204]:
new_df = df[['Место отправления', 'Место назначения']]
new_df['Стоимость поездки, руб.'] = df[['Расстояние (км)', 'Время поездки (мин)']].apply(lambda x: x * [30, 2], axis=1).sum(axis=1)
new_df

C:\Users\kuche\AppData\Local\Temp\ipykernel_8436\4068227687.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['Стоимость поездки, руб.'] = df[['Расстояние (км)', 'Время поездки (мин)']].apply(lambda x: x * [30, 2], axis=1).sum(axis=1)

  Место отправления Место назначения  Стоимость поездки, руб.
0          Аэропорт            Отель                      830
1              Офис         Ресторан                      340
2        Ж/Д Вокзал            Музей                      270

In [205]:
df = pd.DataFrame({
    'Имя': ['Иван', 'Петр', 'Мария', 'Алексей'],
    'Фамилия': ['Иванов', 'Петров', 'Сидорова', 'Козлов'],
    'Алгебра': [5, 3, 4, 5],
    'Геометрия': [4, 5, 3, 5],
    'Английский': [3, 4, 5, 5],
    'Общий балл': [12, 12, 12, 15]
})
df

       Имя   Фамилия  Алгебра  Геометрия  Английский  Общий балл
0     Иван    Иванов        5          4           3          12
1     Петр    Петров        3          5           4          12
2    Мария  Сидорова        4          3           5          12
3  Алексей    Козлов        5          5           5          15

In [206]:
df['Средний балл'] = df.iloc[:, 2:5].apply(np.mean, axis=1)
df

       Имя   Фамилия  Алгебра  Геометрия  Английский  Общий балл  Средний балл
0     Иван    Иванов        5          4           3          12           4.0
1     Петр    Петров        3          5           4          12           4.0
2    Мария  Сидорова        4          3           5          12           4.0
3  Алексей    Козлов        5          5           5          15           5.0

In [207]:
def score_mean(row):
    return row[['Алгебра','Геометрия','Английский']].mean()

df['Средний балл'] = df.apply(score_mean, axis=1)
df

       Имя   Фамилия  Алгебра  Геометрия  Английский  Общий балл  Средний балл
0     Иван    Иванов        5          4           3          12           4.0
1     Петр    Петров        3          5           4          12           4.0
2    Мария  Сидорова        4          3           5          12           4.0
3  Алексей    Козлов        5          5           5          15           5.0

In [208]:
data = {'Покупатель': ['Иван', 'Петр', 'Мария', 'Алексей'],
        'Название': ['Книга', 'Ноутбук', 'Смартфон', 'Компьютер'],
        'Цена': [500, 40000, 25000, 60000],
        'Количество': [2, 1, 1, 1],
        'Почта': ['ivanov@example.com', 'petrov@example.com', 'sidorova@example.com', 'kozlov@example.com']}
df = pd.DataFrame(data)
df

  Покупатель   Название   Цена  Количество                 Почта
0       Иван      Книга    500           2    ivanov@example.com
1       Петр    Ноутбук  40000           1    petrov@example.com
2      Мария   Смартфон  25000           1  sidorova@example.com
3    Алексей  Компьютер  60000           1    kozlov@example.com

In [209]:
def total_cost(row):
    return row['Цена'] * row['Количество']

df['Стоимость'] = df.apply(total_cost, axis=1)
df

  Покупатель   Название   Цена  Количество                 Почта  Стоимость
0       Иван      Книга    500           2    ivanov@example.com       1000
1       Петр    Ноутбук  40000           1    petrov@example.com      40000
2      Мария   Смартфон  25000           1  sidorova@example.com      25000
3    Алексей  Компьютер  60000           1    kozlov@example.com      60000

In [210]:
data = {'Название': ['Apple iPhone 12', 'Samsung Galaxy S21', 'Xiaomi Mi 11', 'Google Pixel 5'],
        'Описание': ['Мощный смартфон от Apple', 'Премиальный андроид от Samsung', 'Смартфон с высокопроизводительной камерой', 'Новый флагман Google с лучшей камерой']}

df = pd.DataFrame(data)
df

             Название                                   Описание
0     Apple iPhone 12                   Мощный смартфон от Apple
1  Samsung Galaxy S21             Премиальный андроид от Samsung
2        Xiaomi Mi 11  Смартфон с высокопроизводительной камерой
3      Google Pixel 5      Новый флагман Google с лучшей камерой

In [211]:
df['Название'] = df['Название'].apply(lambda x: x.lower())
df['Описание'] = df['Описание'].apply(lambda x: x.replace('смартфон', 'телефон').replace('Смартфон', 'Телефон'))
df

             Название                                  Описание
0     apple iphone 12                   Мощный телефон от Apple
1  samsung galaxy s21            Премиальный андроид от Samsung
2        xiaomi mi 11  Телефон с высокопроизводительной камерой
3      google pixel 5     Новый флагман Google с лучшей камерой

In [212]:
df['Название'] = df['Название'].str.lower()
df['Описание'] = df['Описание'].str.replace('смартфон', 'телефон').str.replace('Смартфон', 'Телефон')
df

             Название                                  Описание
0     apple iphone 12                   Мощный телефон от Apple
1  samsung galaxy s21            Премиальный андроид от Samsung
2        xiaomi mi 11  Телефон с высокопроизводительной камерой
3      google pixel 5     Новый флагман Google с лучшей камерой

# 4.4 Основы сортировки в Pandas

In [213]:
# создаем Series
s = pd.Series([4, 3, 2, 1], index=['d', 'c', 'b', 'a'])

# сортируем по индексу по возрастанию
s_sorted = s.sort_index()
s_sorted

a    1
b    2
c    3
d    4
dtype: int64

In [214]:
# создаем DataFrame
df = pd.DataFrame({'A': [1, 4, 3, 2], 'B': [3, 2, 1, 4], 'C': [2, 1, 4, 3]}, index=['d', 'c', 'b', 'a'])

# сортируем по индексу по возрастанию
df_sorted = df.sort_index()
df_sorted

   A  B  C
a  2  4  3
b  3  1  4
c  4  2  1
d  1  3  2

In [215]:
# создаем DataFrame
df = pd.DataFrame({'D': [1, 4, 3, 2], 'B': [3, 2, 1, 4], 'C': [2, 1, 4, 3]}, index=['d', 'c', 'b', 'a'])

# сортируем по столбцам по возрастанию
df_sorted = df.sort_index(axis=1, ascending=True)
df_sorted

   B  C  D
d  3  2  1
c  2  1  4
b  1  4  3
a  4  3  2

In [216]:
sales = pd.DataFrame({'date': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02', '2022-01-03'],
                      'item': ['apple', 'banana', 'apple', 'banana', 'orange'],
                      'quantity': [3, 2, 1, 4, 2],
                      'price': [1.99, 0.99, 2.49, 1.49, 0.79]})
sales

         date    item  quantity  price
0  2022-01-01   apple         3   1.99
1  2022-01-01  banana         2   0.99
2  2022-01-02   apple         1   2.49
3  2022-01-02  banana         4   1.49
4  2022-01-03  orange         2   0.79

In [217]:
sales_sorted = sales.sort_values('price')
sales_sorted

         date    item  quantity  price
4  2022-01-03  orange         2   0.79
1  2022-01-01  banana         2   0.99
3  2022-01-02  banana         4   1.49
0  2022-01-01   apple         3   1.99
2  2022-01-02   apple         1   2.49

In [218]:
sales_sorted = sales.sort_values(['item', 'price'])
sales_sorted

         date    item  quantity  price
0  2022-01-01   apple         3   1.99
2  2022-01-02   apple         1   2.49
1  2022-01-01  banana         2   0.99
3  2022-01-02  banana         4   1.49
4  2022-01-03  orange         2   0.79

In [219]:
sales_sorted = sales.sort_values(['item', 'price'], ascending=[False, True])
sales_sorted

         date    item  quantity  price
4  2022-01-03  orange         2   0.79
1  2022-01-01  banana         2   0.99
3  2022-01-02  banana         4   1.49
0  2022-01-01   apple         3   1.99
2  2022-01-02   apple         1   2.49

In [220]:
sales = pd.DataFrame({'date': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02', '2022-01-03', '2022-01-04'],
                      'item': ['apple', 'banana', 'apple', 'banana', 'orange', 'apple'],
                      'quantity': [3, 2, 1, 4, 2, 2],
                      'price': [1.99, 0.99, None, 1.49, 0.79, 1.99]})
sales

         date    item  quantity  price
0  2022-01-01   apple         3   1.99
1  2022-01-01  banana         2   0.99
2  2022-01-02   apple         1    NaN
3  2022-01-02  banana         4   1.49
4  2022-01-03  orange         2   0.79
5  2022-01-04   apple         2   1.99

In [221]:
sales_sorted = sales.sort_values(['price'], ascending=True, na_position='first')
sales_sorted

         date    item  quantity  price
2  2022-01-02   apple         1    NaN
4  2022-01-03  orange         2   0.79
1  2022-01-01  banana         2   0.99
3  2022-01-02  banana         4   1.49
0  2022-01-01   apple         3   1.99
5  2022-01-04   apple         2   1.99

In [222]:
data = {
    'Название': ['Война и мир', 'Преступление и наказание', 'Мастер и Маргарита', '451 градус по Фаренгейту'],
    'Автор': ['Л. Н. Толстой', 'Ф. М. Достоевский', 'М. А. Булгаков', 'Р. Брэдбери'],
    'Жанр': ['роман', 'роман', 'роман', 'фантастика'],
    'Цена': [1000, 800, 950, 1200],
    'Продажи': [500, 700, 450, 800],
    'Год издания': [1869, 1866, 1967, 1953]
}

df = pd.DataFrame(data)
df

,Название,Автор,Жанр,Цена,Продажи,Год издания
0,Война и мир,Л. Н. Толстой,роман,1000,500,1869
1,Преступление и наказание,Ф. М. Достоевский,роман,800,700,1866
2,Мастер и Маргарита,М. А. Булгаков,роман,950,450,1967
3,451 градус по Фаренгейту,Р. Брэдбери,фантастика,1200,800,1953

In [223]:
df.sort_values(by='Год издания')[['Название', 'Автор', 'Цена', 'Продажи', 'Год издания']]

                   Название              Автор  Цена  Продажи  Год издания
1  Преступление и наказание  Ф. М. Достоевский   800      700         1866
0               Война и мир      Л. Н. Толстой  1000      500         1869
3  451 градус по Фаренгейту        Р. Брэдбери  1200      800         1953
2        Мастер и Маргарита     М. А. Булгаков   950      450         1967

In [224]:
df.sort_values(by=['Год издания']).loc[:, ['Название', 'Автор', 'Цена', 'Продажи', 'Год издания']]

                   Название              Автор  Цена  Продажи  Год издания
1  Преступление и наказание  Ф. М. Достоевский   800      700         1866
0               Война и мир      Л. Н. Толстой  1000      500         1869
3  451 градус по Фаренгейту        Р. Брэдбери  1200      800         1953
2        Мастер и Маргарита     М. А. Булгаков   950      450         1967

# 4.5 Ранжирование в Pandas

In [225]:
# Создадим Series с данными
data = pd.Series([10, 20, 30, 40, 50])
print(data)

# Назначим ранги элементам
rank = data.rank()
print(rank)

0    10
1    20
2    30
3    40
4    50
dtype: int64
0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [226]:
data = pd.Series([10, 20, 30, 40, 50, 50])
print(data)

# Значения с порядковыми номерами 5 и 6 повторяются (50), ранг присваивается как среднее (5.5)
rank = data.rank()
print(rank)

0    10
1    20
2    30
3    40
4    50
5    50
dtype: int64
0    1.0
1    2.0
2    3.0
3    4.0
4    5.5
5    5.5
dtype: float64

In [227]:
# Создадим DataFrame с данными
data = pd.DataFrame({
    'Имя': ['Андрей', 'Борис', 'Владимир', 'Дмитрий'],
    'Оценка': [95, 85, 90, 85]
})

print(data)

# Назначим ранги элементам
rank = data.rank()
print(rank)

# Ранг назначен для каждой колонки

        Имя  Оценка
0    Андрей      95
1     Борис      85
2  Владимир      90
3   Дмитрий      85
   Имя  Оценка
0  1.0     4.0
1  2.0     1.5
2  3.0     3.0
3  4.0     1.5

In [228]:
# Назначим ранги элементам
rank = data['Оценка'].rank()

# Добавим столбец с рангами в DataFrame
data['Ранг'] = rank

print(data)

        Имя  Оценка  Ранг
0    Андрей      95   4.0
1     Борис      85   1.5
2  Владимир      90   3.0
3   Дмитрий      85   1.5

In [229]:
# Создадим DataFrame с данными
data = pd.DataFrame({
    'Имя': ['Андрей', 'Борис', 'Владимир', 'Дмитрий', 'Николай'],
    'Оценка': [95, 85, 90, 80, 80]
})

# Назначим ранги элементам, начиная с 1
rank = data['Оценка'].rank(method='min')

# Добавим столбец с рангами в DataFrame
data['Ранг'] = rank

print(data)

# Если передать в method параметр min, то одинаковым элементам будет присваиваться минимальный рейтинг.
# method='max' - максимальный
# method='first' - при совпадении значений элементов присваивается ранг по порядку появляения таких элементов
# method='average' - параметр по умолчанию

        Имя  Оценка  Ранг
0    Андрей      95   5.0
1     Борис      85   3.0
2  Владимир      90   4.0
3   Дмитрий      80   1.0
4   Николай      80   1.0

In [230]:
# Ранжирование по строкам (axis=1)
df = pd.DataFrame({'A': [1, 4, 3, 4], 'B': [3, 2, 4, 1]})
print(df)
print(df.rank(axis=1))

   A  B
0  1  3
1  4  2
2  3  4
3  4  1
     A    B
0  1.0  2.0
1  2.0  1.0
2  1.0  2.0
3  2.0  1.0

In [231]:
# Создаем DataFrame с данными о ВВП
data = {'Country': ['USA', 'China', 'Japan', 'Germany', 'UK'],
        '2017': [19362, 12238, 4884, 3693, 2622],
        '2018': [20510, 13608, 4972, 3855, 2825],
        '2019': [21433, 14273, 5080, 3846, 2706],
        '2020': [20936, 14727, 5030, 3275, 2400],
        '2021': [22923, 16726, 5163, 4122, 2822]}

df = pd.DataFrame(data)
df

   Country   2017   2018   2019   2020   2021
0      USA  19362  20510  21433  20936  22923
1    China  12238  13608  14273  14727  16726
2    Japan   4884   4972   5080   5030   5163
3  Germany   3693   3855   3846   3275   4122
4       UK   2622   2825   2706   2400   2822

In [232]:
rank = df[['2017', '2018', '2019', '2020', '2021']].rank()
df[['2017', '2018', '2019', '2020', '2021']] = rank
df

   Country  2017  2018  2019  2020  2021
0      USA   5.0   5.0   5.0   5.0   5.0
1    China   4.0   4.0   4.0   4.0   4.0
2    Japan   3.0   3.0   3.0   3.0   3.0
3  Germany   2.0   2.0   2.0   2.0   2.0
4       UK   1.0   1.0   1.0   1.0   1.0

In [233]:
df = pd.DataFrame(data)

df_ranks = df.rank()
df_ranks['Country'] = df['Country']
df_ranks

   Country  2017  2018  2019  2020  2021
0      USA   5.0   5.0   5.0   5.0   5.0
1    China   4.0   4.0   4.0   4.0   4.0
2    Japan   3.0   3.0   3.0   3.0   3.0
3  Germany   2.0   2.0   2.0   2.0   2.0
4       UK   1.0   1.0   1.0   1.0   1.0

In [234]:
data = {'Product': ['Product A', 'Product B', 'Product C', 'Product D', 'Product E'],
        'Region 1': [120, 150, 50, 80, 120],
        'Region 2': [200, 100, 80, 60, 90],
        'Region 3': [150, 80, 100, 70, 130],
        'Region 4': [120, 60, 90, 90, 110],
        'Region 5': [80, 70, 60, 100, 140],
        'Region 6': [70, 120, 110, 70, 70]}
df = pd.DataFrame(data)
df

     Product  Region 1  Region 2  Region 3  Region 4  Region 5  Region 6
0  Product A       120       200       150       120        80        70
1  Product B       150       100        80        60        70       120
2  Product C        50        80       100        90        60       110
3  Product D        80        60        70        90       100        70
4  Product E       120        90       130       110       140        70

In [235]:
df_rank = df.rank(method='min')
df_rank['Product'] = df['Product']
df_rank

     Product  Region 1  Region 2  Region 3  Region 4  Region 5  Region 6
0  Product A       3.0       5.0       5.0       5.0       3.0       1.0
1  Product B       5.0       4.0       2.0       1.0       2.0       5.0
2  Product C       1.0       2.0       3.0       2.0       1.0       4.0
3  Product D       2.0       1.0       1.0       2.0       4.0       1.0
4  Product E       3.0       3.0       4.0       4.0       5.0       1.0

In [236]:
data = {'Product': ['Product A', 'Product B', 'Product C', 'Product D', 'Product E'],
        'Region 1': [120, 150, 50, 80, 120],
        'Region 2': [200, 100, 80, 60, 90],
        'Region 3': [150, 80, 100, 70, 130],
        'Region 4': [120, 60, 90, 90, 110],
        'Region 5': [80, 70, 60, 100, 140],
        'Region 6': [70, 120, 110, 70, 70]}

df = pd.DataFrame(data)
df

     Product  Region 1  Region 2  Region 3  Region 4  Region 5  Region 6
0  Product A       120       200       150       120        80        70
1  Product B       150       100        80        60        70       120
2  Product C        50        80       100        90        60       110
3  Product D        80        60        70        90       100        70
4  Product E       120        90       130       110       140        70

In [237]:
rank_df = pd.DataFrame({
    'Product': df['Product'].values,
    'Ранг': df.loc[:,'Region 1':'Region 6'].sum(axis=1).rank(method='max')
})

rank_df

     Product  Ранг
0  Product A   5.0
1  Product B   3.0
2  Product C   2.0
3  Product D   1.0
4  Product E   4.0

In [238]:
df = pd.DataFrame(data)

df_rank = df.copy()
df_rank['Ранг'] = df_rank.sum(axis=1, numeric_only=True).rank(method='max')
df_rank[['Product', 'Ранг']]

     Product  Ранг
0  Product A   5.0
1  Product B   3.0
2  Product C   2.0
3  Product D   1.0
4  Product E   4.0

# 4.6 Редукционные функции в Pandas

In [239]:
# Эти функции называются редукционными, потому что они «сжимают» данные до одного значения.
# sum(): вычисляет сумму значений в объекте DataFrame или Series
# min(): вычисляет минимальное значение в объекте DataFrame или Series
# max(): вычисляет максимальное значение в объекте DataFrame или Series
# count(): вычисляет количество значений в объекте DataFrame или Series
# idxmin() и idxmax() - возвращают индекс минимального или максимального значения соответственно
# argmin() и argmax() - для объекта Series!!! возвращают индекс минимального или максимального значения соответственно
# cumsum() и cumprod() - вычисляют кумулятивную сумму и произведение соответственно (накопление вычисленных сумм или произведений)
# cummin() и cummax() - вычисляют кумулятивный минимум и максимум соответственно
# и многие другие

In [240]:
# В функции sum() в Pandas есть необязательный параметр skipna
# Если параметр skipna равен True, то функция sum() пропускает любые значения NaN при вычислении суммы.
# Если параметр skipna равен False, то функция sum() вернет NaN в случае наличия хотя бы одного значения NaN в объекте DataFrame или Series.

In [241]:
data = {'Товар': ['Книга', 'Канцелярия', 'Одежда'],
        'Количество': [10, 50, 20],
        'Цена': [100, 50, 200]}

df = pd.DataFrame(data)
df

        Товар  Количество  Цена
0       Книга          10   100
1  Канцелярия          50    50
2      Одежда          20   200

In [242]:
# Суммируем по столбцам
total_sales = df.sum()
total_sales

Товар         КнигаКанцелярияОдежда
Количество                       80
Цена                            350
dtype: object

In [243]:
# Суммируем по строкам
total_sales = df.sum(axis=1, numeric_only=True)
total_sales

0    110
1    100
2    220
dtype: int64

In [244]:
data = pd.Series([1, 2, 3, 4, 5])

# кумулятивная сумма
cumulative_sum = data.cumsum()
print(cumulative_sum)

# кумулятивное произведение
cumulative_product = data.cumprod()
print(cumulative_product)

0     1
1     3
2     6
3    10
4    15
dtype: int64
0      1
1      2
2      6
3     24
4    120
dtype: int64

In [245]:
# список дат в периоде с 1 по 10 мая
dates = pd.date_range(start='2023-05-01', end='2023-05-10', freq='D')

# список штрих-кодов продуктов
barcodes = ['A123', 'B456', 'C789']
np.random.seed(22)
# генерируем случайные данные о продажах
data = {'date': np.random.choice(dates, size=15),
        'barcode': np.random.choice(barcodes, size=15),
        'quantity': np.random.randint(1, 10, size=15)}

# создаем DataFrame
sales_data = pd.DataFrame(data)
sales_data

         date barcode  quantity
0  2023-05-06    A123         5
1  2023-05-05    B456         5
2  2023-05-01    A123         8
3  2023-05-05    C789         2
4  2023-05-07    B456         2
5  2023-05-07    C789         8
6  2023-05-05    B456         4
7  2023-05-09    C789         1
8  2023-05-05    B456         2
9  2023-05-03    C789         6
10 2023-05-09    C789         6
11 2023-05-08    C789         5
12 2023-05-03    B456         2
13 2023-05-10    C789         5
14 2023-05-09    B456         4

In [246]:
sales_data.sort_values(by=['date', 'barcode'], inplace=True)
sales_data

         date barcode  quantity
2  2023-05-01    A123         8
12 2023-05-03    B456         2
9  2023-05-03    C789         6
1  2023-05-05    B456         5
6  2023-05-05    B456         4
8  2023-05-05    B456         2
3  2023-05-05    C789         2
0  2023-05-06    A123         5
4  2023-05-07    B456         2
5  2023-05-07    C789         8
11 2023-05-08    C789         5
14 2023-05-09    B456         4
7  2023-05-09    C789         1
10 2023-05-09    C789         6
13 2023-05-10    C789         5

In [247]:
# barcode = input()
barcode = 'C789'
quantity = sales_data[sales_data['barcode'] == barcode].sum(numeric_only=True).values[0]
quantity

33

In [248]:
sales_data.loc[sales_data['barcode'] == barcode, 'quantity'].sum()

33

In [249]:
# Сгенерируем случайные данные опроса
employee_ids = range(1, 51)
np.random.seed(44)
satisfaction_scores = np.random.randint(1, 6, 50)
survey_data = pd.DataFrame({'employee_id': employee_ids, 'satisfaction_score': satisfaction_scores})
survey_data.head()

   employee_id  satisfaction_score
0            1                   5
1            2                   4
2            3                   2
3            4                   4
4            5                   4

In [250]:
survey_data.loc[survey_data['satisfaction_score'] == survey_data['satisfaction_score'].max()].count()

employee_id           9
satisfaction_score    9
dtype: int64

In [251]:
# генерация случайных данных для примера
models = ['Ford', 'Toyota', 'Honda', 'BMW', 'Mercedes', 'Hyundai'] * 8
np.random.seed(8)
np.random.shuffle(models)
dates = pd.date_range('20210101', periods=48)
prices = np.random.randint(15000, 55000, 48)

# создание Pandas dataframe с данными о продажах
sales_data = {'model': models,
              'date': dates,
              'price': prices}

sales = pd.DataFrame(sales_data)
sales.head()

      model       date  price
0      Ford 2021-01-01  44094
1   Hyundai 2021-01-02  27487
2  Mercedes 2021-01-03  32784
3  Mercedes 2021-01-04  30974
4    Toyota 2021-01-05  44122

In [252]:
# 1. Таблица DataFrame с моделями, датами продажи и минимальной ценой продажи.
sales.loc[sales['price'] == sales['price'].min(), ['model', 'date', 'price']]

   model       date  price
18  Ford 2021-01-19  15788

In [253]:
# 2. Таблица DataFrame с моделями, датами продажи и максимальной ценой продажи.
sales.loc[sales['price'] == sales['price'].max(), ['model', 'date', 'price']]

      model       date  price
27  Hyundai 2021-01-28  53155

In [254]:
# генерация случайных данных для примера
np.random.seed(55)
products = ['Product A', 'Product B', 'Product C', 'Product D', 'Product E']
months = list(pd.date_range('20210101', periods=10, freq='M'))
sales = np.random.randint(100, 1000, size=(5, 10))

# создание Pandas dataframe с данными о продажах товаров за каждый месяц
sales_data = pd.DataFrame(data=sales, index=products, columns=months)
sales_data

C:\Users\kuche\AppData\Local\Temp\ipykernel_8436\2118200613.py:4: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  months = list(pd.date_range('20210101', periods=10, freq='M'))

,2021-01-31,2021-02-28,2021-03-31,2021-04-30,2021-05-31,2021-06-30,2021-07-31,2021-08-31,2021-09-30,2021-10-31
Product A,561,766,395,993,641,923,137,447,773,154
Product B,468,647,786,450,929,561,706,752,643,965
Product C,859,940,535,814,715,577,319,484,795,930
Product D,143,849,831,694,149,956,532,306,348,238
Product E,928,543,832,717,144,408,833,592,249,689

In [255]:
product_max_sales = sales_data.sum(axis=1, numeric_only=True).idxmax()
product_min_sales = sales_data.sum(axis=1, numeric_only=True).idxmin()
print(f'Товар с максимальным количеством продаж: {product_max_sales}')
print(f'Товар с минимальным количеством продаж: {product_min_sales}')

Товар с максимальным количеством продаж: Product C
Товар с минимальным количеством продаж: Product D

In [256]:
# Создаем DataFrame с данными о баллах спортсменов
athlete_ids = range(1, 11)
scores = {'athlete_id': athlete_ids,
          'exercise1': [8, 7, 6, 9, 8, 7, 6, 9, 8, 7],
          'exercise2': [7, 6, 8, 9, 6, 7, 9, 8, 6, 7],
          'exercise3': [9, 8, 7, 6, 9, 8, 7, 6, 9, 8],
          'exercise4': [6, 9, 7, 8, 7, 6, 9, 8, 7, 6],
          'exercise5': [7, 8, 6, 9, 8, 7, 6, 9, 8, 7]}
scores_data = pd.DataFrame(scores)
scores_data

   athlete_id  exercise1  exercise2  exercise3  exercise4  exercise5
0           1          8          7          9          6          7
1           2          7          6          8          9          8
2           3          6          8          7          7          6
3           4          9          9          6          8          9
4           5          8          6          9          7          8
5           6          7          7          8          6          7
6           7          6          9          7          9          6
7           8          9          8          6          8          9
8           9          8          6          9          7          8
9          10          7          7          8          6          7

In [257]:
cols = list('cumulative'+str(i) for i in range(1,6))
cumulative_scores_data = scores_data.copy()
cumulative_scores_data[cols] = scores_data.iloc[:,1:6].cumsum(axis=1)
cumulative_scores_data[['athlete_id', 'cumulative1', 'cumulative2', 'cumulative3', 'cumulative4','cumulative5']]

   athlete_id  cumulative1  cumulative2  cumulative3  cumulative4  cumulative5
0           1            8           15           24           30           37
1           2            7           13           21           30           38
2           3            6           14           21           28           34
3           4            9           18           24           32           41
4           5            8           14           23           30           38
5           6            7           14           22           28           35
6           7            6           15           22           31           37
7           8            9           17           23           31           40
8           9            8           14           23           30           38
9          10            7           14           22           28           35

In [258]:
cumulative_scores_data = scores_data.copy()
cumulative_scores_data.iloc[:,1:6] = cumulative_scores_data.iloc[:,1:6].cumsum(axis=1)
cumulative_scores_data.columns = cumulative_scores_data.columns.str.replace('exercise', 'cumulative')
cumulative_scores_data

   athlete_id  cumulative1  cumulative2  cumulative3  cumulative4  cumulative5
0           1            8           15           24           30           37
1           2            7           13           21           30           38
2           3            6           14           21           28           34
3           4            9           18           24           32           41
4           5            8           14           23           30           38
5           6            7           14           22           28           35
6           7            6           15           22           31           37
7           8            9           17           23           31           40
8           9            8           14           23           30           38
9          10            7           14           22           28           35

In [259]:
# Создаем DataFrame с данными о количестве новых подписчиков
dates = pd.date_range(start='2023-05-01', periods=7, freq='D')
new_subscribers = [10, 5, 15, 8, 12, 7, 9]
subscribers_data = pd.DataFrame({'date': dates, 'new_subscribers': new_subscribers})
subscribers_data

        date  new_subscribers
0 2023-05-01               10
1 2023-05-02                5
2 2023-05-03               15
3 2023-05-04                8
4 2023-05-05               12
5 2023-05-06                7
6 2023-05-07                9

In [260]:
subscribers_data['cumulative_min'] = subscribers_data['new_subscribers'].cummin()
subscribers_data['cumulative_max'] = subscribers_data['new_subscribers'].cummax()
subscribers_data

        date  new_subscribers  cumulative_min  cumulative_max
0 2023-05-01               10              10              10
1 2023-05-02                5               5              10
2 2023-05-03               15               5              15
3 2023-05-04                8               5              15
4 2023-05-05               12               5              15
5 2023-05-06                7               5              15
6 2023-05-07                9               5              15

In [261]:
# Создаем DataFrame с данными о продажах в разных регионах
region_data = {'region': ['Регион A', 'Регион B', 'Регион A', 'Регион B', 'Регион C'],
               'revenue': [5000, 8000, 6000, 7000, 9000],
               'quantity': [100, 150, 120, 130, 110]}
sales_data = pd.DataFrame(region_data)
sales_data

     region  revenue  quantity
0  Регион A     5000       100
1  Регион B     8000       150
2  Регион A     6000       120
3  Регион B     7000       130
4  Регион C     9000       110

In [262]:
sales_data['tot_sales'] = sales_data['revenue'] * sales_data['quantity']
sales_data

     region  revenue  quantity  tot_sales
0  Регион A     5000       100     500000
1  Регион B     8000       150    1200000
2  Регион A     6000       120     720000
3  Регион B     7000       130     910000
4  Регион C     9000       110     990000

In [263]:
tot_sales_min = sales_data.tot_sales.min()
tot_sales_max = sales_data.tot_sales.max()
tot_sales_region_min = sales_data[sales_data['tot_sales'] == tot_sales_min]['region'].values[0]
tot_sales_region_max = sales_data[sales_data['tot_sales'] == tot_sales_max]['region'].values[0]
print(f'Минимальная сумма продаж {tot_sales_min} была зафиксирована в регионе {tot_sales_region_min}')
print(f'Максимальная сумма продаж {tot_sales_max} была зафиксирована в регионе {tot_sales_region_max}')

Минимальная сумма продаж 500000 была зафиксирована в регионе Регион A
Максимальная сумма продаж 1200000 была зафиксирована в регионе Регион B

In [264]:
sales_data = pd.DataFrame(region_data)

sales_data['tot_sales'] = sales_data.quantity * sales_data.revenue
print(sales_data)

print('Минимальная сумма продаж {0} была зафиксирована в регионе {1}'.format(
    sales_data.loc[sales_data.tot_sales.idxmin(),'tot_sales'],
    sales_data.loc[sales_data.tot_sales.idxmin(),'region']))

print('Максимальная сумма продаж {0} была зафиксирована в регионе {1}'.format(
    sales_data.loc[sales_data.tot_sales.idxmax(),'tot_sales'],
    sales_data.loc[sales_data.tot_sales.idxmax(),'region']))

     region  revenue  quantity  tot_sales
0  Регион A     5000       100     500000
1  Регион B     8000       150    1200000
2  Регион A     6000       120     720000
3  Регион B     7000       130     910000
4  Регион C     9000       110     990000
Минимальная сумма продаж 500000 была зафиксирована в регионе Регион A
Максимальная сумма продаж 1200000 была зафиксирована в регионе Регион B

In [265]:
# Создаем DataFrame с данными о затратах на проекты
project_data = {'project': ['Проект A', 'Проект B', 'Проект C', 'Проект D'],
                'budget': [50000, 80000, 60000, 70000]}
budget_data = pd.DataFrame(project_data)
budget_data

    project  budget
0  Проект A   50000
1  Проект B   80000
2  Проект C   60000
3  Проект D   70000

In [266]:
proj = budget_data.loc[budget_data['budget'].idxmax(), 'project']
percent = ((budget_data['budget'].max() / budget_data['budget'].sum(axis=0)) * 100).round(2)

print(proj, percent, sep='\n')

Проект B
30.77

In [267]:
print(budget_data['project'].loc[budget_data['budget'].idxmax()])
print(round(budget_data['budget'].max() / budget_data['budget'].sum() * 100, 2))

Проект B
30.77

# 4.7 Редукционные статистические функции в Pandas

In [268]:
# Создаем DataFrame с данными
data = {'A': [1, 2, 3, 4, 5],
        'B': [6, 7, 8, 9, 10]}
df = pd.DataFrame(data)

# Вычисляем среднее значение для столбца A
mean_A = df['A'].mean()
print("Среднее значение столбца A:", mean_A)

Среднее значение столбца A: 3.0

In [269]:
# Вычисляем медиану для столбца B
median_B = df['B'].median()
print("Медиана столбца B:", median_B)

Медиана столбца B: 8.0

In [270]:
# Вычисляем стандартное отклонение для столбца A
std_A = df['A'].std()
print("Стандартное отклонение столбца A:", std_A)

Стандартное отклонение столбца A: 1.5811388300841898

In [271]:
# Вычисляем дисперсию для столбца B
var_B = df['B'].var()
print("Дисперсия столбца B:", var_B)

Дисперсия столбца B: 2.5

In [272]:
# Создаем Series с данными
data = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

# Вычисляем 25-й и 75-й квантили
quantile_25 = data.quantile(0.25)
quantile_75 = data.quantile(0.75)

print("25-й квантиль:", quantile_25)
print("75-й квантиль:", quantile_75)
# Значение 3.25 означает, что 25% значений находятся ниже или равны этому значению, 
# а значение 8.75 означает, что 75% значений находятся ниже или равны этому значению.

25-й квантиль: 3.25
75-й квантиль: 7.75

In [273]:
# Создаем DataFrame с данными
data = {'A': [1, 2, 3, 4, 5],
        'B': [6, 7, 8, 9, 10]}
df = pd.DataFrame(data)

# Выводим сводную статистическую информацию
statistics = df.describe()
statistics

              A          B
count  5.000000   5.000000
mean   3.000000   8.000000
std    1.581139   1.581139
min    1.000000   6.000000
25%    2.000000   7.000000
50%    3.000000   8.000000
75%    4.000000   9.000000
max    5.000000  10.000000

In [274]:
np.random.seed(7)
# создаем DataFrame с 1000 строк и 2 столбцами (price и size)
df = pd.DataFrame({'price': np.random.randint(50000, 500000, 1000),
                   'size': np.random.randint(50, 200, 1000)})

print(df['price'].mean().round(2))
print(round(df['price'].var(),2))
print(round(df['price'].std(), 2))
print(round(df['price'].quantile(0.25), 2), round(df['price'].quantile(), 2), round(df['price'].quantile(0.75), 2))

271349.32
17268474934.96
131409.57
157966.5 268550.5 384973.75

In [275]:
describe = round(df['price'].describe(), 2)
print(describe['mean'], round(describe['std']**2, 2), describe['std'], f"{describe['25%']} {describe['50%']} {describe['75%']}", sep='\n')

271349.32
17268475087.58
131409.57
157966.5 268550.5 384973.75

In [276]:
random.seed(44)
# Функция для генерации случайных дат
def random_dates(start, end, n=1):
    start_u = start.value // 10 ** 9
    end_u = end.value // 10 ** 9

    return pd.to_datetime(np.random.randint(start_u, end_u, n), unit="s")
# Создаем список товаров для симуляции
products = ["Milk", "Eggs", "Bread", "Butter", "Cheese", "Tomatoes", "Cucumbers", "Carrots", "Apples", "Bananas"]
# Задаем количество записей (симуляция продаж за год)
n_records = 1000
# Генерируем данные с помощью списковых включений
data = {
    "Date": random_dates(pd.Timestamp("2021-01-01"), pd.Timestamp("2021-12-31"), n_records),
    "Product": [random.choice(products) for _ in range(n_records)],
    "QuantitySold": [random.randint(1, 20) for _ in range(n_records)],
    "Revenue": np.round(np.array([random.uniform(1, 100) for _ in range(n_records)]), 2),
}
# Создаем DataFrame
sales_df = pd.DataFrame(data)
sales_df.head()

                 Date    Product  QuantitySold  Revenue
0 2021-02-19 06:54:00  Cucumbers            16    75.69
1 2021-04-26 11:30:58     Apples             3    64.77
2 2021-01-04 08:18:43     Apples             9    83.78
3 2021-05-22 18:51:55       Eggs            19    74.56
4 2021-10-06 16:54:12      Bread            13    48.15

In [277]:
# prod = input()
prod = 'Apples'
prod_quantity = sales_df.loc[sales_df['Product'] == prod, 'QuantitySold'].sum()
prod_revenue = sales_df.loc[sales_df['Product'] == prod, 'Revenue'].sum()
prod_mean = round(sales_df.loc[sales_df['Product'] == prod, 'Revenue'].mean(), 2)
prod_median = round(sales_df.loc[sales_df['Product'] == prod, 'Revenue'].median(), 2)
prod_std = round(sales_df.loc[sales_df['Product'] == prod, 'Revenue'].std(), 2)
print(prod_quantity, prod_revenue, prod_mean, prod_median, prod_std, sep='\n')

1090
5655.76
57.13
60.67
30.16

In [278]:
sales_df_desc = sales_df[sales_df['Product'] == prod]
print(sales_df_desc['QuantitySold'].sum() , *sales_df_desc['Revenue'].agg(['sum', 'mean', 'median', 'std']).round(2), sep='\n')

1090
5655.76
57.13
60.67
30.16

In [279]:
np.random.seed(7)
random.seed(7)
# Функция для генерации случайных дат
def random_dates(start, end, n=1):
    start_u = start.value // 10 ** 9
    end_u = end.value // 10 ** 9
    return pd.to_datetime(np.random.randint(start_u, end_u, n), unit="s")

# Создаем список имен сотрудников технической поддержки
tech_support = ["John", "Jane", "Peter", "Jessica", "Tom"]
# Задаем количество записей (симуляция ответов техподдержки за месяц)
n_records = 1000
# Генерируем данные с помощью списковых включений
data = {
    "Date": random_dates(pd.Timestamp("2021-01-01"), pd.Timestamp("2022-09-30"), n_records),
    "TimeTaken": [random.randint(1, 60) for _ in range(n_records)],
    "Employee": [random.choice(tech_support) for _ in range(n_records)],
    "ClientID": [random.randint(1, 100) for _ in range(n_records)],
}
# Создаем DataFrame
support_df = pd.DataFrame(data)
# Округляем значения TimeTaken до двух знаков после запятой
support_df["TimeTaken"] = support_df["TimeTaken"].round(2)
support_df.head()

                 Date  TimeTaken Employee  ClientID
0 2022-03-03 23:09:56         21  Jessica        19
1 2021-11-18 17:40:06         10     John        33
2 2021-02-15 04:44:51         26     Jane        78
3 2022-04-16 21:36:19         42     John        95
4 2021-08-23 09:25:43          4  Jessica        52

In [280]:
mn1 = round(support_df['TimeTaken'].mean(), 2)
median1 = round(support_df['TimeTaken'].median(), 2)
print(f'среднее: {mn1}, медианное: {median1}')

среднее: 29.46, медианное: 30.0

In [281]:
support_df_maxDate = support_df[support_df['Date'].dt.to_period('M') == support_df['Date'].dt.to_period('M').max()]
support_df_maxDate.head()

                  Date  TimeTaken Employee  ClientID
31 2022-09-18 13:01:43         38  Jessica        34
36 2022-09-20 19:34:24          4     John        32
49 2022-09-27 11:08:32         36      Tom        67
77 2022-09-14 17:42:19         24     John         3
81 2022-09-05 10:19:53         12     Jane        44

In [282]:
mn2 = round(support_df_maxDate['TimeTaken'].mean(), 2)
median2 = round(support_df_maxDate['TimeTaken'].median(), 2)
print(f'среднее: {mn2}, медианное: {median2}')

среднее: 27.96, медианное: 31.0

In [283]:
z = "print(f'среднее: {round(support_df.TimeTaken.mean(), 2)}, медианное: {round(support_df.TimeTaken.median(), 2)}')"
exec(z)
support_df = support_df[support_df['Date'] >= pd.Timestamp(str(support_df['Date'].max())[:7])]
print(support_df.head())
exec(z)

среднее: 29.46, медианное: 30.0
                  Date  TimeTaken Employee  ClientID
31 2022-09-18 13:01:43         38  Jessica        34
36 2022-09-20 19:34:24          4     John        32
49 2022-09-27 11:08:32         36      Tom        67
77 2022-09-14 17:42:19         24     John         3
81 2022-09-05 10:19:53         12     Jane        44
среднее: 27.96, медианное: 31.0

In [284]:
random.seed(77)
# Создаем список должностей
positions = ["Manager", "Data Analyst", "Software Developer", "Graphic Designer", "Sales Representative"]
# Задаем количество сотрудников
n_employees = 100
# Генерируем данные с помощью списковых включений
data = {
    "Surname": [f"Surname_{i}" for i in range(n_employees)],
    "Name": [f"Name_{i}" for i in range(n_employees)],
    "Position": [random.choice(positions) for _ in range(n_employees)],
    "Salary": [random.uniform(15000, 100000) for _ in range(n_employees)],
}
# Создаем DataFrame
company_df = pd.DataFrame(data)
# Округляем значения Salary до двух знаков после запятой
company_df["Salary"] = company_df["Salary"].round(2)
company_df.head()

     Surname    Name            Position    Salary
0  Surname_0  Name_0  Software Developer  35392.00
1  Surname_1  Name_1  Software Developer  71657.36
2  Surname_2  Name_2        Data Analyst  54632.51
3  Surname_3  Name_3        Data Analyst  88444.81
4  Surname_4  Name_4        Data Analyst  97829.05

In [285]:
import math
med = round(company_df['Salary'].median(), 2)
print(med)
per = math.floor(company_df.loc[company_df['Salary'] > 40000, 'Surname'].count() / len(company_df) * 100)
print(per)
quant_75 =  round(company_df['Salary'].quantile(0.75), 2)
print(quant_75)
topSalary_position = company_df.loc[company_df['Salary'].idxmax(), 'Position']
print(topSalary_position)

64143.38
72
80943.0
Manager

In [286]:
np.random.seed(3)

# генерация данных
experience = np.random.randint(0, 10, 100)
education = np.random.choice(['высшее', 'среднее специальное', 'незаконченное высшее'], size = 100)
salary = np.random.normal(50000, 10000, size = 100)

data = pd.DataFrame({'experience': experience, 'education': education, 'salary': salary})
data

    experience             education        salary
0            8   среднее специальное  54844.418275
1            9   среднее специальное  41502.878417
2            3  незаконченное высшее  54932.782263
3            8                высшее  57414.189869
4            8   среднее специальное  63458.075221
..         ...                   ...           ...
95           0   среднее специальное  47884.098310
96           8                высшее  50213.960145
97           2   среднее специальное  39861.074909
98           7                высшее  42843.087180
99           2   среднее специальное  41931.588120

[100 rows x 3 columns]

In [287]:
z = "print(f'{i}: средняя - {mean}, медианная - {median}, СКО - {std}')"
education_list = sorted(data['education'].unique())
for i in education_list:
    mean = round(data.loc[data['education'] == i, 'salary'].mean(), 2)
    median = round(data.loc[data['education'] == i, 'salary'].median(), 2)
    std = round(data.loc[data['education'] == i, 'salary'].std(), 2)
    exec(z)

высшее: средняя - 49544.92, медианная - 49734.71, СКО - 8984.97
незаконченное высшее: средняя - 52839.19, медианная - 49213.34, СКО - 10415.43
среднее специальное: средняя - 47412.26, медианная - 47884.1, СКО - 9311.41

In [288]:
g = data.groupby('education').agg(['mean', 'median', 'std']).round(2).iloc[:, 3:].reset_index()
for e, mean, median, std in g.values:
    print(f"{e}: средняя - {mean}, медианная - {median}, СКО - {std}")

высшее: средняя - 49544.92, медианная - 49734.71, СКО - 8984.97
незаконченное высшее: средняя - 52839.19, медианная - 49213.34, СКО - 10415.43
среднее специальное: средняя - 47412.26, медианная - 47884.1, СКО - 9311.41

# 4.8.1 Корреляция и ковариация в Pandas

In [289]:
# Ковариация - это мера статистической зависимости между двумя случайными переменными. 
# Она позволяет определить, как одна переменная изменяется вместе с другой. 
# Если две переменные имеют положительную ковариацию, то они склонны изменяться в одном направлении 
# (если одна переменная увеличивается, то и другая тоже увеличивается), 
# а если у них отрицательная ковариация, то они склонны изменяться в противоположных направлениях 
# (если одна переменная увеличивается, то другая уменьшается). 
# Причем чем больше ковариация, тем больше взаимосвязь двух переменных.

In [290]:
data = {'X': [1, 2, 3, 4, 5],
        'Y': [5, 4, 3, 2, 1]}

df = pd.DataFrame(data)
print(df)

# Ковариация
covariance = df['X'].cov(df['Y'])
print(f'Ковариация: {covariance}')

# Матрица ковариации
cov_matrix = df.cov()
print(cov_matrix)

   X  Y
0  1  5
1  2  4
2  3  3
3  4  2
4  5  1
Ковариация: -2.5
     X    Y
X  2.5 -2.5
Y -2.5  2.5

In [291]:
# Коэффициент корреляции нормирует ковариацию и находится в диапазоне от -1 до 1, где 
# -1 указывает на полную отрицательную линейную зависимость, 
# 1 - на положительную линейную зависимость, а 
# 0 - на отсутствие линейной зависимости.

In [292]:
data = {'X': [1, 2, 3, 4, 5],
        'Y': [2, 4, 6, 8, 10]}
df = pd.DataFrame(data)
print(df)

# Вычисляем корреляцию Пирсона между столбцами 'X' и 'Y'
correlation = df['X'].corr(df['Y'])
print("Корреляция Пирсона X-Y:", correlation)

   X   Y
0  1   2
1  2   4
2  3   6
3  4   8
4  5  10
Корреляция Пирсона X-Y: 0.9999999999999999

In [293]:
# Создаем DataFrame с двумя столбцами
data = {'X': np.random.randint(1, 10, 10),
        'Y': np.random.randint(1, 10, 10)}
df = pd.DataFrame(data)
print(df)
correlation = df['X'].corr(df['Y'])
print("Корреляция Пирсона:", correlation)
correlation_matrix = df.corr()
print(correlation_matrix)

   X  Y
0  6  2
1  7  6
2  5  2
3  7  9
4  4  4
5  1  1
6  7  2
7  4  5
8  2  9
9  5  6
Корреляция Пирсона: 0.09453857926241849
          X         Y
X  1.000000  0.094539
Y  0.094539  1.000000

# 4.8.2 Членство и уникальные значения в Pandas (Методы isin(), unique(), value_counts())

In [294]:
data = {'Страна': ['Россия', 'США', 'Германия', 'Франция', 'Италия'],
        'Столица': ['Москва', 'Вашингтон', 'Берлин', 'Париж', 'Рим'],
        'Население': [144.5, 328.2, 83.0, 66.9, 60.4]}

df = pd.DataFrame(data)
df

     Страна    Столица  Население
0    Россия     Москва      144.5
1       США  Вашингтон      328.2
2  Германия     Берлин       83.0
3   Франция      Париж       66.9
4    Италия        Рим       60.4

In [295]:
countries = ['Россия', 'Германия']

df['Страна'].isin(countries)

0     True
1    False
2     True
3    False
4    False
Name: Страна, dtype: bool

In [296]:
filtered_df = df[df['Страна'].isin(countries)]
filtered_df

     Страна Столица  Население
0    Россия  Москва      144.5
2  Германия  Берлин       83.0

In [297]:
filtered_df = df[~df['Страна'].isin(countries)]
filtered_df

    Страна    Столица  Население
1      США  Вашингтон      328.2
3  Франция      Париж       66.9
4   Италия        Рим       60.4

In [298]:
unique_countries = df['Страна'].unique()
unique_countries

array(['Россия', 'США', 'Германия', 'Франция', 'Италия'], dtype=object)

In [299]:
filtered_df = df[df['Страна'].isin(unique_countries)]
filtered_df

     Страна    Столица  Население
0    Россия     Москва      144.5
1       США  Вашингтон      328.2
2  Германия     Берлин       83.0
3   Франция      Париж       66.9
4    Италия        Рим       60.4

In [300]:
country_counts = df['Страна'].value_counts()
country_counts

Страна
Россия      1
США         1
Германия    1
Франция     1
Италия      1
Name: count, dtype: int64

In [301]:
df

     Страна    Столица  Население
0    Россия     Москва      144.5
1       США  Вашингтон      328.2
2  Германия     Берлин       83.0
3   Франция      Париж       66.9
4    Италия        Рим       60.4

In [302]:
counts = df.apply(lambda x: ','.join(x.astype(str)), axis=1).value_counts().sort_index()
print(counts)

Германия,Берлин,83.0    1
Италия,Рим,60.4         1
Россия,Москва,144.5     1
США,Вашингтон,328.2     1
Франция,Париж,66.9      1
Name: count, dtype: int64

In [303]:
random.seed(9)
# Создаем DataFrame со случайными данными о продажах (продукт и количество)
data = {'Product': [random.choice(['Milk', 'Bread', 'Eggs', 'Cheese', 'Yogurt']) for _ in range(100)],
        'Quantity': [random.randint(1, 100) for _ in range(100)]}
df = pd.DataFrame(data)
df.head()

  Product  Quantity
0  Cheese       100
1  Yogurt        89
2    Eggs        12
3    Eggs        45
4   Bread        15

In [304]:
s = ['Bread', 'Eggs']

df['bool'] = df['Product'].isin(s)
df.head(7)

  Product  Quantity   bool
0  Cheese       100  False
1  Yogurt        89  False
2    Eggs        12   True
3    Eggs        45   True
4   Bread        15   True
5   Bread        75   True
6    Milk        47  False

In [305]:
np.random.seed(9)
# Сгенерируем название моделей автомобилей случайным образом
car_models = ['Toyota Corolla', 'Honda Civic', 'Ford Mustang', 'Chevrolet Camaro',
              'Mazda CX-5', 'Subaru Outback', 'Audi A4', 'BMW X1', 'Mercedes-Benz C-Class']
np.random.shuffle(car_models)

# Генерируем 1000 случайных продаж
sales_dates = pd.date_range(start='2021-01-01', end='2021-12-31', periods=1000)
df = pd.DataFrame({
    'model': np.random.choice(car_models, size=1000, replace=True),
    'price': np.round(np.random.normal(30000, 10000, size=1000), -2),
    'year': np.random.randint(low=2010, high=2022, size=1000),
    'mileage': np.round(np.random.normal(50000, 20000, size=1000), -2),
    'color': np.random.choice(['Red', 'Blue', 'Black', 'White', 'Silver'], size=1000, replace=True),
    'date': sales_dates,
    'location': np.random.choice(['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami'], size=1000)
})
df.head()

,model,price,year,mileage,color,date,location
0,Subaru Outback,33100.0,2010,65600.0,Red,2021-01-01 00:00:00.000000000,New York
1,Mazda CX-5,39300.0,2021,35500.0,Silver,2021-01-01 08:44:41.081081081,Miami
2,Subaru Outback,36200.0,2011,18300.0,Blue,2021-01-01 17:29:22.162162162,New York
3,Chevrolet Camaro,34200.0,2016,46900.0,Silver,2021-01-02 02:14:03.243243243,Chicago
4,Mazda CX-5,27800.0,2014,82100.0,White,2021-01-02 10:58:44.324324324,Chicago

In [306]:
s = df['model'].value_counts()
s = s.sort_values()

print(s)
print(sorted(df['model'].unique()))
print(s.idxmax())

model
Chevrolet Camaro          93
Subaru Outback           101
Honda Civic              107
Toyota Corolla           108
Mercedes-Benz C-Class    114
BMW X1                   117
Mazda CX-5               118
Audi A4                  120
Ford Mustang             122
Name: count, dtype: int64
['Audi A4', 'BMW X1', 'Chevrolet Camaro', 'Ford Mustang', 'Honda Civic', 'Mazda CX-5', 'Mercedes-Benz C-Class', 'Subaru Outback', 'Toyota Corolla']
Ford Mustang

# 5.1.1 Основы работы с функцией read_csv()

In [307]:
# df = pd.read_csv('data.csv')
# Параметры:
# header - определение заголовка (infer - по умолчанию, None, число)
# sep - разделитель столбцов
# encoding - указание кодировки, используемой при чтении файла CSV (utf-8, latin-1, utf-16, cp1252)
# names - используется для явного указания имен столбцов (df = pd.read_csv('data.csv', names=['Имя', 'Возраст', 'Город']))
# index_col - используется для указания столбца, который следует использовать в качестве индекса (индекс, название столбца, список столбцов)
# skiprows - используется для пропуска определенного числа строк при чтении файла CSV (kiprows=3, skiprows=[0, 2])
# skipfooter - используется для пропуска определенного числа строк в конце файла CSV при чтении
# na_values - используется для указания значений, которые следует рассматривать как пропущенные данные (NA, NaN, null) при чтении файла CSV 
# (строка - na_values='NA' или na_values='NA, --, NULL'; список - na_values=['NA', '--', 'NULL']; na_values={'column1': ['NA', '--'], 'column2': ['NULL']})

# 5.1.2 Парсинг дат с помощью функции read_csv()

In [308]:
# parse_dates - для парсинга даты

# df = pd.read_csv("file.csv", parse_dates=["date"])

# df = pd.read_csv("file.csv", parse_dates=["date", "time"])

# df = pd.read_csv("file.csv", parse_dates=["date"], 
#      date_parser=lambda x: datetime.strptime(x, '%Y-%m-%d-%H-%M-%S'))

# pd.to_datetime(arg[, format[, errors[, dayfirst[, yearfirst[, utc,box,unit, origin]]]]])

In [309]:
# def custom_date_parser(date_str): 
#     return datetime.strptime(date_str, '%d-%m-%Y') 
# df = pd.read_csv('data.csv', parse_dates=['date'],date_parser=custom_date_parser)

In [310]:
from datetime import datetime

In [311]:
# Преобразование строки '12-01-2021' в объект datetime
date_str = '12-01-2021'
date_obj = datetime.strptime(date_str, '%d-%m-%Y')
print(date_obj)

2021-01-12 00:00:00

In [312]:
# Преобразование строки '09:45:00' в объект datetime
time_str = '09:45:00'
time_obj = datetime.strptime(time_str, '%H:%M:%S')
print(time_obj)

1900-01-01 09:45:00

In [313]:
df = pd.DataFrame({"date": ["2020/01/01", "2020/01/02", "2020/01/03"]})
df["date"] = pd.to_datetime(df["date"])
print(df)

        date
0 2020-01-01
1 2020-01-02
2 2020-01-03

In [314]:
df = pd.DataFrame({'Дата': ['10d11m2020', '11d12m2020']})
df

         Дата
0  10d11m2020
1  11d12m2020

In [315]:
df_date = df.copy()
df_date['Дата'] = df_date['Дата'].apply(lambda x: f'{x[-4:]}-{x[3:5]}-{x[0:2]}')
df_date['Дата'] = pd.to_datetime(df_date['Дата'])
df_date

        Дата
0 2020-11-10
1 2020-12-11

In [316]:
df_date = df.copy()
df_date['Дата'] = pd.to_datetime(df_date['Дата'],format='%dd%mm%Y')
df_date

        Дата
0 2020-11-10
1 2020-12-11

In [317]:
# df = pd.read_csv('data.csv', sep='|', parse_dates=['Дата'], date_parser = lambda x: datetime.strptime(x, '%dd%mm%Y'))

In [318]:
# df = pd.read_csv('data.csv', names=['Name', 'Дата1', 'Дата2', 'Age', 'Salary'], header=0)

# df['Дата1'] = pd.to_datetime(df['Дата1'], format='%d/%m/%Y %H:%M')
# df['Дата2'] = pd.to_datetime(df['Дата2'], format='%d-%m-%Y')

# df = df.reindex(columns=['Дата1', 'Дата2', 'Name', 'Age', 'Salary'])

# print(df.loc[int(input())])

# 5.2 Файлы csv чтение, запись

In [319]:
# Параметры метода pd.read_csv():

# chunksize - чтение (и обработка по необходимости) по частям

# filename = "large_file.csv" 

# chunksize = 1000 # Задаем размер части (куска) 

# # Считываем куски данных из файла 
# chunks = pd.read_csv(filename, chunksize=chunksize) 

# # Обрабатываем каждый кусок 
# for chunk in chunks: 
#     # Здесь можно выполнять любые операции обработки данных 

# print(chunk.head())

In [320]:
# Оптимизация использования памяти

# Явное указания типа данных в столбцах при чтении файла
# pd.read_csv("large_file.csv", dtype={"category_column": "category", "nullable_column": "Int64"})

# pd.read_csv("large_file.csv", dtype={'Name': str, 'Age': int, 'Height': float, 'Weight': float})

In [321]:
# Запись данных в файл с помощью функции to_csv()

# - path_or_buf: путь к сохраняемому файлу или файлоподобному объекту (file-like), если хотите сохранять данные в буфер памяти
# - sep: разделитель для значений в CSV-файле. По умолчанию ','.
# - header: указывает выводить ли заголовки колонок DataFrame в файл CSV. 
# Если True, заголовок будет выведен. Если False, заголовок не будет выведен. 
# Если передана последовательность строк, то он будет использован в качестве заголовков столбцов вместо отображения названий столбцов DataFrame. По умолчанию True.
# - index: указывает выводить ли индексы в файл CSV. Если True, индексы будут выведены. Если False, индексы не будут выведены. По умолчанию True.
# - mode: режим записи файла, поддерживаемые значения - 'w' (замена), 'a' (дозапись), 'x' (запись в новый файл). По умолчанию 'w'.
# - encoding: кодировка выходного файла. По умолчанию 'utf-8'.
# - line_terminator: строка завершения записи. По умолчанию, как на вашей системе '\n'.
# - date_format: формат даты и времени для записи, например, '%Y-%m-%d' для год-месяц-день. Если не указан, будут использоваться настройки базы данных и UTC для преобразования дат и времени.
# - compression: Этот параметр позволяет выбрать тип сжатия, например, 'gzip' или 'bz2'.

In [322]:
# Создаем DataFrame 
data = { 'Name': ['Alice', 'Bob', 'Carol'], 'Age': [30, 25, 40], 
         'Height': [155.2, 175.5, 163.8], 'Weight': [60.5, 80.2, 65.7] } 
df = pd.DataFrame(data) 
# Сохраняем DataFrame в файл CSV 
df.to_csv('data\my_data.csv', index=False)

In [323]:
# Сохранить DataFrame вместо файла (сохранение в буфер для дальнейшего использования)

import io 
# Создаем DataFrame 
data = {'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]} 
df = pd.DataFrame(data) 
# Сохраняем DataFrame в буфер памяти 
buffer = io.StringIO() 
df.to_csv(buffer, index=False) 
# Выводим содержимое буфера памяти в консоль 
print(type(buffer))
print(buffer.getvalue())

<class '_io.StringIO'>
a,b,c
1,4,7
2,5,8
3,6,9

# 5.3 Функция pandas.read_table и pandas.read_json

In [324]:
# pd.read_table - позволяет читать данные из различных форматов файлов. 
# Она может работать с текстовыми файлами CSV, TSV, TXT, а также с файлами Excel, JSON, HTML и другими.

# Параметры:

# - filepath_or_buffer: путь к файлу или объекту, содержащему данные для чтения. Этот параметр обязателен.
# - sep: разделитель столбцов в файле. По умолчанию это ‘\t’ - символ табуляции.
# - delimiter: аналогичен предыдущему параметру.
# - header: номер строки, содержащей имена столбцов. Если не задан, то имена автоматически будут сгенерированы.
# - index_col: номер столбца, который будет использован в качестве индекса таблицы. Если не задан, то индекс будет сгенерирован автоматически.
# - usecols: список столбцов, которые нужно загрузить в таблицу. Если не задан, то загружаются все столбцы.
# - dtype: словарь, указывающий тип данных для каждого столбца. Если не задан, то pandas попытается определить типы данных автоматически.
# - na_values: список значений, которые следует считать отсутствующими в данных.
# - parse_dates: список столбцов, содержащих даты, которые должны быть преобразованы в тип данных pandas datetime.
# - skiprows: количество строк, которые нужно пропустить в начале файла.
# - nrows: количество строк, которые нужно загрузить из файла.

In [325]:
# pd.read_json() - загрузка данных из JSON файлов

# JSON (JavaScript Object Notation) - формат обмена данными, основанный на JavaScript. 
# Он представляет собой легкий, текстовый формат, который используется для хранения и передачи данных между клиентом и сервером. 
# Файлы в формате JSON имеют расширение - .json

# Параметры:

# - path_or_buf: имя файла или фалоподобного объекта (например URL-адрес файла из сети Интернет), из которого нужно загрузить данные.
# - orient: определяет ориентацию таблицы (Указывает ожидаемый формата строки JSON). 
# Возможные значения, например: 'split', 'records', 'index', 'columns', 'values'. По умолчанию ориентация определяется автоматически.
# - typ: определяет тип объекта, который нужно создать. Может принимать значения: 'frame', 'series'.
# - convert_dates: определяет нужно ли конвертировать значения в формат datetime.
# и многие другие (см. страницу официальной документации).

In [326]:
# Использование параметра orient:

# orient='columns' - каждый ключ верхнего уровня в JSON-файле соответствует столбцу в DataFrame, а значения - это данные в соответствующих столбцах
# orient='index' - каждый ключ верхнего уровня в JSON-файле соответствует индексу в DataFrame, а значения - это данные в соответствующих строках
# orient='records' - каждый объект в JSON-файле представляет собой отдельную запись (строку) в DataFrame
# orient='values' - содержит только значения данных без ключей или индексов
# orient='split' - данные разделены на отдельные части ({"columns":["col 1","col 2"],"index":["row 1","row 2"],"data":[["a","b"],["c","d"]]})

In [327]:
url = 'https://raw.githubusercontent.com/mledoze/countries/master/countries.json'

df = pd.read_json(url)

print(*df.columns[[1, 2, 3, 5, 8, 4]])

tld cca2 ccn3 cioc unMember cca3

# 5.4 Парсинг табличных данных из html и xml

In [328]:
# read_html()
# Исользуется для загрузки данных таблиц из HTML-файлов, HTML-страниц или HTML-кода и преобразования их в объекты DataFrame.
# Функция read_html() использует парсеры HTML (такие как lxml или beautifulsoup4), чтобы анализировать HTML-код и находить таблицы.

In [329]:
# Внутри read_html() происходит следующий процесс:

# Функция получает HTML-код из указанного источника (файл, URL или HTML-строка).
# Используя выбранный парсер (по умолчанию это lxml), read_html() анализирует HTML-код и создает объекты, представляющие структуру документа.
# Затем read_html() применяет соответствующие правила и эвристики для определения, какие части HTML-кода считать таблицами.
# Функция ищет теги <table> в HTML-коде и анализирует их содержимое, чтобы создать объекты DataFrame, представляющие таблицы.
# Если в HTML-коде присутствует несколько таблиц, read_html() возвращает список объектов DataFrame, каждый из которых соответствует одной таблице.

In [330]:
# pandas.read_html(io, match='.+', flavor=None, header=None, 
# index_col=None, skiprows=None, attrs=None, parse_dates=False, 
# thousands=',', encoding=None, decimal='.', converters=None, 
# na_values=None, keep_default_na=True, displayed_only=True)

# Параметры:

# io: Обязательный параметр. Может быть путем к HTML-файлу, URL-адресом или объектом, содержащим HTML-код.
# match: По умолчанию ".+". Определяет регулярное выражение для поиска таблиц в HTML-коде. По умолчанию найдутся все таблицы.
# flavor: По умолчанию None. Указывает на используемую библиотеку для парсинга HTML. Допустимые значения: 'bs4' (BeautifulSoup 4) и 'lxml'.
# header: По умолчанию None. Указывает номер строки для использования в качестве заголовков столбцов. Если не указано, заголовки будут автоматически определены.
# index_col: По умолчанию None. Указывает номер столбца для использования в качестве индекса строк. Если не указано, индексы строк будут автоматически определены.
# skiprows: По умолчанию None. Указывает номера строк для пропуска при загрузке таблицы.
# attrs: По умолчанию None. Список атрибутов HTML-тега для использования в качестве фильтра при поиске таблиц.
# parse_dates: По умолчанию False. Указывает, нужно ли парсить значения столбцов как даты.
# thousands: По умолчанию ','. Определяет разделитель тысячных.
# encoding: По умолчанию None. Указывает кодировку файла.
# decimal: По умолчанию '.'. Определяет символ десятичного разделителя.
# converters: По умолчанию None. Словарь, который определяет пользовательские функции преобразования для столбцов.
# na_values: По умолчанию None. Список значений, которые должны быть распознаны как пропущенные значения.
# keep_default_na: По умолчанию True. Определяет, должны ли использоваться значения по умолчанию для распознавания пропущенных значений.
# displayed_only: По умолчанию True. Указывает, следует ли извлекать только видимые данные таблицы.

In [331]:
# Некоторые из популярных парсеров HTML в языке программирования Python:

# lxml: Это быстрый и гибкий парсер, основанный на библиотеке C для обработки XML и HTML. 
# Он предоставляет API для поиска и извлечения данных из HTML-кода, а также для внесения изменений в структуру документа. 
# Библиотека lxml широко используется в Python для парсинга HTML-кода.

# Beautiful Soup: Это библиотека Python, предназначенная для извлечения данных из HTML и XML. 
# Она предоставляет простой и интуитивно понятный API, который позволяет выполнять поиск и манипулирование элементами HTML-кода. 
# Beautiful Soup поддерживает разные парсеры, включая lxml, html.parser, html5lib и другие.

# html.parser: Это встроенный в стандартную библиотеку Python парсер HTML. 
# Он реализован на языке Python и обеспечивает базовые функции для анализа и обработки HTML-кода. 
# В отличие от некоторых других парсеров, html.parser не требует дополнительной установки.

In [332]:
# Загрузка данных из локального HTML-файла:

# table_data = pd.read_html('путь_к_файлу.html')
# data_frame = table_data[0]
# print(data_frame.head())

In [333]:
# Загрузка данных из HTML-страницы по URL-адресу:

# url = 'https://www.example.com/table.html'
# table_data = pd.read_html(url)
# data_frame = table_data[0]
# print(data_frame.head())

In [334]:
# Загрузка данных с использованием фильтра атрибутов HTML-тега:

# url = 'https://www.example.com/table.html'
# table_data = pd.read_html(url, attrs={'class': 'table-class'})
# data_frame = table_data[0]
# print(data_frame.head())

In [335]:
# Загрузка данных с парсингом дат и пользовательскими функциями преобразования:

# table_data = pd.read_html('путь_к_файлу.html', parse_dates=True, converters={'column_name': pd.to_numeric})
# data_frame = table_data[0]
# print(data_frame.head())

In [336]:
df = pd.read_html('data\data.html', encoding='utf-8')
df1 = df[0]
df1.head()

     Имя  Возраст            Город
0   Анна       25           Москва
1   Иван       30  Санкт-Петербург
2  Мария       35             Киев
3   Анна       25           Москва
4   Иван       30  Санкт-Петербург

In [337]:
df1['Возраст'].sum()

900

In [338]:
df = pd.read_html('data\data2.html', attrs={'class': 'table2'}, encoding='utf-8')

df = df[0]
df

c:\Users\kuche\anaconda3\Lib\site-packages\bs4\__init__.py:228: UserWarning: You provided Unicode markup but also provided a value for from_encoding. Your from_encoding will be ignored.
  warnings.warn("You provided Unicode markup but also provided a value for from_encoding. Your from_encoding will be ignored.")

     Продукт  Количество  Цена
0     Яблоки          10   2.5
1     Бананы          15   1.8
2  Апельсины          20   3.2

In [339]:
int(df.prod(axis=1, numeric_only=True).sum())

116

In [340]:
url = 'https://databank.worldbank.org/id/918b8899?Report_Name=SDGs'

df = pd.read_html(io=url, 
                  attrs={'id': 'grdTableView_DXMainTable'},
                  header=0,
                  index_col=0, 
                  na_values='..',
                  encoding='utf-8')
df_co = df[0]
df_co.head()

,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
Afghanistan,0.2,0.3,0.3,0.2,0.1,0.2,0.1,0.1,0.2,0.2,NaN,NaN
Albania,1.5,1.7,1.5,1.5,1.7,1.6,1.6,1.8,1.8,1.7,NaN,NaN
Algeria,3.2,3.3,3.6,3.6,3.8,3.9,3.8,3.8,3.9,4.0,NaN,NaN
American Samoa,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Andorra,6.2,5.9,5.9,5.9,5.8,6.0,6.1,6.1,6.4,6.5,NaN,NaN

In [341]:
df_co = df_co.loc[['Afghanistan',  'Argentina',  'Australia',  'China',  'Colombia']]
df_co

,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
Afghanistan,0.2,0.3,0.3,0.2,0.1,0.2,0.1,0.1,0.2,0.2,NaN,NaN
Argentina,4.1,4.3,4.3,4.3,4.2,4.3,4.2,4.1,4.0,3.7,NaN,NaN
Australia,17.6,17.3,17.0,16.4,15.8,15.9,15.9,15.8,15.5,15.2,NaN,NaN
China,6.3,6.9,7.0,7.3,7.3,7.1,7.1,7.2,7.5,7.6,NaN,NaN
Colombia,1.4,1.5,1.5,1.7,1.7,1.7,1.7,1.5,1.6,1.6,NaN,NaN

In [342]:
df_co.mean(axis=1, numeric_only=True).sum()

29.3

# 5.5 Файлы бинарных форматов в Pandas

In [343]:
# HDF5 (Hierarchical Data Format) - это высокоэффективный, гибкий и платформонезависимый двоичный формат для хранения научных данных. 
# Он хранит данные в иерархической структуре и использует сжатие данных для уменьшения размера файла.

# Pandas предоставляет функции read_hdf() и to_hdf() для чтения и записи данных в формате HDF5. Для работы с HDF5 вам необходимо установить библиотеку tables
# pip install tables

# Основная выгода использования HDF5 состоит в возможности хранить большие объемы данных, производить частичную загрузку и запись данных, 
# а также экономить место на диске благодаря сжатию данных. Этот формат подходит для работы с большими датафреймами и научными данными, 
# когда требуется гибкость и производительность в хранении и обработке данных.

In [344]:
# Чтение данных из файла HDF5 
# data = pd.read_hdf('data.h5', key='dataset_name') 

# Обработка данных 
# ...

# Запись результата обратно в файл HDF5 
# data.to_hdf('result.h5', key='new_dataset_name', mode='w')

# - key: строка, указывающая ключ (имя) датасета в файле HDF5, который нужно прочитать.

In [345]:
# Чтение данных из файла HDF5 с указанным диапазоном строк 
# subset_data = pd.read_hdf('data.h5', key='dataset_name', start=10, stop=30)

In [346]:
# Parquet - это эффективный двоичный формат для столбцовых данных, оптимизированный для больших объемов данных. 
# Он использует сжатие данных и предоставляет возможность чтения и записи отдельных столбцов без необходимости считывать весь файл. 
# Parquet часто используется с Apache Hadoop, Apache Spark и другими программными решениями для работы с большими данными.

# Pandas предоставляет функции read_parquet() и to_parquet() для чтения и записи данных в формате Parquet.

# Для работы с Parquet вам нужно установить библиотеку pyarrow или fastparquet:
# pip install pyarrow 
# # или 
# pip install fastparquet

In [347]:
# Чтение данных из файла Parquet 
# data = pd.read_parquet('data.parquet')
#  
# Обработка данных 
# ... 

# Запись результата обратно в файл Parquet 
# data.to_parquet('result.parquet', engine='auto')

# - engine: опциональный параметр, указывающий на движок, который будет использоваться для чтения данных. 
# По умолчанию auto, что означает, что Pandas будет выбирать движок автоматически. Другие варианты включают pyarrow и fastparquet.

In [348]:
# MessagePack - это компактный двоичный формат сериализации данных, который поддерживает большинство встроенных типов данных в Python 
# и подходит для обмена данными между разными языками программирования. Он считает эффективной альтернативой JSON для хранения 
# и передачи данных в двоичном формате. Pandas предлагает функции read_msgpack() и to_msgpack() для работы с данными в формате MessagePack.

# Для работы с MessagePack вам нужно установить библиотеку msgpack-python:
# pip install msgpack-python

In [349]:
# Чтение данных из файла MessagePack 
# data = pd.read_msgpack('data.msg') 

# Обработка данных 
# ... 

# Запись результата обратно в файл MessagePack 
# data.to_msgpack('result.msg')

# Примечание: использование msgpack с Pandas было объявлено устаревшим с версии 1.0, и в будущих версиях установка msgpack не будет возможна по умолчанию.

In [350]:
df = pd.read_hdf('data\data.hdf5')
df

   Column1 Column2
0        1       A
1        2       B
2        3       C
3        4       D

In [351]:
df.iloc[:,0].sum(axis=0)

10

# Чтение и запись файлов Microsoft Excel

In [352]:
# Для работы с файлами Excel в pandas необходимо установить следующие пакеты:
# - openpyxl (для работы с .xlsx файлами),
# - xlrd (для работы с .xls файлами).
# pip install pandas openpyxl xlrd

In [353]:
# Чтение файла Excel 
# file_path = "example.xlsx" 
# df = pd.read_excel(file_path) 

# Вывод прочитанных данных 
# print(df)

In [354]:
# Основные аргументы функции pd.read_excel():
# - io : путь к файлу (строка) или объект файла.
# - sheet_name: имя листа с данными или его порядковый номер (нумерация с нуля). Если не указать этот аргумент, pandas прочитает только первый лист. 
# Если задать значение None, то pandas прочитает все листы из файла и вернет словарь с датафреймами.
# - header: номер строки (или номера строк, если список), которые будут использованы как имена столбцов. Значение по умолчанию 0.
# - index_col: номер столбца (или номера столбцов, если список), который будет использован в качестве индекса строк. Значение по умолчанию None.
# - usecols: список (или строка) имен столбцов или номеров столбцов, которые будут загружены в датафрейм. Значение по умолчанию None (загрузятся все столбцы).

In [355]:
# file_path = "example.xlsx" 
# df = pd.read_excel(file_path, sheet_name="Sheet2", header=0, 
# index_col=0, usecols="A,B,D") 
# print(df)

In [356]:
# Создание DataFrame 
# data = {"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, 9]} 
# df = pd.DataFrame(data) 

# Сохранение DataFrame в файл Excel 
# file_name = "output.xlsx" 
# df.to_excel(file_name) 
# print("Data has been saved to:", file_name)

In [357]:
# Основные аргументы функции to_excel:
# - excel_writer: Строка с именем файла или объект типа ExcelWriter.
# - sheet_name: Имя листа, на который будет записан DataFrame. По умолчанию - 'Sheet1'.
# - na_rep: Строка, которая будет использоваться вместо NA/NaN. По умолчанию - пустая строка.
# - float_format: Формат для чисел с плавающей запятой. Например, "%.2f" для округления до двух знаков после запятой.
# - columns: Список столбцов, которые следует записать. Если не указано, будут записаны все столбцы.
# - header: Заголовки столбцов, которые должны быть сохранены (True) или строки, которые должны быть записаны вместо имен столбцов (список строк). Если не указано, сохраняются все заголовки.
# - index: Флаг, задающий сохранение (True, по умолчанию) или не сохранение (False) индекса строк.

In [358]:
# file_name = "output.xlsx" 
# df.to_excel(file_name, sheet_name="MyData", na_rep="N/A", float_format="%.2f", 
# columns=["A", "C"], header=True, index=False) 
# print("Data has been saved to:", file_name)

In [359]:
df = pd.read_excel('data\example.xlsx')
df

       Имя  Возраст            Город
0  Алексей       28           Москва
1    Елена       32  Санкт-Петербург
2   Михаил       45     Екатеринбург

In [360]:
df.loc[:,'Возраст'].sum()

105

In [361]:
df = pd.read_excel('data\linia.xlsx', usecols=['Наименование', 'Цена'])
df.head()

                          Наименование    Цена
0    Корейка свиная на кости со шкурой  189.99
1              Лопатка свиная с костью  189.99
2              Лопаточная часть свиная  259.99
3           Тазобедренная часть свиная  259.99
4  Тазобедренная часть свиная с костью  199.99

In [362]:
#  - для object в формате 'xx.xx':
# float(obj)
#  - для object в формате 'datetime.datetime(yyyy, m, d, h,m)':
# float(obj.day) + float(obj.month)/10**2

def convert_to_float(obj):
    try:
        return float(obj)
    except:
        return float(obj.day) + float(obj.month)/10**2

In [363]:
df['Цена'] = df['Цена'].apply(lambda x: convert_to_float(x))
df.head()

                          Наименование    Цена
0    Корейка свиная на кости со шкурой  189.99
1              Лопатка свиная с костью  189.99
2              Лопаточная часть свиная  259.99
3           Тазобедренная часть свиная  259.99
4  Тазобедренная часть свиная с костью  199.99

In [364]:
df['Цена'].min() + df['Цена'].max()

1800.09

In [365]:
df.loc[df['Цена'] == df['Цена'].min(), 'Наименование']

1013    Лапша быстрого приготовления яичная Кухня без ...
Name: Наименование, dtype: object

In [366]:
df[df['Цена'] == df['Цена'].min()]['Наименование'].values

array(['Лапша быстрого приготовления яичная Кухня без границ курица 60г'],
      dtype=object)

In [367]:
def convert_to_float(obj):
    try:
        return float(obj)
    except:
        return float(obj.day) + float(obj.month)/10**2

In [368]:
# Вычислите максимальную цену товара без учета скидки и цену на товар с максимальной скидкой без ее учета, 
# далее сложите полученные значения и получите округленный до двух знаков результат
df = pd.read_excel('data\linia.xlsx', usecols=['Наименование', 'Цена', 'Скидка'])
df['Цена'] = df['Цена'].apply(lambda x: convert_to_float(x))
df['Скидка'] = df['Скидка'].apply(lambda x: convert_to_float(x))

In [369]:
df['Цена без скидки'] = df['Цена'] + (df['Цена'] * df['Скидка']) / 100
df.head()

                          Наименование    Цена  Скидка  Цена без скидки
0    Корейка свиная на кости со шкурой  189.99    4.00       197.589600
1              Лопатка свиная с костью  189.99   17.04       222.364296
2              Лопаточная часть свиная  259.99    7.01       278.215299
3           Тазобедренная часть свиная  259.99    7.01       278.215299
4  Тазобедренная часть свиная с костью  199.99   20.00       239.988000

In [370]:
max_price = df['Цена без скидки'].max()
price_maxDiscount = df.loc[df['Скидка'].idxmax(), 'Цена без скидки']
print(f'максимальная цена товара без учета скидки: {max_price}\nцена на товар с максимальной скидкой без ее учета: {price_maxDiscount}')
print(round((max_price + price_maxDiscount) ,2))

максимальная цена товара без учета скидки: 2421.454
цена на товар с максимальной скидкой без ее учета: 145.92782999999997
2567.38

In [371]:
# Определите суммарную цену на товары (цену берите из колонки 'Цена') 
# в наименовании которых есть слово 'палочки' (в нижнем регистре), полученное значение, округленное до двух знаков после запятой
price_palochki_sum = df.loc[df['Наименование'].str.contains('палочки'), 'Цена'].sum()
print(price_palochki_sum.round(2))

224.97

In [372]:
mask = df['Наименование'].apply(lambda x: 'палочки' in x)
round(df[mask].sum()['Цена'], 2)

224.97

In [373]:
print(df[df['Наименование'].str.find('палочки') != -1]['Цена'].sum().round(2))

224.97

In [374]:
df = pd.read_excel('data\linia2.xlsx', sheet_name='X5', usecols=['Наименование', 'Цена' , 'Скидка',  'день окончания', 'цена за 1 кг/шт'])
df.head()

,Наименование,Цена,Скидка,день окончания,цена за 1 кг/шт
0,Конфеты Halls Mini Mints со вкусом мяты без са...,34.0,-0.45,23 января,2720.0
1,"Батончик неглазированный ""Bombbar"" Тирамису 60гр",109.0,-0.26,23 января,1816.6666666666667
2,"BOMBBAR Батончик неглазированный ""Малиновый чи...",109.0,-0.26,23 января,1816.6666666666667
3,Конфеты без сахара HALLS MINI MINTS Цитрусовый...,34.0,-0.45,23 января,6800.0
4,"Леденцы Бон Пари, Ассорти, фруктовые, 75 г",44.0,-0.34,8 февраля,586.6666666666666

In [375]:
price_mean, price_median = df['Цена'].agg(['mean', 'median'])
round((price_mean - price_median), 2)

37.17

In [376]:
df['Цена'].agg(['mean', 'median'])

mean      146.166667
median    109.000000
Name: Цена, dtype: float64

In [377]:
df_linia = pd.read_excel('data\linia2.xlsx', sheet_name='linia', usecols=['Наименование', 'Цена' , 'Скидка', 'Цена за кг'])
df_X5 = pd.read_excel('data\linia2.xlsx', sheet_name='X5', usecols=['Наименование', 'Цена' , 'Скидка', 'цена за 1 кг/шт'])

In [378]:
df_linia.head()

                          Наименование    Цена               Скидка Цена за кг
0    Корейка свиная на кости со шкурой  189.99                  4.0      190.0
1              Лопатка свиная с костью  189.99  2023-04-17 00:00:00      190.0
2              Лопаточная часть свиная  259.99  2023-01-07 00:00:00      260.0
3           Тазобедренная часть свиная  259.99  2023-01-07 00:00:00      260.0
4  Тазобедренная часть свиная с костью  199.99                 20.0      200.0

In [379]:
df_X5.head()

,Наименование,Цена,Скидка,цена за 1 кг/шт
0,Конфеты Halls Mini Mints со вкусом мяты без са...,34.0,-0.45,2720.0
1,"Батончик неглазированный ""Bombbar"" Тирамису 60гр",109.0,-0.26,1816.6666666666667
2,"BOMBBAR Батончик неглазированный ""Малиновый чи...",109.0,-0.26,1816.6666666666667
3,Конфеты без сахара HALLS MINI MINTS Цитрусовый...,34.0,-0.45,6800.0
4,"Леденцы Бон Пари, Ассорти, фруктовые, 75 г",44.0,-0.34,586.6666666666666

In [380]:
count_linia = df_linia[df_linia['Наименование'].str.contains('Масло')]['Наименование'].count()
count_X5 = df_X5[df_X5['Наименование'].str.contains('Масло')]['Наименование'].count()
print(f'в таблице linia: {count_linia},\nв таблице X5: {count_X5}')
print(count_linia+count_X5)

в таблице linia: 35,
в таблице X5: 9
44

# 5.7.1 Взаимодействие Pandas с базами данных

## Модуль SQLAlchemy в Pandas

In [381]:
# SQLAlchemy - это библиотека Python, которая предоставляет удобный и мощный способ взаимодействия с различными базами данных с использованием SQL. 
# Она представляет собой ORM (Object-Relational Mapping), и позволяет работать с базами данных в объектно-ориентированной парадигме.

## Установка соединения с базой данных

In [382]:
# Для соединения с базой данных вам необходимо будет установить соответствующий драйвер.
# Установка драйвера базы данных зависит от типа базы данных, с которой вы планируете работать. 
# Каждая база данных имеет свой собственный драйвер, и вам необходимо установить соответствующий драйвер, чтобы SQLAlchemy могла взаимодействовать с этой базой данных.
# Вот некоторые примеры установки драйверов для популярных баз данных:

# MySQL: Если вы планируете работать с базой данных MySQL, установите драйвер mysql-connector-python с помощью следующей команды:
# pip install mysql-connector-python

# PostgreSQL: Если вы планируете работать с базой данных PostgreSQL, установите драйвер psycopg2 с помощью следующей команды:
# pip install psycopg2

# SQLAlchemy Documentation — SQLAlchemy 2.0 Documentation https://docs.sqlalchemy.org/en/20/

In [383]:
# Установка соединения с базой данных

# Чтобы подключиться к базе данных, мы должны предоставить соединительную строку (connection string), 
# которая содержит информацию о хосте, порте, имени пользователя, пароле и имени базы данных (если требуется). 
# Формат соединительной строки зависит от типа базы данных, с которой мы работаем.

# Примеры соединительных строк для разных типов баз данных:

# MySQL:
# engine = 
# sqlalchemy.create_engine('mysql+mysqlconnector://user:password@host:port/database')

# PostgreSQL:
# engine = 
# sqlalchemy.create_engine('postgresql+psycopg2://user:password@host:port/database')

# После создания объекта engine мы можем использовать его для установления соединения с базой данных.
# connection = engine.connect()

# Теперь у нас есть активное соединение с базой данных, и мы можем выполнять запросы и читать данные из нее.

## Чтение данных из базы данных SQLite

In [384]:
# После установления соединения с базой данных можно к ней обращаться для считывания данных. Для этого существует ряд способов.

In [385]:
# Использование функции read_sql_query

# Одним из способов чтения данных из базы данных в Pandas является использование функции read_sql_query. 
# Эта функция позволяет выполнить произвольный SQL-запрос и получить результат в виде DataFrame.

In [386]:
# # Пример использования функции read_sql_query. Пусть у нас имеется база данных SQLite -  'example.db', в которой есть таблица 'employees':

# import pandas as pd
# import sqlite3

# # Установка соединения с базой данных SQLite
# conn = sqlite3.connect('example.db')

# # SQL-запрос
# query = "SELECT * FROM employees"

# # Чтение данных в DataFrame
# df = pd.read_sql_query(query, conn)

# # Закрытие соединения с базой данных
# conn.close()

# # Вывод DataFrame
# print(df)

In [387]:
# pd.read_sql_query(sql, con, params=None, index_col=None, coerce_float=True, parse_dates=None, chunksize=None)

# sql: SQL-запрос, который определяет данные, которые требуется извлечь из базы данных.
# con: Объект соединения с базой данных (например, созданный с помощью sqlite3.connect() или другими средствами).
# params (опционально): Параметры, которые могут быть переданы в SQL-запрос в качестве аргументов.
# index_col (опционально): Название столбца, который должен быть использован в качестве индекса (индекс столбцов DataFrame).
# coerce_float (по умолчанию True): Если True, значения чисел преобразуются в тип float.
# parse_dates (опционально): Столбцы, которые требуется распарсить как даты.
# chunksize (опционально): Размер блока (чанка) данных для чтения пакетами.

In [388]:
# Использование функции read_sql_table

# Функция pd.read_sql_table() позволяет прочитать данные из таблицы базы данных и вернуть результат в виде объекта DataFrame библиотеки Pandas. 
# Она предоставляет удобный способ чтения всей таблицы целиком и преобразования ее в структуру DataFrame. 
# Однако она не поддерживается стандартным модулем sqlite3, для ее использования необходимо подключать библиотеку sqlalchemy.

In [389]:
# Пример использования: Вот пример, демонстрирующий использование pd.read_sql_table() для чтения данных из таблицы базы данных SQLite:

# import pandas as pd
# from sqlalchemy import create_engine

# # Создание подключения к базе данных с использованием SQLAlchemy
# engine = create_engine("sqlite:///example.db")

# # Чтение таблицы в DataFrame
# table_name = "employees"
# df = pd.read_sql_table(table_name, engine)

# # Закрытие соединения с базой данных
# engine.dispose()

# # Вывод первых нескольких строк DataFrame
# print(df.head())

In [390]:
# python pd.read_sql_table( table_name, con, schema=None, index_col=None, coerce_float=True, parse_dates=None, columns=None, chunksize=None, ) 

# table_name: (строка) Имя таблицы в базе данных, которую вы хотите прочитать.
#  con: (объект SQLAlchemy engine или connection) Объект, представляющий соединение с базой данных. 
# Обычно это объект engine или connection, созданный с помощью функции create_engine() или метода engine.connect() из библиотеки SQLAlchemy.
# schema: (строка, опционально) Имя схемы в базе данных, из которой следует читать таблицу. 
# Не все СУБД поддерживают схемы, если схема не указана, будет использоваться схема по умолчанию.
# index_col: (строка или список строк, опционально) Один или несколько столбцов, которые будут использоваться в качестве индекса для полученного DataFrame. 
# Если не указано, будет создан индекс по умолчанию.
# coerce_float: (логический, опционально) Если True, все столбцы с типом данных FLOAT, которые не являются числами с плавающей запятой, 
# будут преобразованы в числа с плавающей запятой. По умолчанию True.
# parse_dates: (список, словарь или 'all', опционально) Столбцы для преобразования в тип данных datetime. 
# Может быть списком столбцов, словарем с {'col_name': format}, где 'format' - строка формата или специальное значение 'all' для обработки всех столбцов.
# columns: (список или подобный, опционально) Список столбцов для чтения из таблицы. Если не указано, будут прочитаны все столбцы.
# chunksize: (целое число, опционально) Если указано, возвращает объект итератора, который читает данные по chunksize строк за раз, а не сразу весь DataFrame. 
# Это полезно для обработки больших таблиц, когда необходимо снизить потребление памяти.

In [391]:
# Отличие между функциями pd.read_sql_table() и pd.read_sql_query() заключается в способе, которым они читают данные из базы данных.

In [392]:
# Функция pd.read_sql_table():

# Позволяет прочитать данные из всей таблицы целиком.
# Автоматически создает SQL-запрос для выборки всех столбцов из указанной таблицы.
# Удобна в использовании, когда требуется прочитать все данные из таблицы без необходимости создавать сложные SQL-запросы.

In [393]:
# Функция pd.read_sql_query():

# Позволяет выполнять произвольные SQL-запросы для извлечения данных из базы данных.
# Позволяет выбирать конкретные столбцы, применять фильтры, сортировку и другие операции, поддерживаемые SQL.
# Предоставляет более гибкий подход, когда требуется выполнить сложные SQL-запросы или получить только определенные данные из таблицы.

In [394]:
# Таким образом, основное отличие между pd.read_sql_table() и pd.read_sql_query() заключается в уровне абстракции. 
# pd.read_sql_table() предоставляет более простой и удобный способ чтения данных из таблицы целиком.

In [395]:
# Использование функции pd.read_sql()

# Функция pd.read_sql() является универсальным методом библиотеки Pandas для чтения данных из базы данных с помощью SQL-запроса. 
# Она предоставляет более гибкий и мощный подход, позволяя выполнять различные типы SQL-запросов и обрабатывать результаты.

In [396]:
# pd.read_sql(sql, con, index_col=None, coerce_float=True, params=None, parse_dates=None, columns=None, chunksize=None)

# sql: SQL-запрос, который определяет данные, которые требуется извлечь из базы данных.
# con: Объект соединения с базой данных (например, созданный с помощью sqlite3.connect() или другими средствами).
# index_col (опционально): Название столбца, который должен быть использован в качестве индекса (индекс столбцов DataFrame).
# coerce_float (по умолчанию True): Если True, значения чисел преобразуются в тип float.
# params (опционально): Параметры, которые могут быть переданы в SQL-запрос в качестве аргументов.
# parse_dates (опционально): Столбцы, которые требуется распарсить как даты.
# columns (опционально): Список столбцов, которые требуется прочитать из результатов запроса.
# chunksize (опционально): Размер блока (чанка) данных для чтения пакетами.

In [397]:
# Пример использования: Вот пример, демонстрирующий использование pd.read_sql() для выполнения SQL-запроса и чтения данных из базы данных SQLite:

# import sqlite3
# import pandas as pd

# # Создание соединения с базой данных
# conn = sqlite3.connect('example.db')

# # Выполнение SQL-запроса и чтение данных в DataFrame
# query = "SELECT * FROM employees WHERE age > 30"
# df = pd.read_sql(query, conn)

# # Закрытие соединения с базой данных
# conn.close()

# # Вывод первых нескольких строк DataFrame
# print(df.head())

In [398]:
# Сравнение функций чтения из базы данных SQLite

# Отличие функции pd.read_sql() от функций pd.read_sql_table() и pd.read_sql_query() заключается в способе, которым они читают данные из базы данных и вводят SQL-запросы.

# pd.read_sql_table():

# Читает данные из всей таблицы целиком.
# Автоматически создает SQL-запрос для выборки всех столбцов из указанной таблицы.
# Удобна в использовании, когда требуется прочитать все данные из таблицы без необходимости создавать сложные SQL-запросы.
# pd.read_sql_query():

# Позволяет выполнять произвольные SQL-запросы для извлечения данных из базы данных.
# Позволяет выбирать конкретные столбцы, применять фильтры, сортировку и другие операции, поддерживаемые SQL.
# Предоставляет более гибкий подход, когда требуется выполнить сложные SQL-запросы или получить только определенные данные из таблицы.
# pd.read_sql():

# Позволяет выполнить SQL-запрос и получить результаты в виде объекта DataFrame.
# Позволяет выполнять произвольные SQL-запросы и обрабатывать результаты.
# Обеспечивает более гибкий и мощный подход, чем pd.read_sql_table() и pd.read_sql_query().
# Может быть использован для чтения данных из таблицы целиком или для выполнения сложных запросов с фильтрацией, сортировкой, объединением таблиц и другими операциями.

# Выбор между этими функциями зависит от требований вашего проекта и типа операций, которые вам необходимо выполнить с данными из базы данных.
#  
# Если вам нужно прочитать данные из таблицы целиком, то pd.read_sql_table() может быть предпочтительным. 
# Если вам требуется выполнить произвольный SQL-запрос, выбрать определенные столбцы или применить фильтрацию, 
# то pd.read_sql_query() или pd.read_sql() предоставят большую гибкость и функциональность.

In [399]:
import sqlite3

conn = sqlite3.connect('data\example.db')

query = "SELECT * FROM employees"

df = pd.read_sql(query, conn)

conn.close()

df

   id          name  age department
0   1      John Doe   30         IT
1   2    Jane Smith   35         HR
2   3  Mark Johnson   28      Sales

In [400]:
df.loc[df['name'] == 'John Doe', 'department']

0    IT
Name: department, dtype: object

## Подключение к открытым базам данных онлайн с использованием API и библиотеки requests

In [401]:
# Для отправки запросов к онлайн базам данных через интернет можно использовать библиотеку Requests - это популярная библиотека Python, 
# используемая для отправки запросов HTTP. Она обеспечивает удобный и простой способ взаимодействия с веб-сервисами и API, 
# предоставляя поддержку различных HTTP-методов, обработку ошибок, загрузку файлов, аутентификацию, сеансы, куки и многое другое.

In [402]:
# Основные функции и возможности библиотеки Requests:

# 1. HTTP-методы: Библиотека поддерживает все основные методы HTTP, такие как GET, POST, PUT, DELETE, HEAD, OPTIONS и PATCH.
# 2. Обработка параметров URL: Requests позволяет удобно обрабатывать параметры URL и вставлять их в адресе запроса.
# 3. Аутентификация: Поддерживает различные механизмы аутентификации, такие как базовая аутентификация, аутентификация с использованием OAuth 1.0, OAuth 2.0 и т.д.
# 4. Таймауты и ошибки: Библиотека обеспечивает обработку сетевых ошибок и предоставляет таймауты для контроля над временем ожидания запроса.
# 5. cookies и сеансы: Requests поддерживает работу с cookies и управление сеансами, позволяя сохранять информацию о сеансах между различными запросами.
# 6. Загрузка файлов: Работа с множественными файлами и загрузка их на сервер с использованием многоразовой отправки формы.
# 7. Обработка ответов: Преобразование ответа сервера в текст, JSON или бинарные данные для дальнейшей обработки.
# 8. Настройка заголовков: Возможность добавления и изменения заголовков HTTP запроса.

# Пример использования библиотеки Requests Для начала установите библиотеку Requests, используя pip:

# pip install requests

In [403]:
import requests

url = 'https://jsonplaceholder.typicode.com/todos/1'
response = requests.get(url)

requests.get(url)

In [404]:
print(response.status_code)

# Код состояния HTTP - это трехзначное число, которое указывает результат запроса. 
# Например, код 200 означает успешный запрос, 
# 404 означает "страница не найдена",
# 500 - "внутренняя ошибка сервера".
# При создании и анализе HTTP-запросов информация о кодах состояния часто используется для определения успешности запроса или для обработки возможных ошибок.

200

In [405]:
json_data = response.json() 
print(json_data)

{'userId': 1, 'id': 1, 'title': 'delectus aut autem', 'completed': False}

## Подключение к открытым базам данным через API

In [406]:
# Для подключения к открытым базам данным требуется регистрация на сайте.  После регистрации можно будет получить API-ключ веб-сервиса, к которому хотите подключиться.

# Для примера возьмем сервис [Quandl](https://www.quandl.com/), который предоставляет финансовые и экономические данные.

# api_key = "your_api_key"

In [407]:
api_key = "eY7asi2Gm6DhHJcYTbzc"

url = "https://www.quandl.com/api/v3/datasets/WIKI/FB/data.json?api_key=" + api_key
response = requests.get(url)
response.status_code

410

In [408]:
# json_data = response.json()

In [409]:
# dataset = json_data['dataset_data'] 
# column_names = dataset['column_names'] 
# data = dataset['data'] 
# df = pd.DataFrame(data, columns=column_names)

In [410]:
# # Вывод первых 5 строк DataFrame 
# print(df.head()) 

# # Выбор определенных столбцов 
# df = df[['Date', 'Open', 'Close']] 

# # Фильтрация данных по дате 
# df = df[(df['Date'] >= '2017-01-01') & (df['Date'] <= '2017-12-31')]

# Решение задач по темам

1

In [411]:
# сгенерируем данные о продажах
# n = 3000
# np.random.seed(11)
# dates = pd.date_range('2020-01-01', periods=n)
# items = ['book', 'pen', 'phone', 'laptop', 'mouse']
# prices = np.random.randint(low=10, high=100, size=n)
# quantities = np.random.randint(low=1, high=10, size=n)
# sales = pd.DataFrame({'date': dates, 'item': np.random.choice(items, n),
#                       'price': prices, 'quantity': quantities})

# sales.to_csv('data/sales.csv', index=False)

In [412]:
df = pd.read_csv('data/sales.csv')
print(df.head(3))
print(df.tail(6))
print(df.columns)

         date    item  price  quantity
0  2020-01-01   mouse     35         5
1  2020-01-02  laptop     73         4
2  2020-01-03   phone     90         7
            date    item  price  quantity
2994  2028-03-13  laptop     16         6
2995  2028-03-14  laptop     72         4
2996  2028-03-15   mouse     76         1
2997  2028-03-16     pen     40         7
2998  2028-03-17   mouse     18         4
2999  2028-03-18  laptop     46         1
Index(['date', 'item', 'price', 'quantity'], dtype='object')

2

In [413]:
df = pd.read_csv('data/sales.csv')
df = df.rename(columns={'item': 'Название товара','price': 'Цена', 'quantity': 'Количество проданных единиц', 'date': 'Дата продажи'})
df['Сумма продажи'] = df['Цена'] * df['Количество проданных единиц']
df.drop('Количество проданных единиц', axis=1, inplace=True)
df.head()

  Дата продажи Название товара  Цена  Сумма продажи
0   2020-01-01           mouse    35            175
1   2020-01-02          laptop    73            292
2   2020-01-03           phone    90            630
3   2020-01-04           phone    91            819
4   2020-01-05           mouse    65            585

3

In [414]:
df = pd.read_csv('data/sales.csv')
df = df.reindex(['date', 'item',  'quantity', 'price'], axis=1)

In [415]:
df.iloc[[1200, 999, 12, 15]]

            date    item  quantity  price
1200  2023-04-15  laptop         9     75
999   2022-09-26     pen         4     77
12    2020-01-13   phone         5     42
15    2020-01-16    book         2     44

In [416]:
df.head(5)

         date    item  quantity  price
0  2020-01-01   mouse         5     35
1  2020-01-02  laptop         4     73
2  2020-01-03   phone         7     90
3  2020-01-04   phone         9     91
4  2020-01-05   mouse         9     65

In [417]:
df.index = range(13, len(df) + 13)
df.head()

          date    item  quantity  price
13  2020-01-01   mouse         5     35
14  2020-01-02  laptop         4     73
15  2020-01-03   phone         7     90
16  2020-01-04   phone         9     91
17  2020-01-05   mouse         9     65

4

In [418]:
df = pd.read_csv('data/sales.csv', index_col='date')
df.iloc[[12, 56, 44, 1234]]

             item  price  quantity
date
2020-01-13  phone     42         5
2020-02-26  phone     42         4
2020-02-14   book     15         5
2023-05-19   book     93         4

In [419]:
df.index

Index(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04', '2020-01-05',
       '2020-01-06', '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10',
       ...
       '2028-03-09', '2028-03-10', '2028-03-11', '2028-03-12', '2028-03-13',
       '2028-03-14', '2028-03-15', '2028-03-16', '2028-03-17', '2028-03-18'],
      dtype='object', name='date', length=3000)

In [420]:
df.index.dtype

dtype('O')

In [421]:
df.index.name = 'Дата'
df.index

Index(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04', '2020-01-05',
       '2020-01-06', '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10',
       ...
       '2028-03-09', '2028-03-10', '2028-03-11', '2028-03-12', '2028-03-13',
       '2028-03-14', '2028-03-15', '2028-03-16', '2028-03-17', '2028-03-18'],
      dtype='object', name='Дата', length=3000)

In [422]:
print(len(df.index.values) == len(df.index.unique()))

True

In [423]:
print(all(df.index.unique()))

True

In [424]:
print(df.index.is_unique)

True

5

In [425]:
df = pd.read_csv('data\sales.csv')
df.loc[145:154, ['date', 'item', 'price']]

           date    item  price
145  2020-05-25   phone     29
146  2020-05-26    book     97
147  2020-05-27    book     60
148  2020-05-28  laptop     83
149  2020-05-29   mouse     17
150  2020-05-30     pen     23
151  2020-05-31    book     44
152  2020-06-01    book     86
153  2020-06-02   phone     67
154  2020-06-03   phone     52

In [426]:
df_laptop = df.loc[df['item'] == 'laptop']
df_laptop.head()

          date    item  price  quantity
1   2020-01-02  laptop     73         4
9   2020-01-10  laptop     92         8
10  2020-01-11  laptop     34         1
14  2020-01-15  laptop     14         9
19  2020-01-20  laptop     47         4

In [427]:
df.loc[(df['price'] >= 10) & (df['price'] <= 35)].head(3)

          date    item  price  quantity
0   2020-01-01   mouse     35         5
5   2020-01-06    book     23         4
10  2020-01-11  laptop     34         1

6

In [428]:
df = pd.read_csv('data\sales.csv')

In [429]:
df.loc[14:19, ['item', 'quantity']]

      item  quantity
14  laptop         9
15    book         2
16   phone         4
17   mouse         2
18   mouse         7
19  laptop         4

In [430]:
df.loc[(df['price'] > 50) & (df['item'] == 'laptop')].head()

          date    item  price  quantity
1   2020-01-02  laptop     73         4
9   2020-01-10  laptop     92         8
20  2020-01-21  laptop     94         6
41  2020-02-11  laptop     74         6
45  2020-02-15  laptop     63         8

In [431]:
df.loc[(df['price'] > 50) & (df['item'].isin(['laptop', 'phone']))].head()

          date    item  price  quantity
1   2020-01-02  laptop     73         4
2   2020-01-03   phone     90         7
3   2020-01-04   phone     91         9
9   2020-01-10  laptop     92         8
11  2020-01-12   phone     58         6

7

In [432]:
df = pd.read_csv('data\sales.csv')
df.head()

         date    item  price  quantity
0  2020-01-01   mouse     35         5
1  2020-01-02  laptop     73         4
2  2020-01-03   phone     90         7
3  2020-01-04   phone     91         9
4  2020-01-05   mouse     65         9

In [433]:
df['date'] = df['date'].astype('datetime64[ns]')

In [434]:
df[df['date'].between('2020-07-07', '2020-09-04', inclusive='neither')].head()

          date   item  price  quantity
189 2020-07-08    pen     90         5
190 2020-07-09  phone     58         6
191 2020-07-10  phone     88         2
192 2020-07-11  phone     59         9
193 2020-07-12    pen     76         3

In [435]:
df.loc[df['item'] == 'pen', 'price'] = 12
df.tail(9)

           date    item  price  quantity
2991 2028-03-10   mouse     71         2
2992 2028-03-11  laptop     57         6
2993 2028-03-12     pen     12         8
2994 2028-03-13  laptop     16         6
2995 2028-03-14  laptop     72         4
2996 2028-03-15   mouse     76         1
2997 2028-03-16     pen     12         7
2998 2028-03-17   mouse     18         4
2999 2028-03-18  laptop     46         1

8

In [436]:
df = pd.read_csv('data\sales.csv')
df['date'] = df['date'].astype('datetime64[ns]')
df.head()

        date    item  price  quantity
0 2020-01-01   mouse     35         5
1 2020-01-02  laptop     73         4
2 2020-01-03   phone     90         7
3 2020-01-04   phone     91         9
4 2020-01-05   mouse     65         9

In [437]:
df.loc[df['date'].dt.day == 6, 'price'] = 0
df.loc[df['date'].dt.day == 6, 'quantity'] = 0
df.head(7)

        date    item  price  quantity
0 2020-01-01   mouse     35         5
1 2020-01-02  laptop     73         4
2 2020-01-03   phone     90         7
3 2020-01-04   phone     91         9
4 2020-01-05   mouse     65         9
5 2020-01-06    book      0         0
6 2020-01-07    book     86         9

9

In [438]:
df.loc[df['item'] == 'mouse', 'price'] *= 2
df.head()

        date    item  price  quantity
0 2020-01-01   mouse     70         5
1 2020-01-02  laptop     73         4
2 2020-01-03   phone     90         7
3 2020-01-04   phone     91         9
4 2020-01-05   mouse    130         9

In [439]:
df['price'] = df['price'].where(df['item'] != 'mouse', df['price'] * 2)
df.loc[df['item']=='mouse','price'] = df['price'].apply(lambda x: x * 2)

10

In [440]:
df = pd.read_csv('data\sales.csv')
df.loc[df['item'] == 'phone', 'quantity'] **= 2
df.loc[df['item'] == 'laptop', 'quantity'] -= 2
df.loc[25:45].head()

          date  item  price  quantity
25  2020-01-26  book     80         1
26  2020-01-27  book     53         1
27  2020-01-28   pen     74         9
28  2020-01-29  book     89         1
29  2020-01-30  book     33         1

11

In [441]:
df = pd.read_csv('data\sales.csv')
df['date'] = df['date'].astype(str)
df.loc[df['date'].str[-1] == '5', 'price'] = np.NaN
df.head()

         date    item  price  quantity
0  2020-01-01   mouse   35.0         5
1  2020-01-02  laptop   73.0         4
2  2020-01-03   phone   90.0         7
3  2020-01-04   phone   91.0         9
4  2020-01-05   mouse    NaN         9

In [442]:
df['Выручка'] = df['price'] * df['quantity']
df = df.drop(['price', 'quantity'], axis=1).rename(columns={'date':'Дата', 'item':'Наименование'})

In [443]:
df.loc[23:43, ['Дата', 'Наименование', 'Выручка']].head()

          Дата Наименование  Выручка
23  2020-01-24          pen    243.0
24  2020-01-25         book      NaN
25  2020-01-26         book     80.0
26  2020-01-27         book     53.0
27  2020-01-28          pen    666.0

12

In [444]:
df = pd.read_csv('data\sales.csv')
df.head()

         date    item  price  quantity
0  2020-01-01   mouse     35         5
1  2020-01-02  laptop     73         4
2  2020-01-03   phone     90         7
3  2020-01-04   phone     91         9
4  2020-01-05   mouse     65         9

In [445]:
def popularity_score(row):
    scores = row['price'] * row['quantity']
    if row['quantity'] < 5:
        return scores
    return scores * 100

df['score'] = df.apply(popularity_score, axis=1)

In [446]:
df.head(7)

         date    item  price  quantity  score
0  2020-01-01   mouse     35         5  17500
1  2020-01-02  laptop     73         4    292
2  2020-01-03   phone     90         7  63000
3  2020-01-04   phone     91         9  81900
4  2020-01-05   mouse     65         9  58500
5  2020-01-06    book     23         4     92
6  2020-01-07    book     86         9  77400

13

In [447]:
df = pd.read_csv('data\sales.csv')
df['date'] = df['date'].astype('datetime64[ns]')
df.head()

        date    item  price  quantity
0 2020-01-01   mouse     35         5
1 2020-01-02  laptop     73         4
2 2020-01-03   phone     90         7
3 2020-01-04   phone     91         9
4 2020-01-05   mouse     65         9

In [448]:
def give_revenue(row):
    month = row['date'].month
    year = row['date'].year
    total = row['price'] * row['quantity']
    return tuple([month, year, total])

In [449]:
df['revenue'] = df.apply(give_revenue, axis=1)
df.loc[[2, 5, 12, 455, 345, 1200, 999]]

           date    item  price  quantity         revenue
2    2020-01-03   phone     90         7  (1, 2020, 630)
5    2020-01-06    book     23         4   (1, 2020, 92)
12   2020-01-13   phone     42         5  (1, 2020, 210)
455  2021-03-31  laptop     14         5   (3, 2021, 70)
345  2020-12-11   mouse     64         1  (12, 2020, 64)
1200 2023-04-15  laptop     75         9  (4, 2023, 675)
999  2022-09-26     pen     77         4  (9, 2022, 308)

14

In [450]:
df = pd.read_csv('data\sales.csv', parse_dates=['date'])

In [451]:
def get_season(row):
    if row['date'].month == 12 or row['date'].month == 1 or row['date'].month == 2:
        season = 'зима'
    elif row['date'].month == 3 or row['date'].month == 4 or row['date'].month == 5:
        season = 'весна'
    elif row['date'].month == 6 or row['date'].month == 7 or row['date'].month == 8:
        season = 'лето'
    else:
        season = 'осень'
    return season

In [452]:
df['season'] = df.apply(get_season, axis=1)
df.loc[[2, 33, 99, 123, 687, 2345]]

           date    item  price  quantity season
2    2020-01-03   phone     90         7   зима
33   2020-02-03     pen     20         1   зима
99   2020-04-09     pen     84         4  весна
123  2020-05-03    book     14         1  весна
687  2021-11-18  laptop     38         1  осень
2345 2026-06-03     pen     84         8   лето

In [453]:
dct = {
    12:'зима', 1:'зима', 2:'зима', 
    3:'весна', 4:'весна', 5:'весна', 
    6:'лето', 7:'лето', 8:'лето', 
    9:'осень', 10:'осень', 11:'осень'
}

df = pd.read_csv('data\sales.csv')
df['season'] = pd.to_datetime(df['date']).apply(lambda x: dct[x.month])

df.loc[[2, 33, 99, 123, 687, 2345]]

            date    item  price  quantity season
2     2020-01-03   phone     90         7   зима
33    2020-02-03     pen     20         1   зима
99    2020-04-09     pen     84         4  весна
123   2020-05-03    book     14         1  весна
687   2021-11-18  laptop     38         1  осень
2345  2026-06-03     pen     84         8   лето

15

In [454]:
df = pd.read_csv('data\sales.csv')
df.head()

         date    item  price  quantity
0  2020-01-01   mouse     35         5
1  2020-01-02  laptop     73         4
2  2020-01-03   phone     90         7
3  2020-01-04   phone     91         9
4  2020-01-05   mouse     65         9

In [455]:
def give_status(row):
    if row['price'] >= 0 and row['price'] <= max_price/3:
        category = 'низкая'
    elif row['price'] > max_price/3 and row['price'] <= 2*max_price/3:
        category = 'средняя'
    elif row['price'] > 2*max_price/3 and row['price'] <= max_price:
        category = 'высокая'
    return category

In [456]:
max_price = df['price'].max()
df['status'] = df.apply(give_status, axis=1)
df.head(6)

         date    item  price  quantity   status
0  2020-01-01   mouse     35         5  средняя
1  2020-01-02  laptop     73         4  высокая
2  2020-01-03   phone     90         7  высокая
3  2020-01-04   phone     91         9  высокая
4  2020-01-05   mouse     65         9  средняя
5  2020-01-06    book     23         4   низкая

16

In [457]:
df = pd.read_csv('data\sales.csv')
df.head()

         date    item  price  quantity
0  2020-01-01   mouse     35         5
1  2020-01-02  laptop     73         4
2  2020-01-03   phone     90         7
3  2020-01-04   phone     91         9
4  2020-01-05   mouse     65         9

In [458]:
def give_tax(row):
    if row['price'] > 45:
        tax = row['price'] * 0.19
    else:
        tax = row['price'] * 0.13
    return tax

In [459]:
def give_revenue(row):
    return (row['price'] - row['tax']) * row['quantity']

In [460]:
df['tax'] = df.apply(give_tax, axis=1)
df['revenue'] = df.apply(give_revenue, axis=1)

df.head(5)

         date    item  price  quantity    tax  revenue
0  2020-01-01   mouse     35         5   4.55   152.25
1  2020-01-02  laptop     73         4  13.87   236.52
2  2020-01-03   phone     90         7  17.10   510.30
3  2020-01-04   phone     91         9  17.29   663.39
4  2020-01-05   mouse     65         9  12.35   473.85

In [461]:
df['tax'] = df.apply(lambda x: x['price'] * 0.19 if x['price'] > 45 else x['price'] * 0.13, axis=1)
df['revenue'] = (df['price'] - df['tax']) * df['quantity']

df.head(5)

         date    item  price  quantity    tax  revenue
0  2020-01-01   mouse     35         5   4.55   152.25
1  2020-01-02  laptop     73         4  13.87   236.52
2  2020-01-03   phone     90         7  17.10   510.30
3  2020-01-04   phone     91         9  17.29   663.39
4  2020-01-05   mouse     65         9  12.35   473.85

In [462]:
df['tax'] = df['price'] * (0.13 + 0.06 * (df['price'] > 45))
df['revenue'] = (df['price'] - df['tax']) * df['quantity']

df.head()

         date    item  price  quantity    tax  revenue
0  2020-01-01   mouse     35         5   4.55   152.25
1  2020-01-02  laptop     73         4  13.87   236.52
2  2020-01-03   phone     90         7  17.10   510.30
3  2020-01-04   phone     91         9  17.29   663.39
4  2020-01-05   mouse     65         9  12.35   473.85

17

In [463]:
df = pd.read_csv('data/sales2.csv')
df.sort_values(['date'], ascending=False).head()

                   date      fruit             campaign   sold      revenue
13  2023-12-19 07:34:21     яблоки  Скидка на второй кг  196.0  4718.963936
0   2023-12-17 16:20:47   абрикосы  Скидка на второй кг  197.0  2361.750799
10  2023-12-17 08:10:44       киви  Скидка на второй кг  198.0  3819.447368
4   2023-12-16 20:12:10  апельсины  Скидка на второй кг  196.0  4291.843684
7   2023-12-13 18:53:46     бананы  Скидка на второй кг  197.0  2843.560539

18

In [464]:
df = pd.read_csv('data/sales2.csv')
df.sort_values(['campaign', 'fruit', 'date'], ascending=[False, True, True], ).loc[df['sold'] > 195].head()

                  date      fruit             campaign   sold      revenue
0  2023-12-17 16:20:47   абрикосы  Скидка на второй кг  197.0  2361.750799
1  2022-07-16 11:15:51    ананасы  Скидка на второй кг  199.0  2995.432179
2  2022-07-28 06:26:43  апельсины  Скидка на второй кг  197.0  3548.769518
3  2022-09-15 08:28:02  апельсины  Скидка на второй кг  199.0  4180.650254
4  2023-12-16 20:12:10  апельсины  Скидка на второй кг  196.0  4291.843684

19

In [465]:
df = pd.read_csv('data/sales2.csv')
df.nlargest(3, 'revenue').iloc[1]

date        2023-06-22 14:51:06
fruit                      киви
campaign    Скидка на второй кг
sold                      198.0
revenue             4869.204252
Name: 9, dtype: object

In [466]:
df = pd.read_csv('data/sales2.csv').sort_values('revenue', ascending = False)
df.iloc[1]

date        2023-06-22 14:51:06
fruit                      киви
campaign    Скидка на второй кг
sold                      198.0
revenue             4869.204252
Name: 9, dtype: object

20

In [467]:
df[df['fruit'] == 'апельсины'].nlargest(3, 'revenue').iloc[2]

date        2022-07-28 06:26:43
fruit                 апельсины
campaign    Скидка на второй кг
sold                      197.0
revenue             3548.769518
Name: 2, dtype: object

21

In [468]:
df = pd.read_csv('data/sales2.csv')
df['campaign'] = df['campaign'].fillna('nan')

In [469]:
my_dict = dict()
for i in df['campaign'].unique():
    my_dict[i] = round(df.loc[df['campaign'] == i, 'revenue'].sum(), 2)
my_dict = sorted(my_dict.items(), key=lambda x: x[1], reverse=True)
my_dict = dict(my_dict)

for k, v in my_dict.items():
    print(f'{k} - {v}')

Бонусные карты - 48389.22
Скидка на второй кг - 47287.71
nan - 0.0

In [470]:
df = pd.read_csv('data/sales2.csv')

df['campaign'] = df['campaign'].fillna('nan')

result = df.groupby('campaign').revenue.sum().round(2).sort_values(ascending = False)

for idx, val in result.items():
    print(idx,' - ',val, sep = '')

Бонусные карты - 48389.22
Скидка на второй кг - 47287.71
nan - 0.0

22

In [471]:
df = pd.read_csv('data/sales2.csv')
df['date'] = df['date'].astype('datetime64[ns]')

In [472]:
# - в первой строке дату, на которую приходится максимальная выручка для ананасов,
rev = df.loc[df['fruit'] == 'ананасы'].sort_values(by=['date'], ascending=False).nlargest(1, 'revenue')['date'].values
print(*rev)
# - во второй строке дату на которую приходится минимальный объем продаж бананов.
rev = df.loc[df['fruit'] == 'бананы'].sort_values(by=['date'], ascending=False).nsmallest(1, 'revenue')['date'].values
print(*rev)

2022-07-16T11:15:51.000000000
2022-05-29T17:42:53.000000000

23

In [473]:
df = pd.read_csv('data/sales2.csv')
df.head()

                  date      fruit             campaign   sold      revenue
0  2023-12-17 16:20:47   абрикосы  Скидка на второй кг  197.0  2361.750799
1  2022-07-16 11:15:51    ананасы  Скидка на второй кг  199.0  2995.432179
2  2022-07-28 06:26:43  апельсины  Скидка на второй кг  197.0  3548.769518
3  2022-09-15 08:28:02  апельсины  Скидка на второй кг  199.0  4180.650254
4  2023-12-16 20:12:10  апельсины  Скидка на второй кг  196.0  4291.843684

In [474]:
#  - в первой строке ответ на вопрос: какие фрукты дали минимальную выручку в рекламной кампании "Бонусные карты",
print(df[df['campaign'] == 'Бонусные карты'].nsmallest(1, 'revenue')['fruit'].values[0])
# -  во второй строке ответ на вопрос: какие фрукты дали максимальную выручку в рекламной кампании "Скидка на второй кг".
print(df[df['campaign'] == 'Скидка на второй кг'].nlargest(1, 'revenue')['fruit'].values[0])

яблоки
киви

In [475]:
print(df.loc[df.loc[df['campaign'] == 'Бонусные карты', 'revenue'].idxmin()].fruit)
print(df.loc[df.loc[df['campaign'] == 'Скидка на второй кг', 'revenue'].idxmax()].fruit)

яблоки
киви

24

In [476]:
df = pd.read_csv('data/sales2.csv')
df['date'] = pd.to_datetime(df['date'])
df['campaign'] = df['campaign'].fillna('nan')
# df.set_index('campaign', inplace=True)
# df.index.name = None
df.iloc[[2,4,6,7,19,22,2,5,34,37]]

                  date      fruit             campaign   sold      revenue
2  2022-07-28 06:26:43  апельсины  Скидка на второй кг  197.0  3548.769518
4  2023-12-16 20:12:10  апельсины  Скидка на второй кг  196.0  4291.843684
6  2022-05-29 17:42:53     бананы  Скидка на второй кг  199.0  1515.620934
7  2023-12-13 18:53:46     бананы  Скидка на второй кг  197.0  2843.560539
19 2022-02-18 20:10:55      груши       Бонусные карты  196.0  1754.060204
22 2022-11-01 09:35:00   клубника       Бонусные карты   89.0  2464.730938
2  2022-07-28 06:26:43  апельсины  Скидка на второй кг  197.0  3548.769518
5  2022-02-01 06:45:26     бананы  Скидка на второй кг  199.0  4379.110530
34 2023-02-09 21:27:53     бананы                  nan    NaN          NaN
37 2023-08-28 21:56:58       киви                  nan    NaN          NaN

In [477]:
def get_season(row):
    if row['date'].month == 12 or row['date'].month == 1 or row['date'].month == 2:
        season = 'зима'
    elif row['date'].month == 3 or row['date'].month == 4 or row['date'].month == 5:
        season = 'весна'
    elif row['date'].month == 6 or row['date'].month == 7 or row['date'].month == 8:
        season = 'лето'
    else:
        season = 'осень'
    return season

In [478]:
df['season'] = df.apply(get_season, axis=1)
df.head()

,date,fruit,campaign,sold,revenue,season
0,2023-12-17 16:20:47,абрикосы,Скидка на второй кг,197.0,2361.750799,зима
1,2022-07-16 11:15:51,ананасы,Скидка на второй кг,199.0,2995.432179,лето
2,2022-07-28 06:26:43,апельсины,Скидка на второй кг,197.0,3548.769518,лето
3,2022-09-15 08:28:02,апельсины,Скидка на второй кг,199.0,4180.650254,осень
4,2023-12-16 20:12:10,апельсины,Скидка на второй кг,196.0,4291.843684,зима

In [479]:
pivot_table = pd.pivot_table(df, values='revenue', index='campaign', columns='season', aggfunc='sum')
pivot_table.index.name = None
pivot_table.columns.name = None
pivot_table

                           весна          зима          лето         осень
nan                     0.000000      0.000000      0.000000      0.000000
Бонусные карты       2453.614320  10962.214013  15962.904099  19010.487172
Скидка на второй кг  4859.631856  22414.676856  11413.405949   8599.996362

In [480]:
df = pd.read_csv('data/sales2.csv')
df['campaign'] = df['campaign'].fillna('nan')

season = {1:'зима', 2:'зима', 3:'весна', 4:'весна', 5:'весна', 6:'лето', 7:'лето', 8:'лето', 9:'осень', 10:'осень', 11:'осень', 12:'зима'}
df['season'] = df['date'].astype('datetime64[ns]').dt.month.apply(lambda x: season[x])

pivot_table = pd.pivot_table(df, values='revenue', index='campaign', columns='season', aggfunc='sum')
pivot_table.index.name=None
pivot_table.columns.name=None
pivot_table

                           весна          зима          лето         осень
nan                     0.000000      0.000000      0.000000      0.000000
Бонусные карты       2453.614320  10962.214013  15962.904099  19010.487172
Скидка на второй кг  4859.631856  22414.676856  11413.405949   8599.996362

25

In [481]:
df = pd.read_csv('data/sales2.csv')
df['campaign'] = df['campaign'].fillna('nan')

In [482]:
print(f"Средняя выручка: {round(df['revenue'].mean(), 2)}")
print(f"Медианная выручка: {round(df['revenue'].median(), 2)}")
print(f"Количество продаж без рекламных кампаний: {df[df['campaign'] == 'nan']['sold'].count()}")

for i in ['Бонусные карты', 'Скидка на второй кг']:
    print(f"Количество продаж в рамках кампании '{i}':", df[df['campaign'] == i]['sold'].count())

Средняя выручка: 3086.35
Медианная выручка: 3003.59
Количество продаж без рекламных кампаний: 1
Количество продаж в рамках кампании 'Бонусные карты': 17
Количество продаж в рамках кампании 'Скидка на второй кг': 14

In [483]:
info = ['Средняя выручка:', 'Медианная выручка:', 'Количество продаж без рекламных кампаний:',
        "Количество продаж в рамках кампании 'Бонусные карты':", "Количество продаж в рамках кампании 'Скидка на второй кг':"]
func = [df['revenue'].mean(), df['revenue'].median(), df[df['campaign'] == 'nan']['sold'].count(),
        df[df['campaign'] == 'Бонусные карты']['sold'].count(), df[df['campaign'] == 'Скидка на второй кг']['sold'].count()]

for k,v in zip(info, func):
    print(k, np.round(v, 2))

Средняя выручка: 3086.35
Медианная выручка: 3003.59
Количество продаж без рекламных кампаний: 1
Количество продаж в рамках кампании 'Бонусные карты': 17
Количество продаж в рамках кампании 'Скидка на второй кг': 14

26

In [484]:
func = [df[(df['campaign'] == 'Скидка на второй кг') & (df['fruit'] == 'бананы')]['revenue'].mean(), 
        df[(df['campaign'] == 'Скидка на второй кг') & (df['fruit'] == 'бананы')]['revenue'].std(), 
        df[(df['campaign'] == 'Скидка на второй кг') & (df['fruit'] == 'бананы')]['sold'].mean(), 
        df[(df['campaign'] == 'Скидка на второй кг') & (df['fruit'] == 'бананы')]['sold'].std()]
for i in func:
    print(round(i, 2))

2912.76
1433.0
198.33
1.15

27

In [485]:
df = pd.read_csv('data/sales2.csv')

In [486]:
df.describe()

             sold      revenue
count   32.000000    31.000000
mean   183.875000  3086.352601
std     44.334324  1102.295327
min     15.000000  1375.105074
25%    196.000000  2322.122718
50%    197.500000  3003.590210
75%    198.250000  4007.320182
max    199.000000  4932.544357

In [487]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
sold,32.0,183.875000,44.334324,15.000000,196.000000,197.50000,198.250000,199.000000
revenue,31.0,3086.352601,1102.295327,1375.105074,2322.122718,3003.59021,4007.320182,4932.544357

In [488]:
df_quantile = df.describe().round(2)
for i in ['25%', '50%', '75%']:
    print(f'{i}-й квантиль', df_quantile.loc[i], sep='\n')

25%-й квантиль
sold        196.00
revenue    2322.12
Name: 25%, dtype: float64
50%-й квантиль
sold        197.50
revenue    3003.59
Name: 50%, dtype: float64
75%-й квантиль
sold        198.25
revenue    4007.32
Name: 75%, dtype: float64

In [489]:
for i in ['25%', '50%', '75%']:
    print(f"{i}-й квантиль\n{df.describe().T[i].round(2)}")

25%-й квантиль
sold        196.00
revenue    2322.12
Name: 25%, dtype: float64
50%-й квантиль
sold        197.50
revenue    3003.59
Name: 50%, dtype: float64
75%-й квантиль
sold        198.25
revenue    4007.32
Name: 75%, dtype: float64

In [490]:
for value in (0.25, 0.5, 0.75):
    q = round(df.quantile(value, numeric_only=True), 2)
    percentage = int(value * 100)
    q.name = f'{percentage}%'
    q.index.name = f'{percentage}%-й квантиль'
    print(q)

25%-й квантиль
sold        196.00
revenue    2322.12
Name: 25%, dtype: float64
50%-й квантиль
sold        197.50
revenue    3003.59
Name: 50%, dtype: float64
75%-й квантиль
sold        198.25
revenue    4007.32
Name: 75%, dtype: float64

28

In [491]:
# Вам необходимо загрузить данные из файла в DataFrame и вывести среднее значение общей выручки для тех значений выручки, 
# которые превышают значение, больше которого находится 15% всех значений выручки. Результат округляйте до двух знаков после запятой.

df = pd.read_csv('data/sales2.csv')

print(round(df[df['revenue'] > df['revenue'].quantile(0.85)]['revenue'].mean(), 2))
print(round(df.loc[df['revenue'] > df['revenue'].quantile(0.85), 'revenue'].mean() ,2))

4699.74
4699.74

29

In [492]:
# Вам необходимо загрузить данные из файла в DataFrame и вывести список фруктов, участвующих в кампании "Бонусные карты" (в лексикографическом порядке), 
# выручка для которых ниже значения, больше которого находится 99% всех значений выручки.
df = pd.read_csv('data/sales2.csv')

df[(df['campaign'] == 'Бонусные карты') & (df['revenue'] < df['revenue'].quantile(0.01))]['fruit'].sort_values(ascending=True).unique().tolist()

['яблоки']

30

In [493]:
# Вам необходимо загрузить данные из файла в DataFrame и вывести первые пять строк среза исходного DataFrame, 
# в который входят фрукты, участвующие в кампании "Скидка на второй кг", 
# которых нет среди фруктов со значением выручки, более 70%-го значения от всех значений выручки. 
# Порядок следования строк в этом DataFrame должен совпадать с порядком следования строк в исходном DataFrame.
df = pd.read_csv('data/sales2.csv')
fruit_list = df[(df['campaign'] == 'Скидка на второй кг') & (df['revenue'] > df['revenue'].quantile(0.70))]['fruit'].tolist()
fruit_list

['апельсины', 'апельсины', 'бананы', 'киви', 'яблоки']

In [494]:
df.loc[~df['fruit'].isin(fruit_list)].head()

                   date      fruit             campaign   sold      revenue
0   2023-12-17 16:20:47   абрикосы  Скидка на второй кг  197.0  2361.750799
1   2022-07-16 11:15:51    ананасы  Скидка на второй кг  199.0  2995.432179
11  2022-11-29 21:56:11   клубника  Скидка на второй кг  198.0  3003.590210
12  2022-09-20 08:13:48  мандарины  Скидка на второй кг  196.0  1415.755898
14  2022-08-23 18:17:50   абрикосы       Бонусные карты  199.0  4598.869375

31

In [495]:
# Вам необходимо загрузить данные из файла в DataFrame и вывести в лексикографическом порядке названий фруктов строки в формате:
# название фрукта: n
# ...

df = pd.read_csv('data/sales2.csv')

In [496]:
for i in sorted(df['fruit'].unique()):
    print(f"{i}: {len(df[df['fruit'] == i])}")

абрикосы: 3
ананасы: 1
апельсины: 6
бананы: 7
груши: 4
киви: 5
клубника: 6
мандарины: 6
персики: 2
яблоки: 6

32

In [497]:
# Вам необходимо сначала загрузить данные из файла 'sales.csv' в DataFrame. Затем создайте новый срез данных, включающий строки с объемами продаж 4, 6, 15, 50 или 196 кг за день. 
# В этом срезе найдите фрукты с максимальным количеством дней продаж. После этого выведите названия этих фруктов и число дней n, когда они были проданы в полученном срезе, 
# каждый фрукт с новой строки. Названия фруктов должны идти в лексикографическом порядке. Ответ приведите в формате: 
# название фрукта1: n1
# название фрукта2: n2...

In [498]:
df = pd.read_csv('data\sales2.csv')

In [499]:
df1 = df[df['sold'].isin([4, 6, 15, 50, 196])]
df1

                   date      fruit             campaign   sold      revenue
4   2023-12-16 20:12:10  апельсины  Скидка на второй кг  196.0  4291.843684
12  2022-09-20 08:13:48  мандарины  Скидка на второй кг  196.0  1415.755898
13  2023-12-19 07:34:21     яблоки  Скидка на второй кг  196.0  4718.963936
17  2023-11-29 09:04:00  апельсины       Бонусные карты  196.0  3314.635343
19  2022-02-18 20:10:55      груши       Бонусные карты  196.0  1754.060204
20  2022-10-23 02:22:24      груши       Бонусные карты  196.0  2445.059280
28  2022-08-31 19:09:44     яблоки       Бонусные карты  196.0  1554.937196
29  2022-09-08 12:08:36     яблоки       Бонусные карты   50.0  1375.105074
35  2022-01-15 00:09:48      груши                  NaN   15.0          NaN

In [500]:
count_saleDays = df1.groupby(by=['fruit'])['sold'].count()

n = df1.groupby(by=['fruit'])['sold'].count().max()

ser = count_saleDays[count_saleDays == n]
ser = ser.sort_index(ascending=True)
for item in ser.index.values:
    print(f'{item}: {n}')

груши: 3
яблоки: 3

In [501]:
df1 = df[df['sold'].isin([4, 6, 15, 50, 196])].groupby('fruit')['fruit'].count()
ser = df1[df1 == df1.max()]
for fruit in ser.index:
    print(f'{fruit}: {ser.loc[fruit]}')

груши: 3
яблоки: 3

33

In [502]:
# Фильмов какого жанра больше всего в таблице? 
# В качестве ответа введите в поле название жанра без кавычек затем через пробел количество фильмов с этим жанром в таблице.
df = pd.read_csv('data\movies.csv')
df.head()

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,runtime
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000.0,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000.0,46998772.0,Warner Bros.,146.0
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000.0,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000.0,58853106.0,Columbia Pictures,104.0
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000.0,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000.0,538375067.0,Lucasfilm,124.0
3,Airplane!,PG,Comedy,1980,"July 2, 1980 (United States)",7.7,221000.0,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000.0,83453539.0,Paramount Pictures,88.0
4,Caddyshack,R,Comedy,1980,"July 25, 1980 (United States)",7.3,108000.0,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000.0,39846344.0,Orion Pictures,98.0

In [503]:
df['genre'].describe().agg(['top', 'freq'])

top     Comedy
freq      2245
Name: genre, dtype: object

In [504]:
df1 = df.groupby('genre').count().sort_values('name', ascending=False)
print(df1.name.head(1))

genre
Comedy    2245
Name: name, dtype: int64

In [505]:
from collections import Counter
print(Counter(df.genre).most_common()[0])

('Comedy', 2245)

34

In [506]:
# Действительно ли средний бюджет фильмов в киноиндустрии увеличивается с течением времени. 
# Для этого необходимо вычислить с точностью до двух знаков после запятой средние бюджеты фильмов, 
# выпущенных в 2000, 2005, 2010, 2015, 2019 годах. В качестве ответа в поле ответа введите пять строк с соответствующими числовыми значениями. 
# Нули в конце чисел не выводите, т.е. если получено число 2.40, то вводите 2.4
df.head()

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,runtime
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000.0,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000.0,46998772.0,Warner Bros.,146.0
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000.0,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000.0,58853106.0,Columbia Pictures,104.0
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000.0,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000.0,538375067.0,Lucasfilm,124.0
3,Airplane!,PG,Comedy,1980,"July 2, 1980 (United States)",7.7,221000.0,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000.0,83453539.0,Paramount Pictures,88.0
4,Caddyshack,R,Comedy,1980,"July 25, 1980 (United States)",7.3,108000.0,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000.0,39846344.0,Orion Pictures,98.0

In [507]:
print(ser := df[df['year'].isin([2000, 2005, 2010, 2015, 2019])].groupby('year')['budget'].mean().round(2))
print(*ser.values, sep='\n')

year
2000    38897239.26
2005    42291141.18
2010    46663109.76
2015    46682332.15
2019    57401293.10
Name: budget, dtype: float64
38897239.26
42291141.18
46663109.76
46682332.15
57401293.1

35

In [508]:
# Ответьте на следующие вопросы: 
# фильмов какого режиссера больше всего в подборке, 
# какой актер 4-ый по популярности в подборке, 
# сколько фильмов производства Новой Зеландии присутствует в подборке (New Zeland), 
# какой фильм из Ирландии имел самый высокий бюджет?

# Формат ответа (пример):

# Paul Verhoven
# Denzel Washington
# 35
# Name of the movie
df.head()

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,runtime
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000.0,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000.0,46998772.0,Warner Bros.,146.0
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000.0,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000.0,58853106.0,Columbia Pictures,104.0
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000.0,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000.0,538375067.0,Lucasfilm,124.0
3,Airplane!,PG,Comedy,1980,"July 2, 1980 (United States)",7.7,221000.0,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000.0,83453539.0,Paramount Pictures,88.0
4,Caddyshack,R,Comedy,1980,"July 25, 1980 (United States)",7.3,108000.0,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000.0,39846344.0,Orion Pictures,98.0

In [509]:
print(df['director'].value_counts().idxmax())
print(df['star'].value_counts().nlargest(4).index[3])
print(len(df[df['country'] == 'New Zealand']))
print(df[df['country'] == 'Ireland'].nlargest(1, 'budget')['name'].values[0])

Woody Allen
Denzel Washington
25
Enemy at the Gates

In [510]:
print(df['director'].value_counts().index[0])
print(df['star'].value_counts().index[3])
print(df[df['country'] == 'New Zealand'].shape[0])
print(df[df['country'] == 'Ireland'].sort_values('budget', ascending=False).name.values[0])

Woody Allen
Denzel Washington
25
Enemy at the Gates

In [511]:
print(df.groupby('director')['name'].count().sort_values(ascending=False).idxmax())
print(df.groupby('star')['name'].count().sort_values(ascending=False).index[3])
print((df['country'] == 'New Zealand').sum())
print(df.loc[df.loc[df['country'] == 'Ireland']['budget'].idxmax()]['name'])

Woody Allen
Denzel Washington
25
Enemy at the Gates

36

In [512]:
# Какая взаимосвязь между бюджетом фильма и его кассовыми сборами? В качестве ответа приведите коэффициент корреляции между этими показателями, округленный до двух знаков после запятой.
df['budget'].corr(df['gross']).round(2)

0.74

In [513]:
df[['budget','gross']].corr().round(2)

        budget  gross
budget    1.00   0.74
gross     0.74   1.00

37

In [514]:
# Ответьте на следующие вопросы: 
# 1. Как связаны продолжительность фильма и его пользовательский рейтинг IMDb,
# 2. Какова связь между продолжительностью фильма и его бюджетом (ответом на каждый из этих вопросов является коэффициент корреляции, 
# округленный до двух знаков после запятой, между соответствующими показателями, каждый с новой строки),
# 3 В каком месяце выходит наибольшее количество фильмов (название месяца по-английски, с большой буквы)?
df.head()

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,runtime
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000.0,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000.0,46998772.0,Warner Bros.,146.0
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000.0,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000.0,58853106.0,Columbia Pictures,104.0
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000.0,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000.0,538375067.0,Lucasfilm,124.0
3,Airplane!,PG,Comedy,1980,"July 2, 1980 (United States)",7.7,221000.0,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000.0,83453539.0,Paramount Pictures,88.0
4,Caddyshack,R,Comedy,1980,"July 25, 1980 (United States)",7.3,108000.0,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000.0,39846344.0,Orion Pictures,98.0

In [515]:
df[['runtime', 'score', 'budget']].corr().round(2)

         runtime  score  budget
runtime     1.00   0.40    0.32
score       0.40   1.00    0.08
budget      0.32   0.08    1.00

In [516]:
df['released'].str.split().str[0].value_counts().idxmax()

'October'

38

In [517]:
df = pd.read_csv('data\wines.csv').drop(['Unnamed: 0.1', 'Unnamed: 0'], axis=1)
df.head()

,country,description,designation,points,price,province,region_1,region_2,variety,winery
0,US,This tremendous 100% varietal wine hails from ...,Martha's Vineyard,96,235.0,California,Napa Valley,Napa,Cabernet Sauvignon,Heitz
1,Spain,"Ripe aromas of fig, blackberry and cassis are ...",Carodorum Selección Especial Reserva,96,110.0,Northern Spain,Toro,NaN,Tinta de Toro,Bodega Carmen Rodríguez
2,US,Mac Watson honors the memory of a wine once ma...,Special Selected Late Harvest,96,90.0,California,Knights Valley,Sonoma,Sauvignon Blanc,Macauley
3,US,"This spent 20 months in 30% new French oak, an...",Reserve,96,65.0,Oregon,Willamette Valley,Willamette Valley,Pinot Noir,Ponzi
4,France,"This is the top wine from La Bégude, named aft...",La Brûlade,95,66.0,Provence,Bandol,NaN,Provence red blend,Domaine de la Bégude

In [518]:
# Ответьте на вопросы:
# - сколько записей в таблице относятся к винам из Испании
# - какова медианная цена для всех вин (введите целое число в следующей строке)
# - каково название винодельни из Венгрии, где производят вино, цена на которое максимальна среди венгерских вин (введите в следующей строке).

In [519]:
print(len(df[df['country'] == 'Spain']))
print(round(df['price'].median()))
print(*df[df['country'] == 'Hungary'].nlargest(1, 'price')['winery'].values)

2665
25
Royal Tokaji

In [520]:
print(df[df['country']=='Spain'].shape[0])
print(round(df['price'].median()))
print(df[df['country']=='Hungary'].set_index('winery')['price'].idxmax())

2665
25
Royal Tokaji

39

In [521]:
# Ответьте на следующие вопросы:
# - какова взаимосвязь между оценками экспертов и ценой на вино (приведите коэффициент корреляции для этих величин, округленный до двух знаков)
# - страны у которых записей в таблице больше 100 распределите в порядке убывания средней оценки их вин, 
# полученную строку, в которой страны следую    т через пробел, введите в поле ответа в следующей строке.

In [522]:
print(df['points'].corr(df['price']).round(2))

df_new = df.groupby(by = ['country'], as_index=True).agg({'country': 'count','points': 'mean'})
df_new.rename(columns={'country': 'count_country','points': 'mean_points'}, inplace=True)
print(*df_new.loc[df_new['count_country'].values > 100].sort_values('mean_points', ascending = False).index)

0.42
Austria Germany France Italy Australia US Portugal New Zealand Israel South Africa Spain Chile Greece Argentina

In [523]:
df_new.head()

                        count_country  mean_points
country
Albania                             2    88.000000
Argentina                        1520    85.849342
Australia                        1015    88.410837
Austria                          1269    89.608353
Bosnia and Herzegovina              2    85.500000

40

In [524]:
# Ответьте на вопрос:
# - Из каких сортов винограда не производят вина в США? 
# В качестве ответа выведите список сортов винограда в лексикографическом порядке в виде строки через пробел в поле ответа.
df.head()

,country,description,designation,points,price,province,region_1,region_2,variety,winery
0,US,This tremendous 100% varietal wine hails from ...,Martha's Vineyard,96,235.0,California,Napa Valley,Napa,Cabernet Sauvignon,Heitz
1,Spain,"Ripe aromas of fig, blackberry and cassis are ...",Carodorum Selección Especial Reserva,96,110.0,Northern Spain,Toro,NaN,Tinta de Toro,Bodega Carmen Rodríguez
2,US,Mac Watson honors the memory of a wine once ma...,Special Selected Late Harvest,96,90.0,California,Knights Valley,Sonoma,Sauvignon Blanc,Macauley
3,US,"This spent 20 months in 30% new French oak, an...",Reserve,96,65.0,Oregon,Willamette Valley,Willamette Valley,Pinot Noir,Ponzi
4,France,"This is the top wine from La Bégude, named aft...",La Brûlade,95,66.0,Provence,Bandol,NaN,Provence red blend,Domaine de la Bégude

In [525]:
print(*df['variety'].unique(), sep=', ')

Cabernet Sauvignon, Tinta de Toro, Sauvignon Blanc, Pinot Noir, Provence red blend, Friulano, Tannat, Chardonnay, Tempranillo, Malbec, Rosé, Tempranillo Blend, Syrah, Mavrud, Sangiovese, Sparkling Blend, Rhône-style White Blend, Red Blend, Mencía, Palomino, Petite Sirah, Riesling, Cabernet Sauvignon-Syrah, Portuguese Red, Nebbiolo, Pinot Gris, Meritage, Baga, Glera, Malbec-Merlot, Merlot-Malbec, Ugni Blanc-Colombard, Viognier, Cabernet Sauvignon-Cabernet Franc, Moscato, Pinot Grigio, Cabernet Franc, White Blend, Monastrell, Gamay, Zinfandel, Greco, Barbera, Grenache, Rhône-style Red Blend, Albariño, Malvasia Bianca, Assyrtiko, Malagouzia, Carmenère, Bordeaux-style Red Blend, Touriga Nacional, Agiorgitiko, Picpoul, Godello, Gewürztraminer, Merlot, Syrah-Grenache, G-S-M, Mourvèdre, Bordeaux-style White Blend, Petit Verdot, Muscat, Chenin Blanc-Chardonnay, Cabernet Sauvignon-Merlot, Pinot Bianco, Alvarinho, Portuguese White, Garganega, Sauvignon, Gros and Petit Manseng, Tannat-Cabernet, Alicante Bouschet, Aragonês, Silvaner, Ugni Blanc, Grüner Veltliner, Frappato, Lemberger, Sylvaner, Chasselas, Alsace white blend, Früburgunder, Kekfrankos, Vermentino, Sherry, Aglianico, Torrontés, Primitivo, Semillon-Sauvignon Blanc, Portuguese Rosé, Grenache-Syrah, Prié Blanc, Negrette, Furmint, Carignane, Pinot Blanc, Nero d'Avola, St. Laurent, Blauburgunder, Blaufränkisch, Scheurebe, Ribolla Gialla, Charbono, Malbec-Cabernet Sauvignon, Pinot Noir-Gamay, Pinot Nero, Gros Manseng, Nerello Mascalese, Shiraz, Negroamaro, Champagne Blend, Romorantin, Syrah-Cabernet Sauvignon, Tannat-Merlot, Duras, Garnacha, Tinta Francisca, Portuguese Sparkling, Chenin Blanc, Turbiana, Petite Verdot, Posip, Fumé Blanc, Roussanne, Grillo, Müller-Thurgau, Pinot Auxerrois, Port, Cabernet Blend, Cabernet Franc-Cabernet Sauvignon, Castelão, Encruzado, Touriga Nacional-Cabernet Sauvignon, Colombard-Sauvignon Blanc, Moscatel, Marsanne, Siria, Garnacha Blanca, Merlot-Cabernet Sauvignon, Arinto, Petit Manseng, Loureiro, Melon, Carricante, Fiano, Schwartzriesling, Sangiovese-Syrah, Tannat-Cabernet Franc, Cabernet Franc-Merlot, Sauvignon Blanc-Semillon, Macabeo, Alfrocheiro, Aligoté, Verdejo, Grenache Blanc, Fernão Pires, Spätburgunder, Ciliegiolo, Cabernet Sauvignon-Carmenère, Auxerrois, Sirica, Zweigelt, Pugnitello, Rosado, Rosato, Malvazija, Kalecik Karasi, Muskat Ottonel, Malbec-Bonarda, Tempranillo-Cabernet Sauvignon, Rivaner, Trepat, Baco Noir, Trebbiano, Chardonnay-Viognier, Syrah-Mourvèdre, Graciano, Roviello, Perricone, Falanghina, Vranec, Carignan, Cabernet-Shiraz, Verdelho, Pedro Ximénez, Marsanne-Roussanne, Malbec Blend, Weissburgunder, Morava, Ruen, Hondarrabi Zuri, Catarratto, Chardonnay-Sauvignon Blanc, Vidal, Rieslaner, Dornfelder, Tinto Fino, Gelber Muskateller, Roter Veltliner, Aragonez, Vitovska, Pinot Noir-Syrah, Gamay Noir, Grauburgunder, Cannonau, Mauzac, Austrian Red Blend, Sémillon, Lambrusco di Sorbara, Teran, Dolcetto, Cinsault, Assyrtico, Teroldego, Tamjanika, Boğazkere, Kadarka, Narince, Malbec-Petit Verdot, Veltliner, Traminer, Lambrusco, Arneis, Cabernet Sauvignon-Shiraz, Tocai Friulano, Fer Servadou, Muskateller, Nerello Cappuccio, Moscatel Roxo, Elbling, Saperavi, Antão Vaz, Pinot Meunier, Petite Syrah, Malvasia, Malbec-Tannat, Kallmet, Syrah-Merlot, Montepulciano, Kerner, Alvarinho-Chardonnay, Žilavka, Vinhão, Chardonnay-Semillon, Carmenère-Cabernet Sauvignon, Merlot-Cabernet Franc, Orangetraube, Cabernet Sauvignon-Sangiovese, Okuzgozu, Viura, Garnacha-Syrah, Zibibbo, Feteasca, Xarel-lo, Prokupac, Códega do Larinho, Touriga Nacional Blend, Inzolia, Cabernet-Syrah, Lambrusco Grasparossa, Malagousia, Cabernet Franc-Malbec, Feteasca Neagra, Yapincak, Tempranillo-Shiraz, Cabernet Sauvignon Grenache, Tinta Roriz, Merlot-Syrah, Tinta Fina, Colombard-Ugni Blanc, Colombard, Roditis, Grenache-Carignan, Emir, Orange Muscat, Karalahna, Trincadeira, Refosco, Pied de Perdrix, Vignoles, Carignan-Grenache, Muscat d'Alexandrie, Bobal, Symphony, Norton, Sauvignon Blanc-Sauvignon Gris, Rkatsiteli, Roussanne-Viognier, Pinela, Blatina, Shiraz-Viognier, Bonarda, Sauvignon Blanc-Chardonnay, Chambourcin, Traminette, Grenache Blend, Jaen, Mondeuse, Feteascǎ Regalǎ, Teroldego Rotaliano, Sangiovese-Cabernet Sauvignon, Listán Negro, Syrah-Petite Sirah, Viognier-Chardonnay, Kuntra, Jacquère, Portuguiser, Grecanico, Verdejo-Viura, Tinto del Pais, Moscato Giallo, Cabernet Sauvignon-Malbec, Mission, Neuburger, Bastardo, Bical, Sacy, Carineña, Garnacha-Tempranillo, Pecorino, Garnacha Blend, Cococciola, Passerina, Gaglioppo, Garnacha Tintorera, Prieto Picudo, Tempranillo Blanco, Cesanese d'Affile, Muscat Canelli, Cabernet, Malvasia Nera, Premsal, Mansois, Welschriesling, Shiraz-Tempranillo, Verdicchio, Sagrantino, Rolle, Trousseau Gris, Counoise, Mantonico, Cariñena-Garnacha, Insolia, Tokaji, Austrian white blend, Shiraz-Grenache, Claret, Syrah-Tempranillo, Uva di Troia, Aleatico, Piedirosso, Viognier-Marsanne, Pinot Grigio-Sauvignon Blanc, Pallagrello Nero, Chardonnay-Albariño, Savagnin, Pinotage, Braucol, Moschofilero, Nero di Troia, Carignano, Susumaniello, Baga-Touriga Nacional, Vidal Blanc, Vernaccia, Corvina, Rondinella, Molinara, Mavrotragano, Garnacha-Monastrell, Lagrein, Cabernet Merlot, Monastrell-Syrah, Malbec-Tempranillo, Syrah-Viognier, Verdeca, Sangiovese Grosso, Merlot-Argaman, Chenin Blanc-Viognier, Garnacha-Cabernet, Maturana, Malvar, Airen, Monica, Gewürztraminer-Riesling, Prugnolo Gentile, Steen, Chenin Blanc-Sauvignon Blanc, Shiraz-Cabernet Sauvignon, Picolit, Prosecco, White Riesling, White Port, Zierfandler, Petroulianos, Mavrodaphne, Savatiano, Tempranillo-Garnacha, Vidadillo, Syrah-Cabernet, Gelber Traminer, Grenache-Shiraz, Rotgipfler, Cabernet Sauvignon-Tempranillo, Edelzwicker, Cortese, Chardonnay Weissburgunder, Torbato, Verduzzo, Debit, Bovale, Tempranillo-Merlot, Xinisteri, Merlot-Cabernet, Verdejo-Sauvignon Blanc, Black Muscat, Koshu, Királyleányka, Favorita, Xinomavro, Cserszegi Fűszeres, Hárslevelü, Pallagrello, Mavroudi, Muscat Blanc, Schiava, Meoru, Nuragus, Trebbiano di Lugana, Coda di Volpe, Raboso, Shiraz-Pinotage, Enantio, Greco Bianco, Tai, Tokay, Muscadel, Cabernet Franc-Carmenère, Tintilia , Segalin, Lacrima, Cerceal, Cayuga, Sauvignon Gris, Albana, Corvina, Macabeo-Moscatel, Macabeo-Chardonnay, Moscadello, Nasco, Viognier-Roussanne, Plavac Mali, Cabernet Sauvignon-Merlot-Shiraz, Sauvignon Blanc-Chenin Blanc, Shiraz-Mourvèdre, Albarín, Black Monukka, Morio Muskat, Nielluciu, Alicante, Cabernet Sauvignon and Tinta Roriz, Viura-Chardonnay, Loin de l'Oeil, Roter Traminer, Karasakiz, Casavecchia, Malvasia-Viura, Nosiola, Incrocio Manzoni, Viura-Verdejo, Erbaluce, Forcallà, Pansa Blanca, Catalanesca, Muscadelle, Malbec-Syrah, Petit Meslier, Johannisberg Riesling, Pignoletto, Cabernet Pfeffer, Syrah-Cabernet Franc, Valdiguié, Mazuelo, Brachetto, Jacquez, Moscofilero, Chardonnay-Sauvignon, Madeleine Angevine, Ruché, Merlot-Petite Verdot, Roussanne-Marsanne, Moscatel de Alejandría, Muscat Blanc à Petit Grain, Sämling, Mtsvane, Zlahtina, Zelen, Doña Blanca, Carmenère-Syrah, Roussanne-Grenache Blanc, Kinali Yapincak, Robola, Pinot Blanc-Chardonnay, Chardonnay-Pinot Blanc, Saperavi-Merlot, Malvasia Istriana, Torontel, Picapoll, Zierfandler-Rotgipfler, Malvasia Fina, Chinuri, Muscatel, Sousão, Silvaner-Traminer, Syrah-Carignan, Bukettraube, Muskat, Argaman, Provence white blend, Touriga Franca, Morillon, Carignan-Syrah, Aidani, Viognier-Grenache Blanc, Albarossa, Sauvignon Blanc-Verdejo, Grenache-Mourvèdre, Tannat-Syrah, Seyval Blanc, Tocai Rosso, Pinot-Chardonnay, Moscatel Graúdo, Pigato, Siegerrebe, Bombino Bianco, Trebbiano-Malvasia, Magliocco, Verduzzo Friulano , Vespaiolo, Marzemino, Tempranillo-Malbec

In [526]:
variety_all = set(df['variety'].unique())
variety_US = set(df[df['country'] == 'US']['variety'].unique())
print(*sorted(list(variety_all - variety_US)))

Agiorgitiko Aidani Airen Albana Albarossa Albarín Aleatico Alfrocheiro Alicante Alsace white blend Alvarinho Alvarinho-Chardonnay Antão Vaz Aragonez Aragonês Argaman Arinto Assyrtico Assyrtiko Austrian Red Blend Austrian white blend Baga Baga-Touriga Nacional Bastardo Bical Blatina Blauburgunder Bobal Bombino Bianco Bonarda Bovale Boğazkere Brachetto Braucol Bukettraube Cabernet Cabernet Franc-Cabernet Sauvignon Cabernet Franc-Carmenère Cabernet Sauvignon Grenache Cabernet Sauvignon and Tinta Roriz Cabernet Sauvignon-Merlot-Shiraz Cabernet Sauvignon-Shiraz Cabernet Sauvignon-Tempranillo Cabernet-Shiraz Cannonau Carignan-Syrah Carignano Carineña Cariñena-Garnacha Carmenère-Cabernet Sauvignon Carmenère-Syrah Carricante Casavecchia Castelão Catalanesca Catarratto Cerceal Cesanese d'Affile Chardonnay Weissburgunder Chardonnay-Pinot Blanc Chardonnay-Sauvignon Chardonnay-Sauvignon Blanc Chasselas Chenin Blanc-Chardonnay Chenin Blanc-Sauvignon Blanc Chinuri Ciliegiolo Cococciola Coda di Volpe Colombard Colombard-Sauvignon Blanc Colombard-Ugni Blanc Corvina Corvina, Rondinella, Molinara Cserszegi Fűszeres Códega do Larinho Doña Blanca Duras Elbling Emir Enantio Encruzado Erbaluce Falanghina Favorita Fer Servadou Fernão Pires Feteasca Feteasca Neagra Feteascǎ Regalǎ Forcallà Frappato Friulano Früburgunder Furmint Gaglioppo Gamay Garganega Garnacha Blanca Garnacha Blend Garnacha Tintorera Garnacha-Cabernet Garnacha-Monastrell Garnacha-Syrah Garnacha-Tempranillo Gelber Muskateller Gelber Traminer Glera Godello Grauburgunder Grecanico Greco Greco Bianco Grenache-Carignan Grenache-Shiraz Grillo Gros Manseng Gros and Petit Manseng Hondarrabi Zuri Hárslevelü Incrocio Manzoni Insolia Inzolia Jacquère Jaen Kadarka Kalecik Karasi Kallmet Karalahna Karasakiz Kekfrankos Kerner Kinali Yapincak Királyleányka Koshu Kuntra Lacrima Lambrusco Lambrusco Grasparossa Lambrusco di Sorbara Listán Negro Loin de l'Oeil Loureiro Macabeo Macabeo-Chardonnay Macabeo-Moscatel Magliocco Malagousia Malagouzia Malbec Blend Malbec-Bonarda Malbec-Cabernet Sauvignon Malbec-Merlot Malbec-Petit Verdot Malbec-Syrah Malbec-Tempranillo Malvar Malvasia Malvasia Fina Malvasia Istriana Malvasia Nera Malvasia-Viura Malvazija Mansois Mantonico Marzemino Maturana Mauzac Mavrodaphne Mavrotragano Mavroudi Mavrud Mazuelo Mencía Meoru Merlot-Argaman Merlot-Malbec Merlot-Syrah Monastrell-Syrah Monica Morava Morillon Moscadello Moscatel Moscatel Graúdo Moscatel Roxo Moscatel de Alejandría Moschofilero Moscofilero Mtsvane Muscadel Muscadelle Muscat Blanc à Petit Grain Muscatel Muskat Muskateller Narince Nasco Negrette Nerello Cappuccio Nerello Mascalese Nero di Troia Neuburger Nielluciu Nosiola Nuragus Okuzgozu Orangetraube Pallagrello Pallagrello Nero Palomino Pansa Blanca Passerina Pecorino Pedro Ximénez Perricone Petit Meslier Petroulianos Picapoll Picolit Pied de Perdrix Piedirosso Pigato Pignoletto Pinela Pinot Auxerrois Pinot Bianco Pinot Blanc-Chardonnay Pinot Nero Pinot Noir-Gamay Plavac Mali Portuguese Red Portuguese Rosé Portuguese Sparkling Portuguese White Portuguiser Posip Premsal Prieto Picudo Prié Blanc Prokupac Prosecco Provence red blend Provence white blend Prugnolo Gentile Pugnitello Raboso Ribolla Gialla Rieslaner Rivaner Robola Roditis Rolle Romorantin Rosado Roter Traminer Roter Veltliner Rotgipfler Roviello Ruché Ruen Sacy Sagrantino Saperavi-Merlot Sauvignon Sauvignon Blanc-Chardonnay Sauvignon Blanc-Chenin Blanc Sauvignon Blanc-Sauvignon Gris Sauvignon Blanc-Verdejo Savagnin Savatiano Schiava Schwartzriesling Segalin Sherry Shiraz-Cabernet Sauvignon Shiraz-Grenache Shiraz-Mourvèdre Shiraz-Pinotage Shiraz-Tempranillo Shiraz-Viognier Silvaner Silvaner-Traminer Siria Sirica Sousão Spätburgunder St. Laurent Steen Susumaniello Syrah-Carignan Sämling Tai Tamjanika Tannat-Cabernet Tannat-Cabernet Franc Tannat-Merlot Tannat-Syrah Tempranillo Blanco Tempranillo-Garnacha Tempranillo-Merlot Tempranillo-Shiraz Teran Teroldego Rotaliano Tinta Fina Tinta Francisca Tinta Roriz Tinta de Toro Tintilia  Tinto Fino Tinto del Pais Tocai Rosso Tokaji Tokay Torbato Torontel Touriga Franca Touriga Nacional Blend Touriga Nacional-Cabernet Sauvignon Trebbiano Trebbiano di Lugana Trebbiano-Malvasia Trepat Trincadeira Turbiana Ugni Blanc-Colombard Uva di Troia Veltliner Verdeca Verdejo-Sauvignon Blanc Verdejo-Viura Verdicchio Verduzzo Verduzzo Friulano  Vernaccia Vespaiolo Vidadillo Vidal Vinhão Vitovska Viura Viura-Chardonnay Viura-Verdejo Vranec Weissburgunder Welschriesling White Port Xarel-lo Xinisteri Xinomavro Yapincak Zelen Zibibbo Zierfandler Zierfandler-Rotgipfler Zlahtina Žilavka

41

In [527]:
df = pd.read_excel('https://stepik.org/media/attachments/lesson/991001/tab3-zpl_2022.xlsx', header=4)
main = df
main.columns = ['name', '2017', '2018', '2019', '2020', '2021', '2022']
main = main[~main['2017'].isna()]
# main.to_excel('data/ab3-zpl_2022.xlsx', index=0)

In [528]:
main.head(3)

,name,2017,2018,2019,2020,2021,2022
0,Всего,39167.0,43724.0,47866.8,51344.0,57243.7,65338.3
1,"сельское, лесное хозяйство, охота, рыболовст...",25671.1,28699.0,31727.6,34770.0,39436.8,46777.0
3,"растениеводство и животноводство, охота и ...",23529.1,25820.0,28395.8,31058.0,35460.2,41993.7

In [529]:
df = pd.read_excel('data/ab3-zpl_2022.xlsx')
df.head()

,name,2017,2018,2019,2020,2021,2022
0,Всего,39167.0,43724,47866.8,51344,57243.7,65338.3
1,"сельское, лесное хозяйство, охота, рыболовст...",25671.1,28699,31727.6,34770,39436.8,46777.0
2,"растениеводство и животноводство, охота и ...",23529.1,25820,28395.8,31058,35460.2,41993.7
3,лесоводство и лесозаготовки,27616.6,32701,35426.2,37855,42151.8,48327.2
4,рыболовство и рыбоводство,68032.0,75766,88603.8,94983,101547.4,121726.2

In [530]:
# Ответить на вопросы:
# - как менялась медианная зарплата с 2017 года (в качестве ответа введите в поле ответа, в первой строке значения медианной зарплаты, округленные до двух знаков после запятой, разделенные пробелом)
# - в следующей строке введите значения средней зарплаты, округленные до двух знаков после запятой, разделенные пробелом за тот же период времени
# - в последней строке введите для каждого года, начиная с 2017, через пробел название отрасли на которую приходится максимальное значение заработной платы.

# Примечание 1. Если в результате расчета получается число, например, 34266., то в ответе его указывайте 34266.0

In [531]:
print(*df.iloc[1:,1:].median(axis=0).round(2).values)
print(*df.iloc[1:,1:].mean(axis=0).round(2).values)
cols = df.drop(0).iloc[:,1:].max().values
cols
df_new = df.drop(0)
years = df_new.columns[1:]
for i in range(len(cols)):
    print(df[df[years[i]] == cols[i]]['name'].values[0].strip(), end=' ')

37933.7 40722.0 43855.0 46549.0 52409.6 59094.6
43118.86 47423.47 51252.01 54553.9 60502.9 69455.65
добыча нефти и природного газа добыча нефти и природного газа добыча нефти и природного газа добыча нефти и природного газа добыча нефти и природного газа добыча нефти и природного газа

In [532]:
df_new = df.set_index('name')
df_new.head()

,2017,2018,2019,2020,2021,2022
name,,,,,,
Всего,39167.0,43724,47866.8,51344,57243.7,65338.3
"сельское, лесное хозяйство, охота, рыболовство и рыбоводство",25671.1,28699,31727.6,34770,39436.8,46777.0
"растениеводство и животноводство, охота и предоставление соответствующих услуг в этих областях",23529.1,25820,28395.8,31058,35460.2,41993.7
лесоводство и лесозаготовки,27616.6,32701,35426.2,37855,42151.8,48327.2
рыболовство и рыбоводство,68032.0,75766,88603.8,94983,101547.4,121726.2

In [533]:
print(*df_new.median().round(2).values)
print(*df_new.mean().round(2).values)
print(*df_new.idxmax().str.strip())

38033.55 40857.0 43991.55 47024.0 52822.7 59766.65
43039.82 47349.48 51184.3 54489.7 60437.71 69373.31
добыча нефти и природного газа добыча нефти и природного газа добыча нефти и природного газа добыча нефти и природного газа добыча нефти и природного газа добыча нефти и природного газа

42

In [534]:
url = 'https://en.wikipedia.org/w/index.php?title=List_of_countries_by_GDP_(nominal)&oldid=1158651928'

df = pd.read_html(url, skiprows=[220], na_values="—")[2]
df.head()

  Country/Territory UN region   IMF[1][13]            World Bank[14]  \
  Country/Territory UN region     Estimate       Year       Estimate
0             World       NaN  105568776.0       2023     96513077.0
1     United States  Americas   26854599.0       2023     22996100.0
2             China      Asia   19373586.0  [n 1]2023     17734063.0
3             Japan      Asia    4409738.0       2023      4937422.0
4           Germany    Europe    4308854.0       2023      4223116.0

             United Nations[15]
        Year           Estimate       Year
0       2021         85328323.0       2020
1       2021         23315081.0       2021
2  [n 3]2021         17734131.0  [n 1]2021
3       2021          4940878.0       2021
4       2021          4259935.0       2021

In [535]:
df.columns

MultiIndex([( 'Country/Territory', 'Country/Territory'),
            (         'UN region',         'UN region'),
            (        'IMF[1][13]',          'Estimate'),
            (        'IMF[1][13]',              'Year'),
            (    'World Bank[14]',          'Estimate'),
            (    'World Bank[14]',              'Year'),
            ('United Nations[15]',          'Estimate'),
            ('United Nations[15]',              'Year')],
           )

In [536]:
# Определите суммарный ВВП для стран региона 'Oceania' по данным МВФ
print(*df.loc[df['UN region', 'UN region'] == 'Oceania', [['IMF[1][13]', 'Estimate']]].sum())

2001941.0

In [537]:
df_new = df.copy()
df_new.columns = df_new.columns.droplevel(0)
df_new.head()

,Country/Territory,UN region,Estimate,Year,Estimate,Year,Estimate,Year
0,World,NaN,105568776.0,2023,96513077.0,2021,85328323.0,2020
1,United States,Americas,26854599.0,2023,22996100.0,2021,23315081.0,2021
2,China,Asia,19373586.0,[n 1]2023,17734063.0,[n 3]2021,17734131.0,[n 1]2021
3,Japan,Asia,4409738.0,2023,4937422.0,2021,4940878.0,2021
4,Germany,Europe,4308854.0,2023,4223116.0,2021,4259935.0,2021

In [538]:
print(df_new[df_new['UN region'] == 'Oceania'].iloc[:, 2].sum())

2001941.0

43

In [539]:
url = 'https://en.wikipedia.org/w/index.php?title=List_of_countries_by_GDP_(nominal)&oldid=1169333787'
df = pd.read_html(url, skiprows=[220], na_values="—")[2]
df.head()

  Country/Territory UN region   IMF[1][13]            World Bank[14]  \
  Country/Territory UN region     Estimate       Year       Estimate
0             World       NaN  105568776.0       2023    100562011.0
1     United States  Americas   26854599.0       2023     25462700.0
2             China      Asia   19373586.0  [n 1]2023     17963171.0
3             Japan      Asia    4409738.0       2023      4231141.0
4           Germany    Europe    4308854.0       2023      4072192.0

             United Nations[15]
        Year           Estimate       Year
0       2022         96698005.0       2021
1       2022         23315081.0       2021
2  [n 3]2022         17734131.0  [n 1]2021
3       2022          4940878.0       2021
4       2022          4259935.0       2021

In [540]:
df_new = df.copy()
df_new.columns = df_new.columns.droplevel(0)
df_new.head()

,Country/Territory,UN region,Estimate,Year,Estimate,Year,Estimate,Year
0,World,NaN,105568776.0,2023,100562011.0,2022,96698005.0,2021
1,United States,Americas,26854599.0,2023,25462700.0,2022,23315081.0,2021
2,China,Asia,19373586.0,[n 1]2023,17963171.0,[n 3]2022,17734131.0,[n 1]2021
3,Japan,Asia,4409738.0,2023,4231141.0,2022,4940878.0,2021
4,Germany,Europe,4308854.0,2023,4072192.0,2022,4259935.0,2021

In [541]:
res = df_new.drop(0).groupby('UN region').median(numeric_only=True).round(1).sort_index(ascending=True).iloc[:,-1]
res

UN region
Africa       15777.0
Americas     16851.0
Asia         69239.0
Europe      116527.0
Oceania        857.0
Name: Estimate, dtype: float64

In [542]:
for k,v in res.items():
    print(f'{k}: {v}', end=' ')

Africa: 15777.0 Americas: 16851.0 Asia: 69239.0 Europe: 116527.0 Oceania: 857.0

44

In [543]:
# Необходимо загрузить данные из файла в DataFrame и вывести список колонок в строку через пробел в поле для ответа.
df = pd.read_parquet('data/example_test.parquet')
df

,row_id,time_id,investment_id,f_0,f_1,f_2,f_3,f_4,f_5,f_6,...,f_290,f_291,f_292,f_293,f_294,f_295,f_296,f_297,f_298,f_299
0,1220_1,1220,1,0.874944,0.457875,0.962572,0.372061,0.004509,0.971304,0.097477,...,0.514031,0.828523,0.437697,0.810764,0.693963,0.186403,0.569144,0.120386,0.419603,0.936966
1,1220_2,1220,2,0.554862,0.445478,0.714034,0.891988,0.703331,0.264478,0.600636,...,0.620919,0.301540,0.687464,0.400168,0.908198,0.272901,0.222430,0.748324,0.858802,0.362829
2,1221_0,1221,0,0.175070,0.918464,0.044379,0.505868,0.037160,0.169001,0.211365,...,0.397710,0.789382,0.238078,0.254068,0.795084,0.491928,0.376725,0.079489,0.995041,0.482283
3,1221_1,1221,1,0.355239,0.689773,0.452643,0.134863,0.794958,0.837197,0.036773,...,0.893571,0.322879,0.674692,0.114160,0.818483,0.287065,0.710537,0.550434,0.899869,0.928997
4,1221_2,1221,2,0.912778,0.462684,0.454067,0.491009,0.050547,0.250051,0.686295,...,0.031662,0.703427,0.861476,0.897927,0.659051,0.356148,0.375990,0.209798,0.175153,0.727160
5,1222_0,1222,0,0.678116,0.158996,0.058148,0.253677,0.984982,0.323493,0.307990,...,0.439604,0.487491,0.080697,0.539750,0.246645,0.435054,0.436709,0.315042,0.133657,0.731483
6,1222_1,1222,1,0.769912,0.060028,0.676047,0.853550,0.411155,0.747515,0.649063,...,0.419152,0.659254,0.198072,0.655397,0.428209,0.769999,0.960219,0.734675,0.028576,0.320976
7,1222_2,1222,2,0.738876,0.980038,0.696796,0.591012,0.882052,0.311484,0.729229,...,0.341144,0.758328,0.010728,0.276859,0.979913,0.486605,0.670140,0.515824,0.580929,0.139308
8,1223_0,1223,0,0.281445,0.571472,0.986828,0.021403,0.789577,0.005765,0.409379,...,0.357828,0.000019,0.504530,0.169174,0.216349,0.503643,0.052721,0.795965,0.909602,0.291668

In [544]:
print(*df.columns)

row_id time_id investment_id f_0 f_1 f_2 f_3 f_4 f_5 f_6 f_7 f_8 f_9 f_10 f_11 f_12 f_13 f_14 f_15 f_16 f_17 f_18 f_19 f_20 f_21 f_22 f_23 f_24 f_25 f_26 f_27 f_28 f_29 f_30 f_31 f_32 f_33 f_34 f_35 f_36 f_37 f_38 f_39 f_40 f_41 f_42 f_43 f_44 f_45 f_46 f_47 f_48 f_49 f_50 f_51 f_52 f_53 f_54 f_55 f_56 f_57 f_58 f_59 f_60 f_61 f_62 f_63 f_64 f_65 f_66 f_67 f_68 f_69 f_70 f_71 f_72 f_73 f_74 f_75 f_76 f_77 f_78 f_79 f_80 f_81 f_82 f_83 f_84 f_85 f_86 f_87 f_88 f_89 f_90 f_91 f_92 f_93 f_94 f_95 f_96 f_97 f_98 f_99 f_100 f_101 f_102 f_103 f_104 f_105 f_106 f_107 f_108 f_109 f_110 f_111 f_112 f_113 f_114 f_115 f_116 f_117 f_118 f_119 f_120 f_121 f_122 f_123 f_124 f_125 f_126 f_127 f_128 f_129 f_130 f_131 f_132 f_133 f_134 f_135 f_136 f_137 f_138 f_139 f_140 f_141 f_142 f_143 f_144 f_145 f_146 f_147 f_148 f_149 f_150 f_151 f_152 f_153 f_154 f_155 f_156 f_157 f_158 f_159 f_160 f_161 f_162 f_163 f_164 f_165 f_166 f_167 f_168 f_169 f_170 f_171 f_172 f_173 f_174 f_175 f_176 f_177 f_178 f_179 f_180 f_181 f_182 f_183 f_184 f_185 f_186 f_187 f_188 f_189 f_190 f_191 f_192 f_193 f_194 f_195 f_196 f_197 f_198 f_199 f_200 f_201 f_202 f_203 f_204 f_205 f_206 f_207 f_208 f_209 f_210 f_211 f_212 f_213 f_214 f_215 f_216 f_217 f_218 f_219 f_220 f_221 f_222 f_223 f_224 f_225 f_226 f_227 f_228 f_229 f_230 f_231 f_232 f_233 f_234 f_235 f_236 f_237 f_238 f_239 f_240 f_241 f_242 f_243 f_244 f_245 f_246 f_247 f_248 f_249 f_250 f_251 f_252 f_253 f_254 f_255 f_256 f_257 f_258 f_259 f_260 f_261 f_262 f_263 f_264 f_265 f_266 f_267 f_268 f_269 f_270 f_271 f_272 f_273 f_274 f_275 f_276 f_277 f_278 f_279 f_280 f_281 f_282 f_283 f_284 f_285 f_286 f_287 f_288 f_289 f_290 f_291 f_292 f_293 f_294 f_295 f_296 f_297 f_298 f_299

45

In [545]:
# Загрузите данные из него в DataFrame и создайте столбец 'f_sum', в котором будут находиться сумма всех столбцов в названии которых есть символ 'f'
cols = list(filter(lambda item: 'f' in item, df.columns))
df_new = df[cols]
df_new['f_sum'] = df_new.sum(axis=1)
print(*df_new['f_sum'].values)
df_new

153.7515119255982 152.44107055570404 152.35145617717106 151.89155947724342 146.68707199232895 142.66664782824935 148.34919054065446 149.9683501389442 144.64564148602278

C:\Users\kuche\AppData\Local\Temp\ipykernel_8436\2990267328.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new['f_sum'] = df_new.sum(axis=1)

,f_0,f_1,f_2,f_3,f_4,f_5,f_6,f_7,f_8,f_9,...,f_291,f_292,f_293,f_294,f_295,f_296,f_297,f_298,f_299,f_sum
0,0.874944,0.457875,0.962572,0.372061,0.004509,0.971304,0.097477,0.246080,0.481052,0.951130,...,0.828523,0.437697,0.810764,0.693963,0.186403,0.569144,0.120386,0.419603,0.936966,153.751512
1,0.554862,0.445478,0.714034,0.891988,0.703331,0.264478,0.600636,0.697096,0.480214,0.145306,...,0.301540,0.687464,0.400168,0.908198,0.272901,0.222430,0.748324,0.858802,0.362829,152.441071
2,0.175070,0.918464,0.044379,0.505868,0.037160,0.169001,0.211365,0.791252,0.739270,0.716251,...,0.789382,0.238078,0.254068,0.795084,0.491928,0.376725,0.079489,0.995041,0.482283,152.351456
3,0.355239,0.689773,0.452643,0.134863,0.794958,0.837197,0.036773,0.713466,0.737016,0.810984,...,0.322879,0.674692,0.114160,0.818483,0.287065,0.710537,0.550434,0.899869,0.928997,151.891559
4,0.912778,0.462684,0.454067,0.491009,0.050547,0.250051,0.686295,0.666958,0.359397,0.457957,...,0.703427,0.861476,0.897927,0.659051,0.356148,0.375990,0.209798,0.175153,0.727160,146.687072
5,0.678116,0.158996,0.058148,0.253677,0.984982,0.323493,0.307990,0.683907,0.161220,0.194053,...,0.487491,0.080697,0.539750,0.246645,0.435054,0.436709,0.315042,0.133657,0.731483,142.666648
6,0.769912,0.060028,0.676047,0.853550,0.411155,0.747515,0.649063,0.628536,0.011890,0.233031,...,0.659254,0.198072,0.655397,0.428209,0.769999,0.960219,0.734675,0.028576,0.320976,148.349191
7,0.738876,0.980038,0.696796,0.591012,0.882052,0.311484,0.729229,0.516416,0.806604,0.160643,...,0.758328,0.010728,0.276859,0.979913,0.486605,0.670140,0.515824,0.580929,0.139308,149.968350
8,0.281445,0.571472,0.986828,0.021403,0.789577,0.005765,0.409379,0.952000,0.530386,0.769527,...,0.000019,0.504530,0.169174,0.216349,0.503643,0.052721,0.795965,0.909602,0.291668,144.645641

In [546]:
cols = [col for col in df.columns if 'f' in col]
print(*df[cols].sum(axis=1).to_list())

153.7515119255982 152.44107055570404 152.35145617717106 151.89155947724342 146.68707199232895 142.66664782824935 148.34919054065446 149.9683501389442 144.64564148602278

46

In [547]:
key = 'e7704bc895b4a8d2dfd4a29d404285b6'
lat = 68.970682
lon = 33.074981
url = 'https://api.openweathermap.org/data/2.5/weather?lat={lat}&lon={lon}&appid={key}'
df = pd.read_table(url)
df

HTTPError: HTTP Error 401: Unauthorized

In [548]:
df = pd.read_table('https://api.openweathermap.org/data/2.5/weather?lat=68.970682&lon=33.074981&appid=e7704bc895b4a8d2dfd4a29d404285b6')
df

Empty DataFrame
Columns: [{"coord":{"lon":33.075,"lat":68.9707},"weather":[{"id":803,"main":"Clouds","description":"broken clouds","icon":"04n"}],"base":"stations","main":{"temp":274.49,"feels_like":271.46,"temp_min":274.49,"temp_max":274.49,"pressure":1016,"humidity":78,"sea_level":1016,"grnd_level":1001},"visibility":10000,"wind":{"speed":2.77,"deg":242,"gust":7.37},"clouds":{"all":64},"dt":1729965402,"sys":{"type":1,"id":8927,"country":"RU","sunrise":1729921301,"sunset":1729948881},"timezone":10800,"id":524305,"name":"Murmansk","cod":200}]
Index: []

In [554]:
my_dict = {"coord":{"lon":33.075,"lat":68.9707},"weather":[{"id":803,"main":"Clouds","description":"broken clouds","icon":"04n"}],"base":"stations","main":{"temp":274.49,"feels_like":271.46,"temp_min":274.49,"temp_max":274.49,"pressure":1016,"humidity":78,"sea_level":1016,"grnd_level":1001},"visibility":10000,"wind":{"speed":2.77,"deg":242,"gust":7.37},"clouds":{"all":64},"dt":1729965402,"sys":{"type":1,"id":8927,"country":"RU","sunrise":1729921301,"sunset":1729948881},"timezone":10800,"id":524305,"name":"Murmansk","cod":200}
print(*my_dict.keys())

coord weather base main visibility wind clouds dt sys timezone id name cod

# DATETIME

In [1187]:
df = pd.read_csv('data\sales.csv', parse_dates=['date'])
print(df['date'].dtype)

df['date'] = pd.to_datetime(df['date'], format='%Y-%m-%d')
print(df['date'].dtype)

df['date'] = df['date'].astype('datetime64[ns]')
print(df['date'].dtype)

df.head()

datetime64[ns]
datetime64[ns]
datetime64[ns]

        date    item  price  quantity
0 2020-01-01   mouse     35         5
1 2020-01-02  laptop     73         4
2 2020-01-03   phone     90         7
3 2020-01-04   phone     91         9
4 2020-01-05   mouse     65         9

In [1188]:
df.loc[df.date.dt.day == 3, ['price', 'quantity']] = 0 
df.head(7)

        date    item  price  quantity
0 2020-01-01   mouse     35         5
1 2020-01-02  laptop     73         4
2 2020-01-03   phone      0         0
3 2020-01-04   phone     91         9
4 2020-01-05   mouse     65         9
5 2020-01-06    book     23         4
6 2020-01-07    book     86         9

# PIVOT and CROSSTAB

In [1189]:
# Пример фрейма данных с данными продаж
data = {'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing'],
        'Region': ['North', 'South', 'North', 'South'],
        'Sales': [1000, 500, 800, 750],
        'Profit': [150, 50, 120, 100]}
df = pd.DataFrame(data)
df

      Category Region  Sales  Profit
0  Electronics  North   1000     150
1     Clothing  South    500      50
2  Electronics  North    800     120
3     Clothing  South    750     100

In [1190]:
# Сводная таблица: сумма продаж по категориям и регионам
pivot_table = pd.pivot_table(df, index='Category', columns='Region', values='Sales', aggfunc='sum')

pivot_table

Region        North   South
Category
Clothing        NaN  1250.0
Electronics  1800.0     NaN

In [1191]:
# Перекрестная табуляция: число категорий по регионам
cross_tab = pd.crosstab(df['Category'], df['Region'])
cross_tab

Region       North  South
Category
Clothing         0      2
Electronics      2      0